save_path:  ./trained_weights/VGG16/CUB200/standard
resuming training

 Namespace(alter_class=108, alter_class_2=0, analysis_class=108, analyze_filter_importance=False, cfe_epochs=200, choose_subclass=False, counterfactual_PP=False, create_counterfactual_combined=True, dataset='CUB200', filter_category_method='own_reduce_loss', filter_modified_directly=True, filter_visualization=True, find_filter_class=False, find_global_filters=False, fine_tune=False, fixed_classes=True, fixed_classes_reduce_loss=True, full_standard=True, high_capacity_model=True, imagenet_weights=True, interpretable=False, l1_weight=2, load_counterfactual_net=True, loss_compute=True, model='VGG16/', resume=True, resume_counterfactual_net=False, save_directory='./trained_weights/', save_filter_fmap=False, save_filter_importance=False, save_logFile=True, save_path='./trained_weights/VGG16/CUB200/standard', save_top_layer=True, test=False, test_counterfactual_net=False, test_filter_importance=False, train=False, train_counterfactual_net=True, train_using_builtin_fit_method=True, visualize_fmaps=False) 

batch_size:  32
CUB200-2011 dataset
[4;33mReloaded modules[24m: tf_explain_modified.core.activations, tf_explain_modified.utils, tf_explain_modified.utils.display, tf_explain_modified.utils.saver, tf_explain_modified.core.grad_cam, tf_explain_modified.core.gradients_inputs, tf_explain_modified.core.vanilla_gradients, tf_explain_modified.core.integrated_gradients, tf_explain_modified.core.occlusion_sensitivity, tf_explain_modified.core.smoothgrad, tf_explain_modified.core, tf_explain_modified.callbacks.activations_visualization, tf_explain_modified.callbacks.grad_cam, tf_explain_modified.callbacks.gradients_inputs, tf_explain_modified.callbacks.vanilla_gradients, tf_explain_modified.callbacks.integrated_gradients, tf_explain_modified.callbacks.occlusion_sensitivity, tf_explain_modified.callbacks.smoothgrad, tf_explain_modified.callbacks, tf_explain_modified, models10, codes.compute_filter_importance, codes.load_cxr_dataset, codes.support_functions, codes.find_filter_class, codes.train_counterfactual_net, codes.filter_visualization_top_k, codes.filter_visualization_same_image, codes.model_accuracy_with_disabled_filters[0m
TF version:  2.4.0
...GPU set_memory_growth successfully set...
"base_model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_3 (InputLayer)            [(None, 224, 224, 3) 0                                            
__________________________________________________________________________________________________
block1_conv1 (Conv2D)           (None, 224, 224, 64) 1792        input_3[0][0]                    
__________________________________________________________________________________________________
block1_conv2 (Conv2D)           (None, 224, 224, 64) 36928       block1_conv1[0][0]               
__________________________________________________________________________________________________
block1_pool (MaxPooling2D)      (None, 112, 112, 64) 0           block1_conv2[0][0]               
__________________________________________________________________________________________________
block2_conv1 (Conv2D)           (None, 112, 112, 128 73856       block1_pool[0][0]                
__________________________________________________________________________________________________
block2_conv2 (Conv2D)           (None, 112, 112, 128 147584      block2_conv1[0][0]               
__________________________________________________________________________________________________
block2_pool (MaxPooling2D)      (None, 56, 56, 128)  0           block2_conv2[0][0]               
__________________________________________________________________________________________________
block3_conv1 (Conv2D)           (None, 56, 56, 256)  295168      block2_pool[0][0]                
__________________________________________________________________________________________________
block3_conv2 (Conv2D)           (None, 56, 56, 256)  590080      block3_conv1[0][0]               
__________________________________________________________________________________________________
block3_conv3 (Conv2D)           (None, 56, 56, 256)  590080      block3_conv2[0][0]               
__________________________________________________________________________________________________
block3_pool (MaxPooling2D)      (None, 28, 28, 256)  0           block3_conv3[0][0]               
__________________________________________________________________________________________________
block4_conv1 (Conv2D)           (None, 28, 28, 512)  1180160     block3_pool[0][0]                
__________________________________________________________________________________________________
block4_conv2 (Conv2D)           (None, 28, 28, 512)  2359808     block4_conv1[0][0]               
__________________________________________________________________________________________________
block4_conv3 (Conv2D)           (None, 28, 28, 512)  2359808     block4_conv2[0][0]               
__________________________________________________________________________________________________
block4_pool (MaxPooling2D)      (None, 14, 14, 512)  0           block4_conv3[0][0]               
__________________________________________________________________________________________________
block5_conv1 (Conv2D)           (None, 14, 14, 512)  2359808     block4_pool[0][0]                
__________________________________________________________________________________________________
block5_conv2 (Conv2D)           (None, 14, 14, 512)  2359808     block5_conv1[0][0]               
__________________________________________________________________________________________________
block5_conv3 (Conv2D)           (None, 14, 14, 512)  2359808     block5_conv2[0][0]               
__________________________________________________________________________________________________
max_pooling2d_2 (MaxPooling2D)  (None, 7, 7, 512)    0           block5_conv3[0][0]               
__________________________________________________________________________________________________
global_average_pooling2d_2 (Glo (None, 512)          0           max_pooling2d_2[0][0]            
__________________________________________________________________________________________________
input_4 (InputLayer)            [(None, 512)]        0                                            
__________________________________________________________________________________________________
tf.__operators__.add_1 (TFOpLam (None, 512)          0           global_average_pooling2d_2[0][0] 
                                                                 input_4[0][0]                    
__________________________________________________________________________________________________
dense_2 (Dense)                 (None, 200)          102600      tf.__operators__.add_1[0][0]     
__________________________________________________________________________________________________
activation_1 (Activation)       (None, 200)          0           dense_2[0][0]                    
==================================================================================================
Total params: 14,817,288
Trainable params: 102,600
Non-trainable params: 14,714,688
__________________________________________________________________________________________________
weights loaded
Model: "counterfactual_model"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_3 (InputLayer)         [(None, 224, 224, 3)]     0         
_________________________________________________________________
block1_conv1 (Conv2D)        (None, 224, 224, 64)      1792      
_________________________________________________________________
block1_conv2 (Conv2D)        (None, 224, 224, 64)      36928     
_________________________________________________________________
block1_pool (MaxPooling2D)   (None, 112, 112, 64)      0         
_________________________________________________________________
block2_conv1 (Conv2D)        (None, 112, 112, 128)     73856     
_________________________________________________________________
block2_conv2 (Conv2D)        (None, 112, 112, 128)     147584    
_________________________________________________________________
block2_pool (MaxPooling2D)   (None, 56, 56, 128)       0         
_________________________________________________________________
block3_conv1 (Conv2D)        (None, 56, 56, 256)       295168    
_________________________________________________________________
block3_conv2 (Conv2D)        (None, 56, 56, 256)       590080    
_________________________________________________________________
block3_conv3 (Conv2D)        (None, 56, 56, 256)       590080    
_________________________________________________________________
block3_pool (MaxPooling2D)   (None, 28, 28, 256)       0         
_________________________________________________________________
block4_conv1 (Conv2D)        (None, 28, 28, 512)       1180160   
_________________________________________________________________
block4_conv2 (Conv2D)        (None, 28, 28, 512)       2359808   
_________________________________________________________________
block4_conv3 (Conv2D)        (None, 28, 28, 512)       2359808   
_________________________________________________________________
block4_pool (MaxPooling2D)   (None, 14, 14, 512)       0         
_________________________________________________________________
block5_conv1 (Conv2D)        (None, 14, 14, 512)       2359808   
_________________________________________________________________
block5_conv2 (Conv2D)        (None, 14, 14, 512)       2359808   
_________________________________________________________________
block5_conv3 (Conv2D)        (None, 14, 14, 512)       2359808   
_________________________________________________________________
max_pooling2d_3 (MaxPooling2 (None, 7, 7, 512)         0         
_________________________________________________________________
global_average_pooling2d_3 ( (None, 512)               0         
_________________________________________________________________
dense_3 (Dense)              (None, 512)               262656    
=================================================================
Total params: 14,977,344
Trainable params: 262,656
Non-trainable params: 14,714,688
_________________________________________________________________
threshold:  0.5
l1 weight:  2
training CF model for alter class:  109.American_Redstart
Training CF model for PNs
Model: "model_2"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_5 (InputLayer)            [(None, 224, 224, 3) 0                                            
__________________________________________________________________________________________________
counterfactual_model (Functiona (None, 512)          14977344    input_5[0][0]                    
__________________________________________________________________________________________________
base_model (Functional)         [(None, 200), (None, 14817288    input_5[0][0]                    
                                                                 counterfactual_model[0][0]       
==================================================================================================
Total params: 15,079,944
Trainable params: 262,656
Non-trainable params: 14,817,288
__________________________________________________________________________________________________
training for fixed alter class:  109.American_Redstart
  0%|          | 0/169 [00:00<?, ?it/s]epoch 0: 100%|##########| 169/169 [02:22<00:00,  1.19it/s, acc=0.737, loss=[3.4730644, 0.0, -1.8265054, 0.0, 57.0903, 15.3959875]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 1: 100%|##########| 169/169 [01:07<00:00,  2.50it/s, acc=0.786, loss=[0.98882324, 0.0, -1.8087187, 0.0, 21.544193, 13.503482]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 2: 100%|##########| 169/169 [01:10<00:00,  2.41it/s, acc=0.797, loss=[0.829577, 0.0, -1.7719591, 0.0, 18.908161, 12.72868]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 3: 100%|##########| 169/169 [01:13<00:00,  2.29it/s, acc=0.804, loss=[0.7378135, 0.0, -1.7363112, 0.0, 17.747719, 12.274195]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 4: 100%|##########| 169/169 [01:09<00:00,  2.45it/s, acc=0.81, loss=[0.6783961, 0.0, -1.7127855, 0.0, 16.882027, 11.965406]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 5: 100%|##########| 169/169 [01:05<00:00,  2.58it/s, acc=0.815, loss=[0.61707526, 0.0, -1.6927536, 0.0, 16.294132, 11.73791]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 6: 100%|##########| 169/169 [01:04<00:00,  2.63it/s, acc=0.817, loss=[0.5823172, 0.0, -1.6749053, 0.0, 15.941075, 11.559836]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 7: 100%|##########| 169/169 [01:04<00:00,  2.62it/s, acc=0.819, loss=[0.5511239, 0.0, -1.6592225, 0.0, 15.488413, 11.413888]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 8: 100%|##########| 169/169 [01:05<00:00,  2.60it/s, acc=0.823, loss=[0.5275344, 0.0, -1.6463294, 0.0, 15.1634, 11.291367]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 9: 100%|##########| 169/169 [01:05<00:00,  2.60it/s, acc=0.827, loss=[0.48940328, 0.0, -1.635383, 0.0, 14.957286, 11.187979]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 10: 100%|##########| 169/169 [01:05<00:00,  2.58it/s, acc=0.827, loss=[0.47388035, 0.0, -1.6264907, 0.0, 14.694835, 11.097728]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 11: 100%|##########| 169/169 [01:05<00:00,  2.58it/s, acc=0.832, loss=[0.46022484, 0.0, -1.61666, 0.0, 14.472325, 11.01782]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 12: 100%|##########| 169/169 [01:05<00:00,  2.57it/s, acc=0.834, loss=[0.4425266, 0.0, -1.6091354, 0.0, 14.28162, 10.947056]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 13: 100%|##########| 169/169 [01:05<00:00,  2.58it/s, acc=0.839, loss=[0.42406607, 0.0, -1.6012605, 0.0, 14.122474, 10.88318]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 14: 100%|##########| 169/169 [01:04<00:00,  2.61it/s, acc=0.839, loss=[0.41822386, 0.0, -1.5943677, 0.0, 13.9842205, 10.825004]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 15: 100%|##########| 169/169 [01:04<00:00,  2.61it/s, acc=0.843, loss=[0.40385368, 0.0, -1.588067, 0.0, 13.7865505, 10.772138]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 16: 100%|##########| 169/169 [01:04<00:00,  2.61it/s, acc=0.841, loss=[0.3946263, 0.0, -1.5830414, 0.0, 13.668947, 10.723729]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 17: 100%|##########| 169/169 [01:05<00:00,  2.60it/s, acc=0.84, loss=[0.3826352, 0.0, -1.5764055, 0.0, 13.567, 10.678866]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 18: 100%|##########| 169/169 [01:05<00:00,  2.58it/s, acc=0.846, loss=[0.37198228, 0.0, -1.5723855, 0.0, 13.440828, 10.637341]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 19: 100%|##########| 169/169 [01:04<00:00,  2.61it/s, acc=0.85, loss=[0.36704716, 0.0, -1.5671139, 0.0, 13.357371, 10.598704]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 20: 100%|##########| 169/169 [01:04<00:00,  2.60it/s, acc=0.855, loss=[0.36252773, 0.0, -1.5627091, 0.0, 13.20858, 10.5623865]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 21: 100%|##########| 169/169 [01:04<00:00,  2.61it/s, acc=0.852, loss=[0.35623482, 0.0, -1.5580542, 0.0, 13.16303, 10.528401]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 22: 100%|##########| 169/169 [01:04<00:00,  2.60it/s, acc=0.859, loss=[0.34537125, 0.0, -1.5553126, 0.0, 13.030388, 10.496592]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 23: 100%|##########| 169/169 [01:04<00:00,  2.61it/s, acc=0.856, loss=[0.34428677, 0.0, -1.552591, 0.0, 12.939411, 10.466683]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 24: 100%|##########| 169/169 [01:05<00:00,  2.60it/s, acc=0.864, loss=[0.33523723, 0.0, -1.5478979, 0.0, 12.90588, 10.438245]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 25: 100%|##########| 169/169 [01:04<00:00,  2.62it/s, acc=0.868, loss=[0.3329105, 0.0, -1.5435935, 0.0, 12.82304, 10.411173]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 26: 100%|##########| 169/169 [01:05<00:00,  2.57it/s, acc=0.866, loss=[0.32744128, 0.0, -1.5415245, 0.0, 12.73348, 10.385548]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 27: 100%|##########| 169/169 [01:05<00:00,  2.59it/s, acc=0.868, loss=[0.3232207, 0.0, -1.5369976, 0.0, 12.708703, 10.361149]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 28: 100%|##########| 169/169 [01:05<00:00,  2.59it/s, acc=0.87, loss=[0.3171336, 0.0, -1.535535, 0.0, 12.611009, 10.338021]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 29: 100%|##########| 169/169 [01:04<00:00,  2.61it/s, acc=0.871, loss=[0.31544042, 0.0, -1.5318501, 0.0, 12.5782175, 10.315817]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 30: 100%|##########| 169/169 [01:05<00:00,  2.57it/s, acc=0.869, loss=[0.31046835, 0.0, -1.5295486, 0.0, 12.471154, 10.294508]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 31: 100%|##########| 169/169 [01:05<00:00,  2.60it/s, acc=0.872, loss=[0.30906394, 0.0, -1.5260851, 0.0, 12.456176, 10.274127]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 32: 100%|##########| 169/169 [01:05<00:00,  2.58it/s, acc=0.879, loss=[0.30406076, 0.0, -1.5250692, 0.0, 12.396512, 10.25474]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 33: 100%|##########| 169/169 [01:03<00:00,  2.65it/s, acc=0.877, loss=[0.3037281, 0.0, -1.5220091, 0.0, 12.314781, 10.235937]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 34: 100%|##########| 169/169 [01:03<00:00,  2.67it/s, acc=0.879, loss=[0.29904997, 0.0, -1.5196954, 0.0, 12.292222, 10.217995]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 35: 100%|##########| 169/169 [01:03<00:00,  2.66it/s, acc=0.878, loss=[0.2960687, 0.0, -1.5173777, 0.0, 12.228982, 10.200682]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 36: 100%|##########| 169/169 [01:03<00:00,  2.65it/s, acc=0.886, loss=[0.29446498, 0.0, -1.5151483, 0.0, 12.218688, 10.184023]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 37: 100%|##########| 169/169 [01:04<00:00,  2.63it/s, acc=0.886, loss=[0.289245, 0.0, -1.5125605, 0.0, 12.151566, 10.167935]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 38: 100%|##########| 169/169 [01:03<00:00,  2.66it/s, acc=0.892, loss=[0.29000735, 0.0, -1.511052, 0.0, 12.059727, 10.152349]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 39: 100%|##########| 169/169 [01:04<00:00,  2.63it/s, acc=0.891, loss=[0.28530902, 0.0, -1.5088406, 0.0, 12.03914, 10.137359]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 40: 100%|##########| 169/169 [01:03<00:00,  2.64it/s, acc=0.894, loss=[0.28326347, 0.0, -1.50669, 0.0, 12.011464, 10.122814]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 41: 100%|##########| 169/169 [01:04<00:00,  2.64it/s, acc=0.889, loss=[0.28095427, 0.0, -1.5051752, 0.0, 11.981139, 10.108797]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 42: 100%|##########| 169/169 [01:03<00:00,  2.66it/s, acc=0.892, loss=[0.28015697, 0.0, -1.5033462, 0.0, 11.928254, 10.09518]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 43: 100%|##########| 169/169 [01:03<00:00,  2.68it/s, acc=0.894, loss=[0.28025216, 0.0, -1.5007178, 0.0, 11.877095, 10.081911]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 44: 100%|##########| 169/169 [01:03<00:00,  2.66it/s, acc=0.891, loss=[0.27451107, 0.0, -1.500618, 0.0, 11.878636, 10.069217]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 45: 100%|##########| 169/169 [01:04<00:00,  2.64it/s, acc=0.896, loss=[0.27769, 0.0, -1.4972478, 0.0, 11.821006, 10.05671]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 46: 100%|##########| 169/169 [01:04<00:00,  2.62it/s, acc=0.902, loss=[0.27006534, 0.0, -1.4971837, 0.0, 11.778477, 10.044688]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 47: 100%|##########| 169/169 [01:03<00:00,  2.64it/s, acc=0.898, loss=[0.2734088, 0.0, -1.4950304, 0.0, 11.737303, 10.032904]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 48: 100%|##########| 169/169 [01:04<00:00,  2.64it/s, acc=0.905, loss=[0.26806685, 0.0, -1.494, 0.0, 11.716161, 10.021504]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 49: 100%|##########| 169/169 [01:03<00:00,  2.64it/s, acc=0.899, loss=[0.27117524, 0.0, -1.492018, 0.0, 11.649038, 10.010339]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 50: 100%|##########| 169/169 [01:04<00:00,  2.63it/s, acc=0.907, loss=[0.26616094, 0.0, -1.490712, 0.0, 11.678748, 9.999543]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 51: 100%|##########| 169/169 [01:05<00:00,  2.60it/s, acc=0.906, loss=[0.26586646, 0.0, -1.4888185, 0.0, 11.612488, 9.988977]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 52: 100%|##########| 169/169 [01:08<00:00,  2.48it/s, acc=0.908, loss=[0.26381, 0.0, -1.4876089, 0.0, 11.592271, 9.978677]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 53: 100%|##########| 169/169 [01:07<00:00,  2.49it/s, acc=0.91, loss=[0.2626752, 0.0, -1.4867053, 0.0, 11.566753, 9.968681]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 54: 100%|##########| 169/169 [01:06<00:00,  2.52it/s, acc=0.912, loss=[0.26465452, 0.0, -1.4845985, 0.0, 11.524223, 9.958823]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 55: 100%|##########| 169/169 [01:04<00:00,  2.61it/s, acc=0.913, loss=[0.25933963, 0.0, -1.4839772, 0.0, 11.508815, 9.949286]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 56: 100%|##########| 169/169 [01:03<00:00,  2.65it/s, acc=0.913, loss=[0.26037806, 0.0, -1.482516, 0.0, 11.469798, 9.939942]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 57: 100%|##########| 169/169 [01:04<00:00,  2.62it/s, acc=0.918, loss=[0.25850993, 0.0, -1.4808762, 0.0, 11.465853, 9.930797]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 58: 100%|##########| 169/169 [01:04<00:00,  2.62it/s, acc=0.913, loss=[0.25659695, 0.0, -1.4796106, 0.0, 11.445451, 9.921873]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 59: 100%|##########| 169/169 [01:04<00:00,  2.62it/s, acc=0.918, loss=[0.25495467, 0.0, -1.4786396, 0.0, 11.388128, 9.913154]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 60: 100%|##########| 169/169 [01:04<00:00,  2.63it/s, acc=0.915, loss=[0.25450033, 0.0, -1.4770274, 0.0, 11.393183, 9.904632]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 61: 100%|##########| 169/169 [01:03<00:00,  2.64it/s, acc=0.919, loss=[0.25288412, 0.0, -1.4772824, 0.0, 11.326307, 9.896319]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 62: 100%|##########| 169/169 [01:04<00:00,  2.64it/s, acc=0.921, loss=[0.25456825, 0.0, -1.4748974, 0.0, 11.338881, 9.888123]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 63: 100%|##########| 169/169 [01:03<00:00,  2.65it/s, acc=0.922, loss=[0.251261, 0.0, -1.4741346, 0.0, 11.316074, 9.880134]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 64: 100%|##########| 169/169 [01:04<00:00,  2.63it/s, acc=0.925, loss=[0.2507029, 0.0, -1.4732395, 0.0, 11.301159, 9.872308]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 65: 100%|##########| 169/169 [01:04<00:00,  2.61it/s, acc=0.925, loss=[0.24988823, 0.0, -1.4716114, 0.0, 11.265841, 9.864633]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 66: 100%|##########| 169/169 [01:04<00:00,  2.61it/s, acc=0.924, loss=[0.25055096, 0.0, -1.4712099, 0.0, 11.237056, 9.857095]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 67: 100%|##########| 169/169 [01:04<00:00,  2.61it/s, acc=0.926, loss=[0.24851061, 0.0, -1.4698715, 0.0, 11.240878, 9.849713]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 68: 100%|##########| 169/169 [01:04<00:00,  2.62it/s, acc=0.928, loss=[0.24622187, 0.0, -1.4696445, 0.0, 11.207779, 9.842508]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 69: 100%|##########| 169/169 [01:04<00:00,  2.63it/s, acc=0.929, loss=[0.24665914, 0.0, -1.4680207, 0.0, 11.193787, 9.835421]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 70: 100%|##########| 169/169 [01:04<00:00,  2.63it/s, acc=0.931, loss=[0.2480461, 0.0, -1.4665062, 0.0, 11.185528, 9.828426]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 71: 100%|##########| 169/169 [01:04<00:00,  2.61it/s, acc=0.929, loss=[0.24448228, 0.0, -1.4666892, 0.0, 11.152737, 9.821623]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 72: 100%|##########| 169/169 [01:04<00:00,  2.63it/s, acc=0.93, loss=[0.2427365, 0.0, -1.4658675, 0.0, 11.140779, 9.814941]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 73: 100%|##########| 169/169 [01:04<00:00,  2.62it/s, acc=0.93, loss=[0.24449934, 0.0, -1.464397, 0.0, 11.1152, 9.808345]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 74: 100%|##########| 169/169 [01:04<00:00,  2.64it/s, acc=0.935, loss=[0.24324799, 0.0, -1.4628977, 0.0, 11.12426, 9.801881]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 75: 100%|##########| 169/169 [01:04<00:00,  2.62it/s, acc=0.932, loss=[0.24309175, 0.0, -1.4629571, 0.0, 11.08512, 9.795527]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 76: 100%|##########| 169/169 [01:04<00:00,  2.62it/s, acc=0.937, loss=[0.2418549, 0.0, -1.4618195, 0.0, 11.071561, 9.7892885]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 77: 100%|##########| 169/169 [01:04<00:00,  2.62it/s, acc=0.936, loss=[0.241098, 0.0, -1.4615817, 0.0, 11.030634, 9.78316]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 78: 100%|##########| 169/169 [01:04<00:00,  2.62it/s, acc=0.938, loss=[0.24003711, 0.0, -1.4597255, 0.0, 11.061329, 9.777122]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 79: 100%|##########| 169/169 [01:04<00:00,  2.63it/s, acc=0.935, loss=[0.2394269, 0.0, -1.4597465, 0.0, 11.0286, 9.771214]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 80: 100%|##########| 169/169 [01:04<00:00,  2.63it/s, acc=0.936, loss=[0.23856491, 0.0, -1.4589808, 0.0, 11.016519, 9.765407]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 81: 100%|##########| 169/169 [01:04<00:00,  2.61it/s, acc=0.944, loss=[0.23751472, 0.0, -1.4581193, 0.0, 11.007458, 9.759683]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 82: 100%|##########| 169/169 [01:04<00:00,  2.62it/s, acc=0.939, loss=[0.23884217, 0.0, -1.4571141, 0.0, 10.968811, 9.754051]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 83: 100%|##########| 169/169 [01:04<00:00,  2.61it/s, acc=0.943, loss=[0.23710202, 0.0, -1.4563267, 0.0, 10.974483, 9.748492]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 84: 100%|##########| 169/169 [01:04<00:00,  2.63it/s, acc=0.939, loss=[0.23840012, 0.0, -1.4554178, 0.0, 10.949889, 9.743019]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 85: 100%|##########| 169/169 [01:03<00:00,  2.65it/s, acc=0.942, loss=[0.23787892, 0.0, -1.4547697, 0.0, 10.92468, 9.737651]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 86: 100%|##########| 169/169 [01:04<00:00,  2.62it/s, acc=0.944, loss=[0.2364748, 0.0, -1.4543022, 0.0, 10.929795, 9.732352]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 87: 100%|##########| 169/169 [01:04<00:00,  2.62it/s, acc=0.943, loss=[0.23576632, 0.0, -1.453612, 0.0, 10.896326, 9.727133]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 88: 100%|##########| 169/169 [01:04<00:00,  2.63it/s, acc=0.944, loss=[0.23568213, 0.0, -1.4528252, 0.0, 10.90853, 9.721996]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 89: 100%|##########| 169/169 [01:04<00:00,  2.62it/s, acc=0.946, loss=[0.2362807, 0.0, -1.4517471, 0.0, 10.863166, 9.716917]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 90: 100%|##########| 169/169 [01:04<00:00,  2.62it/s, acc=0.947, loss=[0.23469983, 0.0, -1.451603, 0.0, 10.877404, 9.711944]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 91: 100%|##########| 169/169 [01:03<00:00,  2.65it/s, acc=0.949, loss=[0.23410249, 0.0, -1.4505273, 0.0, 10.84449, 9.707019]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 92: 100%|##########| 169/169 [01:04<00:00,  2.64it/s, acc=0.949, loss=[0.23399626, 0.0, -1.4500405, 0.0, 10.826244, 9.70216]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 93: 100%|##########| 169/169 [01:04<00:00,  2.62it/s, acc=0.947, loss=[0.23360267, 0.0, -1.4495873, 0.0, 10.819773, 9.697382]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 94: 100%|##########| 169/169 [01:04<00:00,  2.61it/s, acc=0.949, loss=[0.23344791, 0.0, -1.4485989, 0.0, 10.815952, 9.692671]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 95: 100%|##########| 169/169 [01:04<00:00,  2.63it/s, acc=0.948, loss=[0.23282312, 0.0, -1.4484718, 0.0, 10.7655325, 9.688027]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 96: 100%|##########| 169/169 [01:04<00:00,  2.62it/s, acc=0.951, loss=[0.23083943, 0.0, -1.4475977, 0.0, 10.771881, 9.683453]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 97: 100%|##########| 169/169 [01:03<00:00,  2.64it/s, acc=0.949, loss=[0.23367806, 0.0, -1.4466431, 0.0, 10.775148, 9.678913]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 98: 100%|##########| 169/169 [01:04<00:00,  2.64it/s, acc=0.952, loss=[0.23138608, 0.0, -1.4464552, 0.0, 10.743343, 9.674444]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 99: 100%|##########| 169/169 [01:03<00:00,  2.66it/s, acc=0.955, loss=[0.23077928, 0.0, -1.4462476, 0.0, 10.718442, 9.670047]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 100: 100%|##########| 169/169 [01:03<00:00,  2.64it/s, acc=0.954, loss=[0.2305155, 0.0, -1.4453298, 0.0, 10.710983, 9.665703]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 101: 100%|##########| 169/169 [01:02<00:00,  2.68it/s, acc=0.955, loss=[0.23025987, 0.0, -1.4444162, 0.0, 10.699458, 9.661414]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 102: 100%|##########| 169/169 [01:03<00:00,  2.66it/s, acc=0.954, loss=[0.2316504, 0.0, -1.4439392, 0.0, 10.693602, 9.657168]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 103: 100%|##########| 169/169 [01:03<00:00,  2.67it/s, acc=0.955, loss=[0.22897786, 0.0, -1.4436446, 0.0, 10.671721, 9.653002]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 104: 100%|##########| 169/169 [01:03<00:00,  2.66it/s, acc=0.956, loss=[0.22961102, 0.0, -1.4429414, 0.0, 10.657483, 9.648868]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 105: 100%|##########| 169/169 [01:03<00:00,  2.65it/s, acc=0.954, loss=[0.22872354, 0.0, -1.4423184, 0.0, 10.674248, 9.644813]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 106: 100%|##########| 169/169 [01:03<00:00,  2.65it/s, acc=0.956, loss=[0.22931316, 0.0, -1.4422575, 0.0, 10.636341, 9.640792]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 107: 100%|##########| 169/169 [01:03<00:00,  2.68it/s, acc=0.959, loss=[0.22959496, 0.0, -1.4408629, 0.0, 10.636464, 9.636804]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 108: 100%|##########| 169/169 [01:03<00:00,  2.65it/s, acc=0.959, loss=[0.22815508, 0.0, -1.4409461, 0.0, 10.601517, 9.632875]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 109: 100%|##########| 169/169 [01:03<00:00,  2.66it/s, acc=0.959, loss=[0.228398, 0.0, -1.4404012, 0.0, 10.598496, 9.628989]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 110: 100%|##########| 169/169 [01:04<00:00,  2.63it/s, acc=0.961, loss=[0.22768898, 0.0, -1.4393874, 0.0, 10.59338, 9.625143]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 111: 100%|##########| 169/169 [01:03<00:00,  2.66it/s, acc=0.959, loss=[0.22728348, 0.0, -1.4388672, 0.0, 10.595538, 9.621347]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 112: 100%|##########| 169/169 [01:03<00:00,  2.66it/s, acc=0.961, loss=[0.22641373, 0.0, -1.4392254, 0.0, 10.563979, 9.617614]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 113: 100%|##########| 169/169 [01:03<00:00,  2.64it/s, acc=0.962, loss=[0.2278794, 0.0, -1.4377673, 0.0, 10.568787, 9.613898]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 114: 100%|##########| 169/169 [01:04<00:00,  2.61it/s, acc=0.963, loss=[0.22644669, 0.0, -1.4375323, 0.0, 10.555781, 9.610242]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 115: 100%|##########| 169/169 [01:04<00:00,  2.63it/s, acc=0.959, loss=[0.22760384, 0.0, -1.4373404, 0.0, 10.529586, 9.606622]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 116: 100%|##########| 169/169 [01:04<00:00,  2.63it/s, acc=0.961, loss=[0.2258478, 0.0, -1.4367023, 0.0, 10.54931, 9.603044]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 117: 100%|##########| 169/169 [01:04<00:00,  2.62it/s, acc=0.961, loss=[0.22694394, 0.0, -1.4358487, 0.0, 10.5153475, 9.599494]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 118: 100%|##########| 169/169 [01:03<00:00,  2.64it/s, acc=0.964, loss=[0.22538401, 0.0, -1.4356073, 0.0, 10.532668, 9.595989]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 119: 100%|##########| 169/169 [01:04<00:00,  2.64it/s, acc=0.964, loss=[0.22578096, 0.0, -1.4352483, 0.0, 10.506781, 9.592533]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 120: 100%|##########| 169/169 [01:04<00:00,  2.62it/s, acc=0.965, loss=[0.2247444, 0.0, -1.4346453, 0.0, 10.499815, 9.589105]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 121: 100%|##########| 169/169 [01:04<00:00,  2.63it/s, acc=0.963, loss=[0.22557014, 0.0, -1.4342452, 0.0, 10.480584, 9.585712]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 122: 100%|##########| 169/169 [01:03<00:00,  2.65it/s, acc=0.965, loss=[0.22447798, 0.0, -1.4338171, 0.0, 10.48792, 9.58237]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 123: 100%|##########| 169/169 [01:04<00:00,  2.63it/s, acc=0.967, loss=[0.226615, 0.0, -1.4327323, 0.0, 10.49211, 9.579045]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 124: 100%|##########| 169/169 [01:04<00:00,  2.63it/s, acc=0.967, loss=[0.22322854, 0.0, -1.4331764, 0.0, 10.453156, 9.575778]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 125: 100%|##########| 169/169 [01:04<00:00,  2.63it/s, acc=0.966, loss=[0.2229346, 0.0, -1.4329959, 0.0, 10.457224, 9.57256]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 126: 100%|##########| 169/169 [01:04<00:00,  2.63it/s, acc=0.966, loss=[0.22743888, 0.0, -1.4314021, 0.0, 10.452971, 9.5693245]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 127: 100%|##########| 169/169 [01:04<00:00,  2.62it/s, acc=0.967, loss=[0.22331046, 0.0, -1.4313755, 0.0, 10.436945, 9.56615]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 128: 100%|##########| 169/169 [01:04<00:00,  2.62it/s, acc=0.967, loss=[0.22284612, 0.0, -1.4312268, 0.0, 10.430165, 9.563007]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 129: 100%|##########| 169/169 [01:04<00:00,  2.61it/s, acc=0.967, loss=[0.22535653, 0.0, -1.430043, 0.0, 10.407975, 9.559878]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 130: 100%|##########| 169/169 [01:04<00:00,  2.63it/s, acc=0.969, loss=[0.22182387, 0.0, -1.4305099, 0.0, 10.413462, 9.556805]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 131: 100%|##########| 169/169 [01:04<00:00,  2.61it/s, acc=0.97, loss=[0.22388183, 0.0, -1.4291872, 0.0, 10.40662, 9.553741]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 132: 100%|##########| 169/169 [01:04<00:00,  2.63it/s, acc=0.971, loss=[0.22380723, 0.0, -1.4290204, 0.0, 10.383506, 9.550709]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 133: 100%|##########| 169/169 [01:03<00:00,  2.66it/s, acc=0.97, loss=[0.22250244, 0.0, -1.4283879, 0.0, 10.403908, 9.547719]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 134: 100%|##########| 169/169 [01:03<00:00,  2.65it/s, acc=0.969, loss=[0.22259575, 0.0, -1.4286374, 0.0, 10.350469, 9.544756]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 135: 100%|##########| 169/169 [01:04<00:00,  2.63it/s, acc=0.969, loss=[0.22266813, 0.0, -1.4280097, 0.0, 10.36748, 9.541826]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 136: 100%|##########| 169/169 [01:03<00:00,  2.66it/s, acc=0.971, loss=[0.22234988, 0.0, -1.4274814, 0.0, 10.353057, 9.538918]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 137: 100%|##########| 169/169 [01:03<00:00,  2.67it/s, acc=0.971, loss=[0.22244161, 0.0, -1.4271353, 0.0, 10.345106, 9.536037]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 138: 100%|##########| 169/169 [01:03<00:00,  2.65it/s, acc=0.971, loss=[0.22322793, 0.0, -1.4268045, 0.0, 10.330375, 9.533179]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 139: 100%|##########| 169/169 [01:03<00:00,  2.65it/s, acc=0.971, loss=[0.22068593, 0.0, -1.4264464, 0.0, 10.32532, 9.530356]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 140: 100%|##########| 169/169 [01:03<00:00,  2.66it/s, acc=0.97, loss=[0.22165324, 0.0, -1.4254072, 0.0, 10.319157, 9.527549]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 141: 100%|##########| 169/169 [01:03<00:00,  2.67it/s, acc=0.972, loss=[0.22120982, 0.0, -1.4257648, 0.0, 10.310466, 9.524776]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 142: 100%|##########| 169/169 [01:03<00:00,  2.65it/s, acc=0.975, loss=[0.22146475, 0.0, -1.4250774, 0.0, 10.311822, 9.522028]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 143: 100%|##########| 169/169 [01:03<00:00,  2.65it/s, acc=0.974, loss=[0.22069636, 0.0, -1.4243026, 0.0, 10.31324, 9.5193]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 144: 100%|##########| 169/169 [01:03<00:00,  2.66it/s, acc=0.973, loss=[0.22098173, 0.0, -1.4241556, 0.0, 10.290742, 9.516603]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 145: 100%|##########| 169/169 [01:03<00:00,  2.65it/s, acc=0.973, loss=[0.22049473, 0.0, -1.4238456, 0.0, 10.281004, 9.513929]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 146: 100%|##########| 169/169 [01:03<00:00,  2.65it/s, acc=0.974, loss=[0.22001855, 0.0, -1.4233817, 0.0, 10.281004, 9.51128]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 147: 100%|##########| 169/169 [01:03<00:00,  2.67it/s, acc=0.974, loss=[0.22129348, 0.0, -1.4231359, 0.0, 10.262512, 9.508652]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 148: 100%|##########| 169/169 [01:03<00:00,  2.66it/s, acc=0.972, loss=[0.22060387, 0.0, -1.4225454, 0.0, 10.266704, 9.506044]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 149: 100%|##########| 169/169 [01:03<00:00,  2.66it/s, acc=0.974, loss=[0.2178939, 0.0, -1.4229425, 0.0, 10.244946, 9.503479]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 150: 100%|##########| 169/169 [01:03<00:00,  2.67it/s, acc=0.974, loss=[0.22154021, 0.0, -1.4217904, 0.0, 10.240939, 9.500915]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 151: 100%|##########| 169/169 [01:03<00:00,  2.65it/s, acc=0.976, loss=[0.2196332, 0.0, -1.4212657, 0.0, 10.240446, 9.498383]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 152: 100%|##########| 169/169 [01:03<00:00,  2.65it/s, acc=0.974, loss=[0.22038415, 0.0, -1.4216591, 0.0, 10.218626, 9.495868]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 153: 100%|##########| 169/169 [01:03<00:00,  2.66it/s, acc=0.975, loss=[0.21897918, 0.0, -1.4206727, 0.0, 10.231324, 9.493376]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 154: 100%|##########| 169/169 [01:03<00:00,  2.66it/s, acc=0.975, loss=[0.22038406, 0.0, -1.4203396, 0.0, 10.212586, 9.490901]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 155: 100%|##########| 169/169 [01:03<00:00,  2.65it/s, acc=0.977, loss=[0.21992905, 0.0, -1.420037, 0.0, 10.2063, 9.488443]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 156: 100%|##########| 169/169 [01:03<00:00,  2.67it/s, acc=0.976, loss=[0.21904999, 0.0, -1.4197203, 0.0, 10.204389, 9.486015]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 157: 100%|##########| 169/169 [01:03<00:00,  2.66it/s, acc=0.977, loss=[0.2185801, 0.0, -1.4193639, 0.0, 10.216223, 9.483603]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 158: 100%|##########| 169/169 [01:03<00:00,  2.67it/s, acc=0.976, loss=[0.21837783, 0.0, -1.4194653, 0.0, 10.181891, 9.4812155]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 159: 100%|##########| 169/169 [01:03<00:00,  2.66it/s, acc=0.976, loss=[0.21863534, 0.0, -1.4186846, 0.0, 10.175851, 9.478849]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 160: 100%|##########| 169/169 [01:03<00:00,  2.65it/s, acc=0.976, loss=[0.21901664, 0.0, -1.4185327, 0.0, 10.166235, 9.476494]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 161: 100%|##########| 169/169 [01:03<00:00,  2.65it/s, acc=0.977, loss=[0.21877906, 0.0, -1.4177468, 0.0, 10.188856, 9.474161]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 162: 100%|##########| 169/169 [01:03<00:00,  2.67it/s, acc=0.976, loss=[0.21899888, 0.0, -1.4176939, 0.0, 10.164325, 9.471846]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 163: 100%|##########| 169/169 [01:03<00:00,  2.64it/s, acc=0.977, loss=[0.21909359, 0.0, -1.4171379, 0.0, 10.148792, 9.469547]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 164: 100%|##########| 169/169 [01:03<00:00,  2.65it/s, acc=0.978, loss=[0.21756728, 0.0, -1.417452, 0.0, 10.150949, 9.467278]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 165: 100%|##########| 169/169 [01:03<00:00,  2.66it/s, acc=0.977, loss=[0.21842124, 0.0, -1.4168661, 0.0, 10.140964, 9.465015]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 166: 100%|##########| 169/169 [01:03<00:00,  2.66it/s, acc=0.977, loss=[0.21748765, 0.0, -1.416271, 0.0, 10.144231, 9.462773]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 167: 100%|##########| 169/169 [01:04<00:00,  2.64it/s, acc=0.975, loss=[0.21836549, 0.0, -1.4159335, 0.0, 10.137327, 9.460542]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 168: 100%|##########| 169/169 [01:03<00:00,  2.66it/s, acc=0.978, loss=[0.21766977, 0.0, -1.4157484, 0.0, 10.107864, 9.458337]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 169: 100%|##########| 169/169 [01:02<00:00,  2.68it/s, acc=0.978, loss=[0.21830784, 0.0, -1.4152843, 0.0, 10.116679, 9.456143]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 170: 100%|##########| 169/169 [01:02<00:00,  2.70it/s, acc=0.979, loss=[0.21741958, 0.0, -1.4149233, 0.0, 10.129622, 9.453962]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 171: 100%|##########| 169/169 [01:02<00:00,  2.72it/s, acc=0.978, loss=[0.21707937, 0.0, -1.4147177, 0.0, 10.115076, 9.4517975]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 172: 100%|##########| 169/169 [01:02<00:00,  2.71it/s, acc=0.979, loss=[0.21730927, 0.0, -1.4144628, 0.0, 10.086723, 9.4496565]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 173: 100%|##########| 169/169 [01:02<00:00,  2.73it/s, acc=0.977, loss=[0.21787971, 0.0, -1.4140143, 0.0, 10.087093, 9.447531]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 174: 100%|##########| 169/169 [01:02<00:00,  2.69it/s, acc=0.98, loss=[0.21674469, 0.0, -1.413668, 0.0, 10.10503, 9.445421]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 175: 100%|##########| 169/169 [01:02<00:00,  2.69it/s, acc=0.98, loss=[0.21876036, 0.0, -1.4131002, 0.0, 10.070082, 9.443319]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 176: 100%|##########| 169/169 [01:02<00:00,  2.71it/s, acc=0.979, loss=[0.21705519, 0.0, -1.4134555, 0.0, 10.076429, 9.441245]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 177: 100%|##########| 169/169 [01:02<00:00,  2.71it/s, acc=0.979, loss=[0.21654156, 0.0, -1.4126593, 0.0, 10.067801, 9.439184]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 178: 100%|##########| 169/169 [01:03<00:00,  2.68it/s, acc=0.98, loss=[0.21716441, 0.0, -1.4120347, 0.0, 10.049063, 9.437129]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 179: 100%|##########| 169/169 [01:03<00:00,  2.67it/s, acc=0.98, loss=[0.21632597, 0.0, -1.4122405, 0.0, 10.075012, 9.435104]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 180: 100%|##########| 169/169 [01:03<00:00,  2.67it/s, acc=0.979, loss=[0.21658462, 0.0, -1.4117616, 0.0, 10.056582, 9.433086]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 181: 100%|##########| 169/169 [01:03<00:00,  2.66it/s, acc=0.981, loss=[0.21639599, 0.0, -1.4114268, 0.0, 10.043084, 9.431082]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 182: 100%|##########| 169/169 [01:03<00:00,  2.67it/s, acc=0.979, loss=[0.2172018, 0.0, -1.4110612, 0.0, 10.041359, 9.429083]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 183: 100%|##########| 169/169 [01:03<00:00,  2.67it/s, acc=0.979, loss=[0.21556665, 0.0, -1.4107314, 0.0, 10.045611, 9.427115]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 184: 100%|##########| 169/169 [01:03<00:00,  2.66it/s, acc=0.981, loss=[0.21695809, 0.0, -1.4103237, 0.0, 10.041112, 9.425149]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 185: 100%|##########| 169/169 [01:02<00:00,  2.69it/s, acc=0.979, loss=[0.21638428, 0.0, -1.41007, 0.0, 10.015964, 9.423205]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 186: 100%|##########| 169/169 [01:02<00:00,  2.69it/s, acc=0.982, loss=[0.2157398, 0.0, -1.409808, 0.0, 10.023853, 9.421275]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 187: 100%|##########| 169/169 [01:03<00:00,  2.67it/s, acc=0.982, loss=[0.21594389, 0.0, -1.4095216, 0.0, 10.009615, 9.419353]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 188: 100%|##########| 169/169 [01:03<00:00,  2.67it/s, acc=0.983, loss=[0.21612048, 0.0, -1.4090708, 0.0, 10.024038, 9.417438]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 189: 100%|##########| 169/169 [01:03<00:00,  2.66it/s, acc=0.982, loss=[0.21552922, 0.0, -1.4089718, 0.0, 9.998336, 9.415547]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 190: 100%|##########| 169/169 [01:03<00:00,  2.66it/s, acc=0.981, loss=[0.2161724, 0.0, -1.4085152, 0.0, 10.009431, 9.413665]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 191: 100%|##########| 169/169 [01:03<00:00,  2.66it/s, acc=0.982, loss=[0.21575949, 0.0, -1.408301, 0.0, 10.001356, 9.411804]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 192: 100%|##########| 169/169 [01:03<00:00,  2.64it/s, acc=0.981, loss=[0.2151952, 0.0, -1.4079474, 0.0, 9.977626, 9.409942]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 193: 100%|##########| 169/169 [01:02<00:00,  2.69it/s, acc=0.982, loss=[0.21632701, 0.0, -1.4076095, 0.0, 9.983173, 9.408083]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 194: 100%|##########| 169/169 [01:03<00:00,  2.67it/s, acc=0.981, loss=[0.21584852, 0.0, -1.4074064, 0.0, 9.981694, 9.406255]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 195: 100%|##########| 169/169 [01:03<00:00,  2.67it/s, acc=0.983, loss=[0.21535167, 0.0, -1.4069853, 0.0, 9.969798, 9.404437]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 196: 100%|##########| 169/169 [01:03<00:00,  2.66it/s, acc=0.983, loss=[0.21506186, 0.0, -1.4069159, 0.0, 9.962832, 9.402633]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 197: 100%|##########| 169/169 [01:03<00:00,  2.67it/s, acc=0.982, loss=[0.21585228, 0.0, -1.4065266, 0.0, 9.946499, 9.400836]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 198: 100%|##########| 169/169 [01:03<00:00,  2.67it/s, acc=0.983, loss=[0.21585514, 0.0, -1.4061869, 0.0, 9.953834, 9.399047]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 199: 100%|##########| 169/169 [01:03<00:00,  2.65it/s, acc=0.981, loss=[0.21433157, 0.0, -1.4061159, 0.0, 9.963634, 9.3972845]]
