save_path:  ./trained_weights/VGG16/CUB200/standard
resuming training

 Namespace(create_counterfactual_combined=True, filter_visualization=True, user_evaluation=False, train_counterfactual_net=True, train_singular_counterfactual_net=False, choose_subclass=False, counterfactual_PP=True, resume_counterfactual_net=False, test_counterfactual_net=False, load_counterfactual_net=True, resume=True, alter_class=9, analysis_class=9, find_global_filters=False, alter_class_2=0, cfe_epochs=200, l1_weight=2, save_logFile=True, dataset='CUB200', save_directory='./trained_weights/', train_using_builtin_fit_method=True, train=False, fine_tune=False, test=False, model='VGG16/', imagenet_weights=True, save_path='./trained_weights/VGG16/CUB200/standard') 

batch_size:  16
CUB200-2011 dataset
using official split
num classes: 200
using imagenet_weights
Found 5400 images belonging to 200 classes.
Found 594 images belonging to 200 classes.
Found 5400 images belonging to 200 classes.
Found 594 images belonging to 200 classes.
Found 5794 images belonging to 200 classes.
Found 5794 images belonging to 200 classes.
loading VGG model
using VGG16 imagenet weights for CUB200 dataset
input_1
block1_conv1
block1_conv2
block1_pool
block2_conv1
block2_conv2
block2_pool
block3_conv1
block3_conv2
block3_conv3
block3_pool
block4_conv1
block4_conv2
block4_conv3
block4_pool
block5_conv1
block5_conv2
block5_conv3
block5_pool
block1_conv1 		 (None, 224, 224, 64)
block1_conv2 		 (None, 224, 224, 64)
block2_conv1 		 (None, 112, 112, 128)
block2_conv2 		 (None, 112, 112, 128)
block3_conv1 		 (None, 56, 56, 256)
block3_conv2 		 (None, 56, 56, 256)
block3_conv3 		 (None, 56, 56, 256)
block4_conv1 		 (None, 28, 28, 512)
block4_conv2 		 (None, 28, 28, 512)
block4_conv3 		 (None, 28, 28, 512)
block5_conv1 		 (None, 14, 14, 512)
block5_conv2 		 (None, 14, 14, 512)
block5_conv3 		 (None, 14, 14, 512)
total neurons:  4224
Model: "base_model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 224, 224, 3) 0                                            
__________________________________________________________________________________________________
block1_conv1 (Conv2D)           (None, 224, 224, 64) 1792        input_1[0][0]                    
__________________________________________________________________________________________________
block1_conv2 (Conv2D)           (None, 224, 224, 64) 36928       block1_conv1[0][0]               
__________________________________________________________________________________________________
block1_pool (MaxPooling2D)      (None, 112, 112, 64) 0           block1_conv2[0][0]               
__________________________________________________________________________________________________
block2_conv1 (Conv2D)           (None, 112, 112, 128 73856       block1_pool[0][0]                
__________________________________________________________________________________________________
block2_conv2 (Conv2D)           (None, 112, 112, 128 147584      block2_conv1[0][0]               
__________________________________________________________________________________________________
block2_pool (MaxPooling2D)      (None, 56, 56, 128)  0           block2_conv2[0][0]               
__________________________________________________________________________________________________
block3_conv1 (Conv2D)           (None, 56, 56, 256)  295168      block2_pool[0][0]                
__________________________________________________________________________________________________
block3_conv2 (Conv2D)           (None, 56, 56, 256)  590080      block3_conv1[0][0]               
__________________________________________________________________________________________________
block3_conv3 (Conv2D)           (None, 56, 56, 256)  590080      block3_conv2[0][0]               
__________________________________________________________________________________________________
block3_pool (MaxPooling2D)      (None, 28, 28, 256)  0           block3_conv3[0][0]               
__________________________________________________________________________________________________
block4_conv1 (Conv2D)           (None, 28, 28, 512)  1180160     block3_pool[0][0]                
__________________________________________________________________________________________________
block4_conv2 (Conv2D)           (None, 28, 28, 512)  2359808     block4_conv1[0][0]               
__________________________________________________________________________________________________
block4_conv3 (Conv2D)           (None, 28, 28, 512)  2359808     block4_conv2[0][0]               
__________________________________________________________________________________________________
block4_pool (MaxPooling2D)      (None, 14, 14, 512)  0           block4_conv3[0][0]               
__________________________________________________________________________________________________
block5_conv1 (Conv2D)           (None, 14, 14, 512)  2359808     block4_pool[0][0]                
__________________________________________________________________________________________________
block5_conv2 (Conv2D)           (None, 14, 14, 512)  2359808     block5_conv1[0][0]               
__________________________________________________________________________________________________
block5_conv3 (Conv2D)           (None, 14, 14, 512)  2359808     block5_conv2[0][0]               
__________________________________________________________________________________________________
max_pooling2d (MaxPooling2D)    (None, 7, 7, 512)    0           block5_conv3[0][0]               
__________________________________________________________________________________________________
global_average_pooling2d (Globa (None, 512)          0           max_pooling2d[0][0]              
__________________________________________________________________________________________________
input_2 (InputLayer)            [(None, 512)]        0                                            
__________________________________________________________________________________________________
tf.math.multiply (TFOpLambda)   (None, 512)          0           global_average_pooling2d[0][0]   
                                                                 input_2[0][0]                    
__________________________________________________________________________________________________
dense (Dense)                   (None, 200)          102600      tf.math.multiply[0][0]           
__________________________________________________________________________________________________
activation (Activation)         (None, 200)          0           dense[0][0]                      
==================================================================================================
Total params: 14,817,288
Trainable params: 102,600
Non-trainable params: 14,714,688
__________________________________________________________________________________________________
weights loaded
threshold:  0.5
l1 weight:  2
training CF model for alter class:  010.Red_winged_Blackbird
Training CF model for PPs
Model: "model_1"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_3 (InputLayer)            [(None, 224, 224, 3) 0                                            
__________________________________________________________________________________________________
counterfactual_model (Functiona (None, 512)          14977344    input_3[0][0]                    
__________________________________________________________________________________________________
base_model (Functional)         [(None, 200), (None, 14817288    input_3[0][0]                    
                                                                 counterfactual_model[0][0]       
==================================================================================================
Total params: 15,079,944
Trainable params: 262,656
Non-trainable params: 14,817,288
__________________________________________________________________________________________________
training for fixed alter class:  010.Red_winged_Blackbird
  0%|          | 0/338 [00:00<?, ?it/s]epoch 0: 100%|##########| 338/338 [05:13<00:00,  1.08it/s, acc=0.867, loss=[1.3451778, 2.583336, -0.18205442, 0.0, 92.43121, 0.0]]
  0%|          | 0/338 [00:00<?, ?it/s]epoch 1: 100%|##########| 338/338 [03:57<00:00,  1.42it/s, acc=0.986, loss=[0.48347077, 1.2530334, -0.16081946, 0.0, 44.21154, 0.0]]
  0%|          | 0/338 [00:00<?, ?it/s]epoch 2: 100%|##########| 338/338 [03:57<00:00,  1.42it/s, acc=0.995, loss=[0.4603603, 1.0834466, -0.15885672, 0.0, 37.772373, 0.0]]
  0%|          | 0/338 [00:00<?, ?it/s]epoch 3: 100%|##########| 338/338 [03:57<00:00,  1.42it/s, acc=0.996, loss=[0.4424587, 0.99888027, -0.15915829, 0.0, 34.661427, 0.0]]
  0%|          | 0/338 [00:00<?, ?it/s]epoch 4: 100%|##########| 338/338 [03:57<00:00,  1.43it/s, acc=0.997, loss=[0.42801523, 0.9452772, -0.15969655, 0.0, 32.717827, 0.0]]
  0%|          | 0/338 [00:00<?, ?it/s]epoch 5: 100%|##########| 338/338 [03:57<00:00,  1.42it/s, acc=0.997, loss=[0.415559, 0.91038316, -0.16068888, 0.0, 31.476147, 0.0]]
  0%|          | 0/338 [00:00<?, ?it/s]epoch 6: 100%|##########| 338/338 [06:15<00:00,  1.11s/it, acc=0.997, loss=[0.41134992, 0.8744104, -0.16098201, 0.0, 30.236132, 0.0]]
  0%|          | 0/338 [00:00<?, ?it/s]epoch 7: 100%|##########| 338/338 [06:56<00:00,  1.23s/it, acc=0.997, loss=[0.40441546, 0.8500014, -0.16144866, 0.0, 29.356323, 0.0]]
  0%|          | 0/338 [00:00<?, ?it/s]epoch 8: 100%|##########| 338/338 [04:04<00:00,  1.38it/s, acc=0.997, loss=[0.40070957, 0.8275941, -0.16179514, 0.0, 28.554178, 0.0]]
  0%|          | 0/338 [00:00<?, ?it/s]epoch 9:  84%|########4 | 285/338 [03:21<00:37,  1.41it/s, acc=0.998, loss=[0.39274657, 0.8144383, -0.16221954, 0.0, 28.029167, 0.0]]
