save_path:  ./trained_weights/VGG16/CUB200/standard
resuming training

 Namespace(alter_class=125, alter_class_2=0, analysis_class=9, analyze_filter_importance=False, cfe_epochs=200, counterfactual_PP=False, create_counterfactual_combined=True, dataset='CUB200', filter_category_method='own_reduce_loss', filter_modified_directly=True, filter_visualization=True, find_filter_class=False, find_global_filters=False, fine_tune=False, fixed_classes=True, fixed_classes_reduce_loss=True, full_standard=True, high_capacity_model=True, imagenet_weights=True, interpretable=False, l1_weight=2, load_counterfactual_net=True, loss_compute=True, model='VGG16/', resume=True, resume_counterfactual_net=False, save_directory='./trained_weights/', save_filter_fmap=False, save_filter_importance=False, save_logFile=True, save_path='./trained_weights/VGG16/CUB200/standard', save_top_layer=True, test=False, test_counterfactual_net=False, test_filter_importance=False, train=False, train_counterfactual_net=True, train_using_builtin_fit_method=True, visualize_fmaps=False) 

batch_size:  32
CUB200-2011 dataset
using official split
num classes: 200
using imagenet_weights
Found 5400 images belonging to 200 classes.
Found 594 images belonging to 200 classes.
Found 5400 images belonging to 200 classes.
Found 594 images belonging to 200 classes.
Found 5794 images belonging to 200 classes.
Found 5794 images belonging to 200 classes.
loading VGG model
using VGG16 imagenet weights for CUB200 dataset
input_1
block1_conv1
block1_conv2
block1_pool
block2_conv1
block2_conv2
block2_pool
block3_conv1
block3_conv2
block3_conv3
block3_pool
block4_conv1
block4_conv2
block4_conv3
block4_pool
block5_conv1
block5_conv2
block5_conv3
block5_pool
block1_conv1 		 (None, 224, 224, 64)
block1_conv2 		 (None, 224, 224, 64)
block2_conv1 		 (None, 112, 112, 128)
block2_conv2 		 (None, 112, 112, 128)
block3_conv1 		 (None, 56, 56, 256)
block3_conv2 		 (None, 56, 56, 256)
block3_conv3 		 (None, 56, 56, 256)
block4_conv1 		 (None, 28, 28, 512)
block4_conv2 		 (None, 28, 28, 512)
block4_conv3 		 (None, 28, 28, 512)
block5_conv1 		 (None, 14, 14, 512)
block5_conv2 		 (None, 14, 14, 512)
block5_conv3 		 (None, 14, 14, 512)
total neurons:  4224
Model: "base_model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 224, 224, 3) 0                                            
__________________________________________________________________________________________________
block1_conv1 (Conv2D)           (None, 224, 224, 64) 1792        input_1[0][0]                    
__________________________________________________________________________________________________
block1_conv2 (Conv2D)           (None, 224, 224, 64) 36928       block1_conv1[0][0]               
__________________________________________________________________________________________________
block1_pool (MaxPooling2D)      (None, 112, 112, 64) 0           block1_conv2[0][0]               
__________________________________________________________________________________________________
block2_conv1 (Conv2D)           (None, 112, 112, 128 73856       block1_pool[0][0]                
__________________________________________________________________________________________________
block2_conv2 (Conv2D)           (None, 112, 112, 128 147584      block2_conv1[0][0]               
__________________________________________________________________________________________________
block2_pool (MaxPooling2D)      (None, 56, 56, 128)  0           block2_conv2[0][0]               
__________________________________________________________________________________________________
block3_conv1 (Conv2D)           (None, 56, 56, 256)  295168      block2_pool[0][0]                
__________________________________________________________________________________________________
block3_conv2 (Conv2D)           (None, 56, 56, 256)  590080      block3_conv1[0][0]               
__________________________________________________________________________________________________
block3_conv3 (Conv2D)           (None, 56, 56, 256)  590080      block3_conv2[0][0]               
__________________________________________________________________________________________________
block3_pool (MaxPooling2D)      (None, 28, 28, 256)  0           block3_conv3[0][0]               
__________________________________________________________________________________________________
block4_conv1 (Conv2D)           (None, 28, 28, 512)  1180160     block3_pool[0][0]                
__________________________________________________________________________________________________
block4_conv2 (Conv2D)           (None, 28, 28, 512)  2359808     block4_conv1[0][0]               
__________________________________________________________________________________________________
block4_conv3 (Conv2D)           (None, 28, 28, 512)  2359808     block4_conv2[0][0]               
__________________________________________________________________________________________________
block4_pool (MaxPooling2D)      (None, 14, 14, 512)  0           block4_conv3[0][0]               
__________________________________________________________________________________________________
block5_conv1 (Conv2D)           (None, 14, 14, 512)  2359808     block4_pool[0][0]                
__________________________________________________________________________________________________
block5_conv2 (Conv2D)           (None, 14, 14, 512)  2359808     block5_conv1[0][0]               
__________________________________________________________________________________________________
block5_conv3 (Conv2D)           (None, 14, 14, 512)  2359808     block5_conv2[0][0]               
__________________________________________________________________________________________________
max_pooling2d (MaxPooling2D)    (None, 7, 7, 512)    0           block5_conv3[0][0]               
__________________________________________________________________________________________________
global_average_pooling2d (Globa (None, 512)          0           max_pooling2d[0][0]              
__________________________________________________________________________________________________
input_2 (InputLayer)            [(None, 512)]        0                                            
__________________________________________________________________________________________________
tf_op_layer_add (TensorFlowOpLa [(None, 512)]        0           global_average_pooling2d[0][0]   
                                                                 input_2[0][0]                    
__________________________________________________________________________________________________
dense (Dense)                   (None, 200)          102600      tf_op_layer_add[0][0]            
__________________________________________________________________________________________________
activation (Activation)         (None, 200)          0           dense[0][0]                      
==================================================================================================
Total params: 14,817,288
Trainable params: 102,600
Non-trainable params: 14,714,688
__________________________________________________________________________________________________
weights loaded
Model: "counterfactual_model"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 224, 224, 3)]     0         
_________________________________________________________________
block1_conv1 (Conv2D)        (None, 224, 224, 64)      1792      
_________________________________________________________________
block1_conv2 (Conv2D)        (None, 224, 224, 64)      36928     
_________________________________________________________________
block1_pool (MaxPooling2D)   (None, 112, 112, 64)      0         
_________________________________________________________________
block2_conv1 (Conv2D)        (None, 112, 112, 128)     73856     
_________________________________________________________________
block2_conv2 (Conv2D)        (None, 112, 112, 128)     147584    
_________________________________________________________________
block2_pool (MaxPooling2D)   (None, 56, 56, 128)       0         
_________________________________________________________________
block3_conv1 (Conv2D)        (None, 56, 56, 256)       295168    
_________________________________________________________________
block3_conv2 (Conv2D)        (None, 56, 56, 256)       590080    
_________________________________________________________________
block3_conv3 (Conv2D)        (None, 56, 56, 256)       590080    
_________________________________________________________________
block3_pool (MaxPooling2D)   (None, 28, 28, 256)       0         
_________________________________________________________________
block4_conv1 (Conv2D)        (None, 28, 28, 512)       1180160   
_________________________________________________________________
block4_conv2 (Conv2D)        (None, 28, 28, 512)       2359808   
_________________________________________________________________
block4_conv3 (Conv2D)        (None, 28, 28, 512)       2359808   
_________________________________________________________________
block4_pool (MaxPooling2D)   (None, 14, 14, 512)       0         
_________________________________________________________________
block5_conv1 (Conv2D)        (None, 14, 14, 512)       2359808   
_________________________________________________________________
block5_conv2 (Conv2D)        (None, 14, 14, 512)       2359808   
_________________________________________________________________
block5_conv3 (Conv2D)        (None, 14, 14, 512)       2359808   
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 7, 7, 512)         0         
_________________________________________________________________
global_average_pooling2d_1 ( (None, 512)               0         
_________________________________________________________________
dense_1 (Dense)              (None, 512)               262656    
=================================================================
Total params: 14,977,344
Trainable params: 262,656
Non-trainable params: 14,714,688
_________________________________________________________________
threshold:  0.5
l1 weight:  2
training CF model for alter class:  126.Nelson_Sharp_tailed_Sparrow
Training CF model for PNs
Model: "model_1"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_3 (InputLayer)            [(None, 224, 224, 3) 0                                            
__________________________________________________________________________________________________
counterfactual_model (Model)    (None, 512)          14977344    input_3[0][0]                    
__________________________________________________________________________________________________
base_model (Model)              [(None, 200), (None, 14817288    input_3[0][0]                    
                                                                 counterfactual_model[1][0]       
==================================================================================================
Total params: 15,079,944
Trainable params: 262,656
Non-trainable params: 14,817,288
__________________________________________________________________________________________________
training for fixed alter class:  126.Nelson_Sharp_tailed_Sparrow
  0%|          | 0/169 [00:00<?, ?it/s]epoch 0: 100%|##########| 169/169 [01:25<00:00,  1.97it/s, acc=0.72, loss=[3.0509517, 0.0, -1.7901618, 0.0, 65.61353, 16.467112]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 1: 100%|##########| 169/169 [01:18<00:00,  2.15it/s, acc=0.772, loss=[0.9128622, 0.0, -1.7642422, 0.0, 29.965237, 14.714252]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 2: 100%|##########| 169/169 [01:19<00:00,  2.13it/s, acc=0.784, loss=[0.7501734, 0.0, -1.7180454, 0.0, 26.773792, 13.968059]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 3: 100%|##########| 169/169 [01:18<00:00,  2.15it/s, acc=0.783, loss=[0.67236716, 0.0, -1.6801747, 0.0, 25.092026, 13.51842]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 4: 100%|##########| 169/169 [01:18<00:00,  2.16it/s, acc=0.792, loss=[0.59889305, 0.0, -1.6504186, 0.0, 24.096462, 13.206666]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 5: 100%|##########| 169/169 [01:18<00:00,  2.15it/s, acc=0.793, loss=[0.572631, 0.0, -1.6249396, 0.0, 23.216593, 12.967843]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 6: 100%|##########| 169/169 [01:18<00:00,  2.14it/s, acc=0.8, loss=[0.5354514, 0.0, -1.6040037, 0.0, 22.676098, 12.776904]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 7: 100%|##########| 169/169 [01:18<00:00,  2.14it/s, acc=0.806, loss=[0.5014693, 0.0, -1.5874535, 0.0, 22.187193, 12.619645]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 8: 100%|##########| 169/169 [01:18<00:00,  2.15it/s, acc=0.809, loss=[0.47521615, 0.0, -1.5725163, 0.0, 21.736624, 12.486255]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 9: 100%|##########| 169/169 [01:18<00:00,  2.14it/s, acc=0.814, loss=[0.46892542, 0.0, -1.5591723, 0.0, 21.428377, 12.370536]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 10: 100%|##########| 169/169 [01:18<00:00,  2.15it/s, acc=0.82, loss=[0.44470146, 0.0, -1.5491439, 0.0, 21.059172, 12.269511]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 11: 100%|##########| 169/169 [01:18<00:00,  2.15it/s, acc=0.82, loss=[0.4375506, 0.0, -1.5379823, 0.0, 20.815458, 12.179247]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 12: 100%|##########| 169/169 [01:18<00:00,  2.15it/s, acc=0.824, loss=[0.41345266, 0.0, -1.5312022, 0.0, 20.544563, 12.099454]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 13: 100%|##########| 169/169 [01:18<00:00,  2.15it/s, acc=0.828, loss=[0.40614942, 0.0, -1.5233662, 0.0, 20.307755, 12.027027]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 14: 100%|##########| 169/169 [01:18<00:00,  2.15it/s, acc=0.832, loss=[0.40033448, 0.0, -1.5162612, 0.0, 20.12845, 11.961251]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 15: 100%|##########| 169/169 [01:18<00:00,  2.15it/s, acc=0.836, loss=[0.38710812, 0.0, -1.5084003, 0.0, 19.984283, 11.900567]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 16: 100%|##########| 169/169 [01:17<00:00,  2.17it/s, acc=0.84, loss=[0.3781853, 0.0, -1.503126, 0.0, 19.757397, 11.844887]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 17: 100%|##########| 169/169 [01:18<00:00,  2.16it/s, acc=0.842, loss=[0.37384698, 0.0, -1.496889, 0.0, 19.638868, 11.793201]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 18: 100%|##########| 169/169 [01:16<00:00,  2.20it/s, acc=0.845, loss=[0.3641154, 0.0, -1.4920288, 0.0, 19.523113, 11.745484]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 19: 100%|##########| 169/169 [01:16<00:00,  2.20it/s, acc=0.839, loss=[0.35845625, 0.0, -1.4861798, 0.0, 19.349976, 11.7005825]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 20: 100%|##########| 169/169 [01:17<00:00,  2.19it/s, acc=0.85, loss=[0.35034615, 0.0, -1.4830137, 0.0, 19.251417, 11.658933]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 21: 100%|##########| 169/169 [01:14<00:00,  2.26it/s, acc=0.854, loss=[0.34181353, 0.0, -1.4784367, 0.0, 19.10885, 11.619682]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 22: 100%|##########| 169/169 [01:14<00:00,  2.27it/s, acc=0.856, loss=[0.34267226, 0.0, -1.4742548, 0.0, 18.967333, 11.582613]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 23: 100%|##########| 169/169 [01:14<00:00,  2.27it/s, acc=0.862, loss=[0.33420512, 0.0, -1.4691159, 0.0, 18.897312, 11.547498]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 24: 100%|##########| 169/169 [01:17<00:00,  2.19it/s, acc=0.862, loss=[0.32891992, 0.0, -1.466157, 0.0, 18.751541, 11.514221]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 25: 100%|##########| 169/169 [01:14<00:00,  2.25it/s, acc=0.862, loss=[0.323009, 0.0, -1.4621688, 0.0, 18.687315, 11.482685]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 26: 100%|##########| 169/169 [01:14<00:00,  2.27it/s, acc=0.864, loss=[0.31891954, 0.0, -1.461093, 0.0, 18.502466, 11.452895]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 27: 100%|##########| 169/169 [01:14<00:00,  2.27it/s, acc=0.866, loss=[0.31754315, 0.0, -1.4562831, 0.0, 18.473373, 11.42434]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 28: 100%|##########| 169/169 [01:14<00:00,  2.27it/s, acc=0.869, loss=[0.3122962, 0.0, -1.452937, 0.0, 18.378635, 11.39702]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 29: 100%|##########| 169/169 [01:14<00:00,  2.26it/s, acc=0.877, loss=[0.3068405, 0.0, -1.4503202, 0.0, 18.27601, 11.370941]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 30: 100%|##########| 169/169 [01:14<00:00,  2.28it/s, acc=0.874, loss=[0.30301255, 0.0, -1.4480191, 0.0, 18.203896, 11.346038]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 31: 100%|##########| 169/169 [01:14<00:00,  2.27it/s, acc=0.876, loss=[0.30299786, 0.0, -1.4449154, 0.0, 18.102379, 11.322088]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 32: 100%|##########| 169/169 [01:14<00:00,  2.26it/s, acc=0.88, loss=[0.30420095, 0.0, -1.44227, 0.0, 18.011835, 11.299026]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 33: 100%|##########| 169/169 [01:14<00:00,  2.28it/s, acc=0.882, loss=[0.2982393, 0.0, -1.4408197, 0.0, 17.88369, 11.276992]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 34: 100%|##########| 169/169 [01:13<00:00,  2.29it/s, acc=0.88, loss=[0.2966702, 0.0, -1.4377767, 0.0, 17.84227, 11.255692]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 35: 100%|##########| 169/169 [01:14<00:00,  2.28it/s, acc=0.884, loss=[0.291942, 0.0, -1.4356189, 0.0, 17.797337, 11.235274]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 36: 100%|##########| 169/169 [01:14<00:00,  2.26it/s, acc=0.889, loss=[0.2895891, 0.0, -1.4336029, 0.0, 17.694897, 11.21552]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 37: 100%|##########| 169/169 [01:14<00:00,  2.28it/s, acc=0.891, loss=[0.2900861, 0.0, -1.43068, 0.0, 17.663092, 11.196395]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 38: 100%|##########| 169/169 [01:14<00:00,  2.28it/s, acc=0.893, loss=[0.2868475, 0.0, -1.4285104, 0.0, 17.55683, 11.177891]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 39: 100%|##########| 169/169 [01:14<00:00,  2.27it/s, acc=0.891, loss=[0.2871634, 0.0, -1.4266276, 0.0, 17.491001, 11.159981]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 40: 100%|##########| 169/169 [01:16<00:00,  2.21it/s, acc=0.897, loss=[0.2823966, 0.0, -1.4247895, 0.0, 17.402489, 11.142686]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 41: 100%|##########| 169/169 [01:16<00:00,  2.21it/s, acc=0.901, loss=[0.28301334, 0.0, -1.4227163, 0.0, 17.368158, 11.125862]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 42: 100%|##########| 169/169 [01:14<00:00,  2.27it/s, acc=0.907, loss=[0.28071743, 0.0, -1.42072, 0.0, 17.278784, 11.109546]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 43: 100%|##########| 169/169 [01:14<00:00,  2.26it/s, acc=0.901, loss=[0.2790919, 0.0, -1.4195557, 0.0, 17.22781, 11.093781]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 44: 100%|##########| 169/169 [01:14<00:00,  2.27it/s, acc=0.907, loss=[0.27559602, 0.0, -1.4170988, 0.0, 17.219982, 11.078432]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 45: 100%|##########| 169/169 [01:14<00:00,  2.28it/s, acc=0.905, loss=[0.2767097, 0.0, -1.4153936, 0.0, 17.10848, 11.063445]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 46: 100%|##########| 169/169 [01:14<00:00,  2.28it/s, acc=0.908, loss=[0.2732203, 0.0, -1.4141271, 0.0, 17.064533, 11.048946]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 47: 100%|##########| 169/169 [01:14<00:00,  2.28it/s, acc=0.904, loss=[0.27255705, 0.0, -1.413233, 0.0, 17.018429, 11.034935]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 48: 100%|##########| 169/169 [01:14<00:00,  2.27it/s, acc=0.909, loss=[0.27397108, 0.0, -1.4107404, 0.0, 16.971338, 11.021193]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 49: 100%|##########| 169/169 [01:14<00:00,  2.28it/s, acc=0.915, loss=[0.26815876, 0.0, -1.4089729, 0.0, 16.965853, 11.007799]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 50: 100%|##########| 169/169 [01:14<00:00,  2.28it/s, acc=0.915, loss=[0.27041668, 0.0, -1.4073142, 0.0, 16.871609, 10.994708]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 51: 100%|##########| 169/169 [01:13<00:00,  2.29it/s, acc=0.917, loss=[0.26791704, 0.0, -1.4056307, 0.0, 16.849174, 10.981947]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 52: 100%|##########| 169/169 [01:14<00:00,  2.28it/s, acc=0.918, loss=[0.2661575, 0.0, -1.4043639, 0.0, 16.799248, 10.969517]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 53: 100%|##########| 169/169 [01:13<00:00,  2.29it/s, acc=0.92, loss=[0.26637566, 0.0, -1.4026362, 0.0, 16.74507, 10.957362]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 54: 100%|##########| 169/169 [01:14<00:00,  2.27it/s, acc=0.923, loss=[0.26279345, 0.0, -1.4015479, 0.0, 16.70784, 10.945509]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 55: 100%|##########| 169/169 [01:14<00:00,  2.27it/s, acc=0.919, loss=[0.26401532, 0.0, -1.3999925, 0.0, 16.650148, 10.933925]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 56: 100%|##########| 169/169 [01:14<00:00,  2.27it/s, acc=0.919, loss=[0.26366726, 0.0, -1.3989321, 0.0, 16.61409, 10.922635]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 57: 100%|##########| 169/169 [01:14<00:00,  2.27it/s, acc=0.926, loss=[0.26309666, 0.0, -1.3968002, 0.0, 16.618898, 10.911529]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 58: 100%|##########| 169/169 [01:14<00:00,  2.27it/s, acc=0.923, loss=[0.26027927, 0.0, -1.3957404, 0.0, 16.576061, 10.900693]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 59: 100%|##########| 169/169 [01:14<00:00,  2.27it/s, acc=0.921, loss=[0.26002255, 0.0, -1.3946222, 0.0, 16.508383, 10.890111]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 60: 100%|##########| 169/169 [01:13<00:00,  2.29it/s, acc=0.931, loss=[0.25848272, 0.0, -1.3932501, 0.0, 16.453033, 10.879711]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 61: 100%|##########| 169/169 [01:14<00:00,  2.27it/s, acc=0.933, loss=[0.2571444, 0.0, -1.3924104, 0.0, 16.435219, 10.869575]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 62: 100%|##########| 169/169 [01:14<00:00,  2.27it/s, acc=0.934, loss=[0.25783098, 0.0, -1.3902512, 0.0, 16.429611, 10.859576]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 63: 100%|##########| 169/169 [01:14<00:00,  2.27it/s, acc=0.931, loss=[0.25872007, 0.0, -1.3893929, 0.0, 16.342148, 10.849765]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 64: 100%|##########| 169/169 [01:14<00:00,  2.27it/s, acc=0.935, loss=[0.2534881, 0.0, -1.3884927, 0.0, 16.385292, 10.840234]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 65: 100%|##########| 169/169 [01:14<00:00,  2.27it/s, acc=0.931, loss=[0.25662068, 0.0, -1.3872392, 0.0, 16.307507, 10.830847]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 66: 100%|##########| 169/169 [01:14<00:00,  2.27it/s, acc=0.937, loss=[0.25558084, 0.0, -1.3857508, 0.0, 16.260109, 10.821594]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 67: 100%|##########| 169/169 [01:14<00:00,  2.28it/s, acc=0.939, loss=[0.25331053, 0.0, -1.3848863, 0.0, 16.24587, 10.812551]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 68: 100%|##########| 169/169 [01:14<00:00,  2.28it/s, acc=0.934, loss=[0.25411353, 0.0, -1.384333, 0.0, 16.174618, 10.8036995]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 69: 100%|##########| 169/169 [01:13<00:00,  2.29it/s, acc=0.938, loss=[0.25285757, 0.0, -1.3823427, 0.0, 16.200136, 10.794966]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 70: 100%|##########| 169/169 [01:14<00:00,  2.28it/s, acc=0.941, loss=[0.25192824, 0.0, -1.3819039, 0.0, 16.150085, 10.786427]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 71: 100%|##########| 169/169 [01:13<00:00,  2.28it/s, acc=0.942, loss=[0.2510763, 0.0, -1.3806831, 0.0, 16.117418, 10.778033]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 72: 100%|##########| 169/169 [01:14<00:00,  2.28it/s, acc=0.942, loss=[0.2514062, 0.0, -1.3793774, 0.0, 16.077354, 10.769761]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 73: 100%|##########| 169/169 [01:14<00:00,  2.28it/s, acc=0.941, loss=[0.24918814, 0.0, -1.3787913, 0.0, 16.069527, 10.761656]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 74: 100%|##########| 169/169 [01:14<00:00,  2.28it/s, acc=0.944, loss=[0.24916019, 0.0, -1.3777193, 0.0, 16.028292, 10.7536745]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 75: 100%|##########| 169/169 [01:13<00:00,  2.29it/s, acc=0.941, loss=[0.25038552, 0.0, -1.3763641, 0.0, 16.033468, 10.745804]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 76: 100%|##########| 169/169 [01:14<00:00,  2.26it/s, acc=0.946, loss=[0.24929573, 0.0, -1.3754442, 0.0, 15.979845, 10.73807]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 77: 100%|##########| 169/169 [01:14<00:00,  2.27it/s, acc=0.943, loss=[0.24783422, 0.0, -1.3747739, 0.0, 15.96838, 10.7304945]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 78: 100%|##########| 169/169 [01:14<00:00,  2.26it/s, acc=0.945, loss=[0.24861915, 0.0, -1.3735883, 0.0, 15.926652, 10.722999]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 79: 100%|##########| 169/169 [01:14<00:00,  2.27it/s, acc=0.945, loss=[0.24788097, 0.0, -1.3726355, 0.0, 15.922276, 10.71565]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 80: 100%|##########| 169/169 [01:14<00:00,  2.27it/s, acc=0.947, loss=[0.24745888, 0.0, -1.3715827, 0.0, 15.87919, 10.708405]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 81: 100%|##########| 169/169 [01:14<00:00,  2.28it/s, acc=0.946, loss=[0.24687713, 0.0, -1.3712225, 0.0, 15.837093, 10.701289]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 82: 100%|##########| 169/169 [01:13<00:00,  2.29it/s, acc=0.949, loss=[0.2457511, 0.0, -1.3701298, 0.0, 15.845537, 10.694275]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 83: 100%|##########| 169/169 [01:14<00:00,  2.28it/s, acc=0.948, loss=[0.24635838, 0.0, -1.3689587, 0.0, 15.798324, 10.687349]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 84: 100%|##########| 169/169 [01:14<00:00,  2.28it/s, acc=0.949, loss=[0.246935, 0.0, -1.3681405, 0.0, 15.78575, 10.680535]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 85: 100%|##########| 169/169 [01:14<00:00,  2.28it/s, acc=0.953, loss=[0.24445944, 0.0, -1.367597, 0.0, 15.751541, 10.673833]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 86: 100%|##########| 169/169 [01:14<00:00,  2.28it/s, acc=0.951, loss=[0.24485424, 0.0, -1.3667016, 0.0, 15.7259, 10.66722]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 87: 100%|##########| 169/169 [01:14<00:00,  2.28it/s, acc=0.953, loss=[0.2444702, 0.0, -1.365648, 0.0, 15.724236, 10.660704]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 88: 100%|##########| 169/169 [01:13<00:00,  2.29it/s, acc=0.953, loss=[0.24301308, 0.0, -1.3648694, 0.0, 15.6928005, 10.654284]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 89: 100%|##########| 169/169 [01:14<00:00,  2.27it/s, acc=0.953, loss=[0.24420898, 0.0, -1.3638992, 0.0, 15.674434, 10.647934]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 90: 100%|##########| 169/169 [01:13<00:00,  2.28it/s, acc=0.949, loss=[0.24448203, 0.0, -1.3631676, 0.0, 15.649593, 10.641676]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 91: 100%|##########| 169/169 [01:14<00:00,  2.27it/s, acc=0.957, loss=[0.24182937, 0.0, -1.3623335, 0.0, 15.637759, 10.635511]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 92: 100%|##########| 169/169 [01:14<00:00,  2.26it/s, acc=0.954, loss=[0.24224235, 0.0, -1.361447, 0.0, 15.615322, 10.629432]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 93: 100%|##########| 169/169 [01:14<00:00,  2.28it/s, acc=0.954, loss=[0.24205548, 0.0, -1.3606439, 0.0, 15.585983, 10.623419]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 94: 100%|##########| 169/169 [01:14<00:00,  2.28it/s, acc=0.954, loss=[0.24321768, 0.0, -1.3600626, 0.0, 15.532052, 10.617495]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 95: 100%|##########| 169/169 [01:14<00:00,  2.28it/s, acc=0.956, loss=[0.24097858, 0.0, -1.3590885, 0.0, 15.545303, 10.6116495]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 96: 100%|##########| 169/169 [01:14<00:00,  2.27it/s, acc=0.957, loss=[0.24196778, 0.0, -1.3581713, 0.0, 15.507951, 10.605871]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 97: 100%|##########| 169/169 [01:13<00:00,  2.28it/s, acc=0.956, loss=[0.24075791, 0.0, -1.3575768, 0.0, 15.499445, 10.600172]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 98: 100%|##########| 169/169 [01:13<00:00,  2.29it/s, acc=0.957, loss=[0.24202527, 0.0, -1.3568124, 0.0, 15.453341, 10.59454]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 99: 100%|##########| 169/169 [01:14<00:00,  2.28it/s, acc=0.96, loss=[0.23980941, 0.0, -1.356651, 0.0, 15.424679, 10.589005]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 100: 100%|##########| 169/169 [01:14<00:00,  2.28it/s, acc=0.956, loss=[0.24124348, 0.0, -1.3552818, 0.0, 15.416975, 10.583513]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 101: 100%|##########| 169/169 [01:14<00:00,  2.28it/s, acc=0.96, loss=[0.23913087, 0.0, -1.3547864, 0.0, 15.425111, 10.578101]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 102: 100%|##########| 169/169 [01:14<00:00,  2.27it/s, acc=0.962, loss=[0.2401109, 0.0, -1.3539037, 0.0, 15.36896, 10.572732]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 103: 100%|##########| 169/169 [01:14<00:00,  2.27it/s, acc=0.96, loss=[0.23965856, 0.0, -1.3533213, 0.0, 15.34412, 10.567439]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 104: 100%|##########| 169/169 [01:14<00:00,  2.28it/s, acc=0.96, loss=[0.23986176, 0.0, -1.35256, 0.0, 15.313856, 10.562207]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 105: 100%|##########| 169/169 [01:14<00:00,  2.27it/s, acc=0.962, loss=[0.23925743, 0.0, -1.3520235, 0.0, 15.307631, 10.557047]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 106: 100%|##########| 169/169 [01:13<00:00,  2.29it/s, acc=0.961, loss=[0.23764999, 0.0, -1.3515664, 0.0, 15.273052, 10.551956]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 107: 100%|##########| 169/169 [01:14<00:00,  2.27it/s, acc=0.965, loss=[0.24016908, 0.0, -1.3504272, 0.0, 15.276443, 10.546904]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 108: 100%|##########| 169/169 [01:14<00:00,  2.27it/s, acc=0.964, loss=[0.2381438, 0.0, -1.3501195, 0.0, 15.224545, 10.541921]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 109: 100%|##########| 169/169 [01:14<00:00,  2.27it/s, acc=0.964, loss=[0.23797154, 0.0, -1.349189, 0.0, 15.211231, 10.536978]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 110: 100%|##########| 169/169 [01:14<00:00,  2.27it/s, acc=0.965, loss=[0.2374158, 0.0, -1.3487448, 0.0, 15.199766, 10.532099]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 111: 100%|##########| 169/169 [01:14<00:00,  2.28it/s, acc=0.968, loss=[0.23696381, 0.0, -1.348063, 0.0, 15.20784, 10.527285]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 112: 100%|##########| 169/169 [01:14<00:00,  2.28it/s, acc=0.966, loss=[0.2375141, 0.0, -1.3471823, 0.0, 15.165681, 10.52251]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 113: 100%|##########| 169/169 [01:13<00:00,  2.28it/s, acc=0.966, loss=[0.23652828, 0.0, -1.3468522, 0.0, 15.150702, 10.517799]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 114: 100%|##########| 169/169 [01:13<00:00,  2.29it/s, acc=0.966, loss=[0.2367059, 0.0, -1.3463594, 0.0, 15.09973, 10.513134]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 115: 100%|##########| 169/169 [01:13<00:00,  2.29it/s, acc=0.967, loss=[0.23551065, 0.0, -1.3457354, 0.0, 15.12463, 10.508531]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 116: 100%|##########| 169/169 [01:13<00:00,  2.29it/s, acc=0.965, loss=[0.23749195, 0.0, -1.3446534, 0.0, 15.092763, 10.503944]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 117: 100%|##########| 169/169 [01:14<00:00,  2.28it/s, acc=0.968, loss=[0.23507138, 0.0, -1.3448967, 0.0, 15.061945, 10.4994335]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 118: 100%|##########| 169/169 [01:13<00:00,  2.29it/s, acc=0.967, loss=[0.23595887, 0.0, -1.3438276, 0.0, 15.044871, 10.494957]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 119: 100%|##########| 169/169 [01:14<00:00,  2.28it/s, acc=0.968, loss=[0.2355836, 0.0, -1.3432733, 0.0, 15.032297, 10.490537]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 120: 100%|##########| 169/169 [01:14<00:00,  2.26it/s, acc=0.969, loss=[0.23596472, 0.0, -1.3424337, 0.0, 15.04105, 10.486155]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 121: 100%|##########| 169/169 [01:14<00:00,  2.27it/s, acc=0.968, loss=[0.23495325, 0.0, -1.3422472, 0.0, 14.998089, 10.481826]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 122: 100%|##########| 169/169 [01:14<00:00,  2.28it/s, acc=0.97, loss=[0.23431961, 0.0, -1.3417212, 0.0, 14.978058, 10.477548]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 123: 100%|##########| 169/169 [01:14<00:00,  2.27it/s, acc=0.971, loss=[0.23548347, 0.0, -1.3406606, 0.0, 14.973125, 10.47329]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 124: 100%|##########| 169/169 [01:14<00:00,  2.27it/s, acc=0.972, loss=[0.23371287, 0.0, -1.3407369, 0.0, 14.9320755, 10.469104]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 125: 100%|##########| 169/169 [01:13<00:00,  2.29it/s, acc=0.97, loss=[0.23500831, 0.0, -1.3396858, 0.0, 14.928316, 10.464937]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 126: 100%|##########| 169/169 [01:14<00:00,  2.27it/s, acc=0.97, loss=[0.23427512, 0.0, -1.3393925, 0.0, 14.924434, 10.460822]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 127: 100%|##########| 169/169 [01:14<00:00,  2.27it/s, acc=0.971, loss=[0.23484842, 0.0, -1.3386351, 0.0, 14.911057, 10.456744]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 128: 100%|##########| 169/169 [01:14<00:00,  2.27it/s, acc=0.969, loss=[0.23386195, 0.0, -1.3382677, 0.0, 14.879253, 10.452703]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 129: 100%|##########| 169/169 [01:14<00:00,  2.28it/s, acc=0.97, loss=[0.23408064, 0.0, -1.3378564, 0.0, 14.845476, 10.448716]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 130: 100%|##########| 169/169 [01:14<00:00,  2.28it/s, acc=0.972, loss=[0.23325406, 0.0, -1.3371383, 0.0, 14.875555, 10.444756]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 131: 100%|##########| 169/169 [01:13<00:00,  2.29it/s, acc=0.973, loss=[0.23320849, 0.0, -1.3368624, 0.0, 14.820019, 10.440844]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 132: 100%|##########| 169/169 [01:14<00:00,  2.28it/s, acc=0.972, loss=[0.23333079, 0.0, -1.3359927, 0.0, 14.829697, 10.436955]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 133: 100%|##########| 169/169 [01:14<00:00,  2.28it/s, acc=0.975, loss=[0.23261538, 0.0, -1.3355474, 0.0, 14.809664, 10.433109]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 134: 100%|##########| 169/169 [01:13<00:00,  2.28it/s, acc=0.973, loss=[0.23268753, 0.0, -1.3352879, 0.0, 14.756657, 10.429295]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 135: 100%|##########| 169/169 [01:14<00:00,  2.28it/s, acc=0.973, loss=[0.23329957, 0.0, -1.3344574, 0.0, 14.78051, 10.42551]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 136: 100%|##########| 169/169 [01:14<00:00,  2.27it/s, acc=0.974, loss=[0.2325162, 0.0, -1.3339213, 0.0, 14.764238, 10.421761]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 137: 100%|##########| 169/169 [01:13<00:00,  2.28it/s, acc=0.977, loss=[0.23221576, 0.0, -1.3334886, 0.0, 14.752281, 10.418048]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 138: 100%|##########| 169/169 [01:14<00:00,  2.27it/s, acc=0.976, loss=[0.23254201, 0.0, -1.3331381, 0.0, 14.720599, 10.414368]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 139: 100%|##########| 169/169 [01:14<00:00,  2.28it/s, acc=0.974, loss=[0.23148268, 0.0, -1.3327824, 0.0, 14.719243, 10.410733]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 140: 100%|##########| 169/169 [01:14<00:00,  2.28it/s, acc=0.975, loss=[0.2315912, 0.0, -1.3320937, 0.0, 14.68109, 10.407118]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 141: 100%|##########| 169/169 [01:14<00:00,  2.28it/s, acc=0.977, loss=[0.23162341, 0.0, -1.3316228, 0.0, 14.689966, 10.403539]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 142: 100%|##########| 169/169 [01:14<00:00,  2.28it/s, acc=0.976, loss=[0.2333798, 0.0, -1.3309116, 0.0, 14.667467, 10.399983]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 143: 100%|##########| 169/169 [01:14<00:00,  2.28it/s, acc=0.977, loss=[0.231373, 0.0, -1.3307978, 0.0, 14.645648, 10.396466]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 144: 100%|##########| 169/169 [01:14<00:00,  2.28it/s, acc=0.978, loss=[0.2308421, 0.0, -1.3303185, 0.0, 14.652922, 10.392981]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 145: 100%|##########| 169/169 [01:14<00:00,  2.28it/s, acc=0.979, loss=[0.23020533, 0.0, -1.3297664, 0.0, 14.627341, 10.38952]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 146: 100%|##########| 169/169 [01:14<00:00,  2.28it/s, acc=0.978, loss=[0.23155648, 0.0, -1.3292286, 0.0, 14.613043, 10.386089]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 147: 100%|##########| 169/169 [01:14<00:00,  2.28it/s, acc=0.976, loss=[0.2323496, 0.0, -1.3285952, 0.0, 14.601454, 10.382682]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 148: 100%|##########| 169/169 [01:14<00:00,  2.28it/s, acc=0.977, loss=[0.23001266, 0.0, -1.3286442, 0.0, 14.571499, 10.37932]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 149: 100%|##########| 169/169 [01:13<00:00,  2.29it/s, acc=0.976, loss=[0.23042724, 0.0, -1.328064, 0.0, 14.585491, 10.375981]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 150: 100%|##########| 169/169 [01:13<00:00,  2.28it/s, acc=0.978, loss=[0.23136938, 0.0, -1.3273687, 0.0, 14.560466, 10.372661]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 151: 100%|##########| 169/169 [01:14<00:00,  2.27it/s, acc=0.977, loss=[0.22959816, 0.0, -1.3270981, 0.0, 14.564841, 10.369382]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 152: 100%|##########| 169/169 [01:14<00:00,  2.27it/s, acc=0.98, loss=[0.23192479, 0.0, -1.3263083, 0.0, 14.518614, 10.366109]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 153: 100%|##########| 169/169 [01:14<00:00,  2.27it/s, acc=0.98, loss=[0.22995675, 0.0, -1.3260269, 0.0, 14.534516, 10.362871]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 154: 100%|##########| 169/169 [01:14<00:00,  2.27it/s, acc=0.98, loss=[0.22933987, 0.0, -1.3255731, 0.0, 14.514115, 10.359658]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 155: 100%|##########| 169/169 [01:14<00:00,  2.28it/s, acc=0.978, loss=[0.2307089, 0.0, -1.3250141, 0.0, 14.513436, 10.35647]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 156: 100%|##########| 169/169 [01:14<00:00,  2.26it/s, acc=0.979, loss=[0.22977719, 0.0, -1.3246775, 0.0, 14.487673, 10.353305]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 157: 100%|##########| 169/169 [01:14<00:00,  2.27it/s, acc=0.979, loss=[0.22914061, 0.0, -1.3245691, 0.0, 14.459197, 10.350174]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 158: 100%|##########| 169/169 [01:14<00:00,  2.26it/s, acc=0.982, loss=[0.22896041, 0.0, -1.3237802, 0.0, 14.472633, 10.347053]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 159: 100%|##########| 169/169 [01:14<00:00,  2.27it/s, acc=0.982, loss=[0.22965385, 0.0, -1.3233851, 0.0, 14.445019, 10.343957]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 160: 100%|##########| 169/169 [01:14<00:00,  2.27it/s, acc=0.981, loss=[0.2293924, 0.0, -1.3228507, 0.0, 14.448532, 10.340896]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 161: 100%|##########| 169/169 [01:14<00:00,  2.28it/s, acc=0.98, loss=[0.22957742, 0.0, -1.3225732, 0.0, 14.439841, 10.337858]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 162: 100%|##########| 169/169 [01:14<00:00,  2.27it/s, acc=0.981, loss=[0.22879435, 0.0, -1.3220949, 0.0, 14.408901, 10.334834]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 163: 100%|##########| 169/169 [01:13<00:00,  2.28it/s, acc=0.981, loss=[0.22955117, 0.0, -1.3216115, 0.0, 14.38591, 10.331835]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 164: 100%|##########| 169/169 [01:14<00:00,  2.27it/s, acc=0.982, loss=[0.22828923, 0.0, -1.3212513, 0.0, 14.387389, 10.328856]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 165: 100%|##########| 169/169 [01:14<00:00,  2.28it/s, acc=0.982, loss=[0.22831203, 0.0, -1.3210503, 0.0, 14.376972, 10.325907]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 166: 100%|##########| 169/169 [01:14<00:00,  2.27it/s, acc=0.983, loss=[0.2293038, 0.0, -1.3204491, 0.0, 14.348372, 10.322976]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 167: 100%|##########| 169/169 [01:14<00:00,  2.27it/s, acc=0.984, loss=[0.22802891, 0.0, -1.3200145, 0.0, 14.359159, 10.320071]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 168: 100%|##########| 169/169 [01:14<00:00,  2.28it/s, acc=0.979, loss=[0.2288101, 0.0, -1.3195947, 0.0, 14.32902, 10.317177]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 169: 100%|##########| 169/169 [01:14<00:00,  2.26it/s, acc=0.981, loss=[0.22922844, 0.0, -1.3191564, 0.0, 14.337093, 10.314309]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 170: 100%|##########| 169/169 [01:14<00:00,  2.27it/s, acc=0.983, loss=[0.22758974, 0.0, -1.3188596, 0.0, 14.31589, 10.311468]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 171: 100%|##########| 169/169 [01:13<00:00,  2.28it/s, acc=0.983, loss=[0.22817387, 0.0, -1.3183943, 0.0, 14.294748, 10.308638]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 172: 100%|##########| 169/169 [01:14<00:00,  2.28it/s, acc=0.983, loss=[0.22767214, 0.0, -1.3180295, 0.0, 14.310713, 10.305842]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 173: 100%|##########| 169/169 [01:14<00:00,  2.27it/s, acc=0.982, loss=[0.22738731, 0.0, -1.3179371, 0.0, 14.25376, 10.303063]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 174: 100%|##########| 169/169 [01:14<00:00,  2.28it/s, acc=0.983, loss=[0.22747913, 0.0, -1.3173121, 0.0, 14.272991, 10.3003025]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 175: 100%|##########| 169/169 [01:14<00:00,  2.28it/s, acc=0.983, loss=[0.22801581, 0.0, -1.316843, 0.0, 14.259862, 10.29755]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 176: 100%|##########| 169/169 [01:14<00:00,  2.28it/s, acc=0.982, loss=[0.22777027, 0.0, -1.3162628, 0.0, 14.281497, 10.294829]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 177: 100%|##########| 169/169 [01:14<00:00,  2.27it/s, acc=0.983, loss=[0.2275494, 0.0, -1.3160634, 0.0, 14.231631, 10.292117]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 178: 100%|##########| 169/169 [01:14<00:00,  2.28it/s, acc=0.985, loss=[0.22804454, 0.0, -1.3156003, 0.0, 14.22479, 10.289427]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 179: 100%|##########| 169/169 [01:14<00:00,  2.27it/s, acc=0.986, loss=[0.22704095, 0.0, -1.3152363, 0.0, 14.226701, 10.286757]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 180: 100%|##########| 169/169 [01:14<00:00,  2.28it/s, acc=0.985, loss=[0.22776634, 0.0, -1.3148168, 0.0, 14.201368, 10.284106]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 181: 100%|##########| 169/169 [01:13<00:00,  2.29it/s, acc=0.983, loss=[0.22593868, 0.0, -1.3146853, 0.0, 14.209874, 10.281484]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 182: 100%|##########| 169/169 [01:14<00:00,  2.27it/s, acc=0.983, loss=[0.22776285, 0.0, -1.3138314, 0.0, 14.211723, 10.278859]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 183: 100%|##########| 169/169 [01:14<00:00,  2.27it/s, acc=0.986, loss=[0.2268177, 0.0, -1.313797, 0.0, 14.166112, 10.276264]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 184: 100%|##########| 169/169 [01:14<00:00,  2.28it/s, acc=0.985, loss=[0.226974, 0.0, -1.313333, 0.0, 14.156682, 10.273682]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 185: 100%|##########| 169/169 [01:14<00:00,  2.26it/s, acc=0.985, loss=[0.22681123, 0.0, -1.312825, 0.0, 14.168331, 10.271113]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 186: 100%|##########| 169/169 [01:14<00:00,  2.27it/s, acc=0.985, loss=[0.22576544, 0.0, -1.3126521, 0.0, 14.153477, 10.268573]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 187: 100%|##########| 169/169 [01:14<00:00,  2.28it/s, acc=0.986, loss=[0.22732729, 0.0, -1.3121732, 0.0, 14.116986, 10.266043]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 188: 100%|##########| 169/169 [01:14<00:00,  2.27it/s, acc=0.985, loss=[0.22646394, 0.0, -1.3117399, 0.0, 14.145895, 10.263524]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 189: 100%|##########| 169/169 [01:14<00:00,  2.28it/s, acc=0.985, loss=[0.2265416, 0.0, -1.3114675, 0.0, 14.126479, 10.261026]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 190: 100%|##########| 169/169 [01:14<00:00,  2.28it/s, acc=0.985, loss=[0.22583407, 0.0, -1.3111942, 0.0, 14.122411, 10.25856]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 191: 100%|##########| 169/169 [01:14<00:00,  2.28it/s, acc=0.984, loss=[0.22696465, 0.0, -1.3106997, 0.0, 14.082163, 10.256087]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 192: 100%|##########| 169/169 [01:14<00:00,  2.27it/s, acc=0.985, loss=[0.22610672, 0.0, -1.3103081, 0.0, 14.097571, 10.253645]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 193: 100%|##########| 169/169 [01:14<00:00,  2.27it/s, acc=0.987, loss=[0.2256675, 0.0, -1.3101721, 0.0, 14.070759, 10.251211]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 194: 100%|##########| 169/169 [01:14<00:00,  2.27it/s, acc=0.986, loss=[0.22645359, 0.0, -1.3095213, 0.0, 14.064287, 10.248782]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 195: 100%|##########| 169/169 [01:14<00:00,  2.28it/s, acc=0.987, loss=[0.22541572, 0.0, -1.3093346, 0.0, 14.056335, 10.246384]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 196: 100%|##########| 169/169 [01:14<00:00,  2.27it/s, acc=0.987, loss=[0.22589199, 0.0, -1.3089448, 0.0, 14.05837, 10.243991]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 197: 100%|##########| 169/169 [01:14<00:00,  2.28it/s, acc=0.987, loss=[0.22598779, 0.0, -1.3085554, 0.0, 14.0241, 10.241617]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 198: 100%|##########| 169/169 [01:14<00:00,  2.28it/s, acc=0.986, loss=[0.22655526, 0.0, -1.308237, 0.0, 14.020772, 10.23925]]
  0%|          | 0/169 [00:00<?, ?it/s]epoch 199: 100%|##########| 169/169 [01:13<00:00,  2.29it/s, acc=0.988, loss=[0.22492717, 0.0, -1.3079594, 0.0, 14.019908, 10.236906]]
