
 Namespace(filter_visualization=True, user_evaluation=False, train_counterfactual_net=True, train_all_classes=True, dropout=False, train_singular_counterfactual_net=False, choose_subclass=False, counterfactual_PP=False, resume_counterfactual_net=False, resume_from_epoch=10, test_counterfactual_net=False, load_counterfactual_net=True, resume=True, alter_class=8, analysis_class=6, find_global_filters=False, cfe_epochs=30, l1_weight=2, save_logFile=True, augmentation=True, dataset='fmnist', save_directory='./trained_weights/', train_using_builtin_fit_method=True, train=False, fine_tune=False, test=True, model='customCNN/', imagenet_weights=False) 

Model: "base_model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 28, 28, 1)]  0                                            
__________________________________________________________________________________________________
conv2d (Conv2D)                 (None, 28, 28, 64)   640         input_1[0][0]                    
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 28, 28, 64)   36928       conv2d[0][0]                     
__________________________________________________________________________________________________
max_pooling2d (MaxPooling2D)    (None, 14, 14, 64)   0           conv2d_1[0][0]                   
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 14, 14, 128)  73856       max_pooling2d[0][0]              
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (None, 14, 14, 128)  147584      conv2d_2[0][0]                   
__________________________________________________________________________________________________
max_pooling2d_1 (MaxPooling2D)  (None, 7, 7, 128)    0           conv2d_3[0][0]                   
__________________________________________________________________________________________________
conv2d_4 (Conv2D)               (None, 7, 7, 256)    295168      max_pooling2d_1[0][0]            
__________________________________________________________________________________________________
conv2d_5 (Conv2D)               (None, 7, 7, 256)    590080      conv2d_4[0][0]                   
__________________________________________________________________________________________________
maxpool2 (MaxPooling2D)         (None, 3, 3, 256)    0           conv2d_5[0][0]                   
__________________________________________________________________________________________________
global_average_pooling2d (Globa (None, 256)          0           maxpool2[0][0]                   
__________________________________________________________________________________________________
fmatrix (InputLayer)            [(None, 256)]        0                                            
__________________________________________________________________________________________________
tf.__operators__.add (TFOpLambd (None, 256)          0           global_average_pooling2d[0][0]   
                                                                 fmatrix[0][0]                    
__________________________________________________________________________________________________
dense (Dense)                   (None, 10)           2570        tf.__operators__.add[0][0]       
__________________________________________________________________________________________________
activation (Activation)         (None, 10)           0           dense[0][0]                      
==================================================================================================
Total params: 1,146,826
Trainable params: 1,146,826
Non-trainable params: 0
__________________________________________________________________________________________________
weights loaded
Model: "counterfactual_model"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 28, 28, 1)]       0         
_________________________________________________________________
conv2d (Conv2D)              (None, 28, 28, 64)        640       
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 28, 28, 64)        36928     
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 14, 14, 64)        0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 14, 14, 128)       73856     
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 14, 14, 128)       147584    
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 7, 7, 128)         0         
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 7, 7, 256)         295168    
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 7, 7, 256)         590080    
_________________________________________________________________
maxpool2 (MaxPooling2D)      (None, 3, 3, 256)         0         
_________________________________________________________________
global_average_pooling2d_1 ( (None, 256)               0         
_________________________________________________________________
dense_1 (Dense)              (None, 256)               65792     
=================================================================
Total params: 1,210,048
Trainable params: 65,792
Non-trainable params: 1,144,256
_________________________________________________________________
threshold:  0.5
l1 weight:  2
training CF model for alter class:  8
Training CF model for PNs
training for fixed alter class:  8
Model: "model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 28, 28, 1)]  0                                            
__________________________________________________________________________________________________
counterfactual_model (Functiona (None, 256)          1210048     input_1[0][0]                    
__________________________________________________________________________________________________
base_model (Functional)         [(None, 10), (None,  1146826     input_1[0][0]                    
                                                                 counterfactual_model[0][0]       
==================================================================================================
Total params: 1,212,618
Trainable params: 65,792
Non-trainable params: 1,146,826
__________________________________________________________________________________________________
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 0: 100%|#| 1875/1875 [00:24<00:00, 78.09it/s, acc=0.934, loss=[0.29720452, 0.0, -0.33242673, 0.0, 23.436132, 5.01
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 1: 100%|#| 1875/1875 [00:20<00:00, 89.68it/s, acc=0.968, loss=[0.1223305, 0.0, -0.27786598, 0.0, 13.94375, 4.6449
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 2: 100%|#| 1875/1875 [00:20<00:00, 89.50it/s, acc=0.977, loss=[0.1130689, 0.0, -0.27736574, 0.0, 12.102817, 4.482
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 3: 100%|#| 1875/1875 [00:21<00:00, 89.16it/s, acc=0.981, loss=[0.10865616, 0.0, -0.2788467, 0.0, 11.05835, 4.3868
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 4: 100%|#| 1875/1875 [00:21<00:00, 89.06it/s, acc=0.984, loss=[0.106077544, 0.0, -0.27965027, 0.0, 10.368417, 4.3
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 5: 100%|#| 1875/1875 [00:21<00:00, 86.49it/s, acc=0.986, loss=[0.104577355, 0.0, -0.27964696, 0.0, 9.819817, 4.27
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 6: 100%|#| 1875/1875 [00:21<00:00, 86.76it/s, acc=0.987, loss=[0.10341312, 0.0, -0.27927503, 0.0, 9.414033, 4.237
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 7: 100%|#| 1875/1875 [00:21<00:00, 88.24it/s, acc=0.988, loss=[0.10242249, 0.0, -0.27795717, 0.0, 9.134267, 4.207
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 8: 100%|#| 1875/1875 [00:21<00:00, 88.69it/s, acc=0.989, loss=[0.101548284, 0.0, -0.27680174, 0.0, 8.897483, 4.18
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 9: 100%|#| 1875/1875 [00:21<00:00, 88.88it/s, acc=0.99, loss=[0.10087182, 0.0, -0.275733, 0.0, 8.715567, 4.163153
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 10: 100%|#| 1875/1875 [00:21<00:00, 88.82it/s, acc=0.99, loss=[0.10051667, 0.0, -0.27394137, 0.0, 8.548817, 4.145
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 11: 100%|#| 1875/1875 [00:21<00:00, 89.24it/s, acc=0.991, loss=[0.100200675, 0.0, -0.27264243, 0.0, 8.400617, 4.1
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 12: 100%|#| 1875/1875 [00:21<00:00, 87.93it/s, acc=0.991, loss=[0.10005353, 0.0, -0.27119002, 0.0, 8.283667, 4.11
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 13: 100%|#| 1875/1875 [00:21<00:00, 89.01it/s, acc=0.991, loss=[0.099606305, 0.0, -0.2701645, 0.0, 8.18495, 4.105
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 14: 100%|#| 1875/1875 [00:21<00:00, 88.84it/s, acc=0.992, loss=[0.099257484, 0.0, -0.2690036, 0.0, 8.101417, 4.09
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 15: 100%|#| 1875/1875 [00:21<00:00, 88.90it/s, acc=0.992, loss=[0.09916696, 0.0, -0.26788065, 0.0, 8.01615, 4.085
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 16: 100%|#| 1875/1875 [00:21<00:00, 88.70it/s, acc=0.992, loss=[0.099009536, 0.0, -0.26681462, 0.0, 7.9350166, 4.
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 17: 100%|#| 1875/1875 [00:20<00:00, 89.33it/s, acc=0.992, loss=[0.098628685, 0.0, -0.26634392, 0.0, 7.8785167, 4.
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 18: 100%|#| 1875/1875 [00:20<00:00, 89.49it/s, acc=0.992, loss=[0.098692015, 0.0, -0.26556832, 0.0, 7.8215165, 4.
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 19: 100%|#| 1875/1875 [00:21<00:00, 88.50it/s, acc=0.992, loss=[0.09840793, 0.0, -0.26498494, 0.0, 7.76095, 4.055
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 20: 100%|#| 1875/1875 [00:21<00:00, 88.78it/s, acc=0.993, loss=[0.09811912, 0.0, -0.26431644, 0.0, 7.7201, 4.0498
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 21: 100%|#| 1875/1875 [00:21<00:00, 87.66it/s, acc=0.993, loss=[0.09815418, 0.0, -0.26421505, 0.0, 7.658583, 4.04
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 22: 100%|#| 1875/1875 [00:21<00:00, 88.17it/s, acc=0.993, loss=[0.09801956, 0.0, -0.26366964, 0.0, 7.6232333, 4.0
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 23: 100%|#| 1875/1875 [00:20<00:00, 89.33it/s, acc=0.993, loss=[0.09796241, 0.0, -0.2633421, 0.0, 7.577083, 4.034
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 24: 100%|#| 1875/1875 [00:21<00:00, 88.70it/s, acc=0.993, loss=[0.097729266, 0.0, -0.26334688, 0.0, 7.5363336, 4.
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 25: 100%|#| 1875/1875 [00:21<00:00, 89.17it/s, acc=0.993, loss=[0.097562276, 0.0, -0.2630699, 0.0, 7.506533, 4.02
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 26: 100%|#| 1875/1875 [00:21<00:00, 88.86it/s, acc=0.994, loss=[0.09769877, 0.0, -0.26272815, 0.0, 7.4738665, 4.0
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 27: 100%|#| 1875/1875 [00:21<00:00, 89.17it/s, acc=0.994, loss=[0.097398706, 0.0, -0.26269665, 0.0, 7.4434333, 4.
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 28: 100%|#| 1875/1875 [00:21<00:00, 89.01it/s, acc=0.994, loss=[0.09729207, 0.0, -0.26243922, 0.0, 7.41825, 4.014
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 29: 100%|#| 1875/1875 [00:21<00:00, 88.96it/s, acc=0.994, loss=[0.09733676, 0.0, -0.26232484, 0.0, 7.390633, 4.01
