
 Namespace(filter_visualization=True, user_evaluation=False, train_counterfactual_net=True, train_all_classes=True, dropout=False, train_singular_counterfactual_net=False, choose_subclass=False, counterfactual_PP=False, resume_counterfactual_net=False, resume_from_epoch=10, test_counterfactual_net=False, load_counterfactual_net=True, resume=True, alter_class=2, analysis_class=6, find_global_filters=False, cfe_epochs=30, l1_weight=2, save_logFile=True, augmentation=True, dataset='fmnist', save_directory='./trained_weights/', train_using_builtin_fit_method=True, train=False, fine_tune=False, test=True, model='customCNN/', imagenet_weights=False) 

Model: "base_model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 28, 28, 1)]  0                                            
__________________________________________________________________________________________________
conv2d (Conv2D)                 (None, 28, 28, 64)   640         input_1[0][0]                    
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 28, 28, 64)   36928       conv2d[0][0]                     
__________________________________________________________________________________________________
max_pooling2d (MaxPooling2D)    (None, 14, 14, 64)   0           conv2d_1[0][0]                   
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 14, 14, 128)  73856       max_pooling2d[0][0]              
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (None, 14, 14, 128)  147584      conv2d_2[0][0]                   
__________________________________________________________________________________________________
max_pooling2d_1 (MaxPooling2D)  (None, 7, 7, 128)    0           conv2d_3[0][0]                   
__________________________________________________________________________________________________
conv2d_4 (Conv2D)               (None, 7, 7, 256)    295168      max_pooling2d_1[0][0]            
__________________________________________________________________________________________________
conv2d_5 (Conv2D)               (None, 7, 7, 256)    590080      conv2d_4[0][0]                   
__________________________________________________________________________________________________
maxpool2 (MaxPooling2D)         (None, 3, 3, 256)    0           conv2d_5[0][0]                   
__________________________________________________________________________________________________
global_average_pooling2d (Globa (None, 256)          0           maxpool2[0][0]                   
__________________________________________________________________________________________________
fmatrix (InputLayer)            [(None, 256)]        0                                            
__________________________________________________________________________________________________
tf.__operators__.add (TFOpLambd (None, 256)          0           global_average_pooling2d[0][0]   
                                                                 fmatrix[0][0]                    
__________________________________________________________________________________________________
dense (Dense)                   (None, 10)           2570        tf.__operators__.add[0][0]       
__________________________________________________________________________________________________
activation (Activation)         (None, 10)           0           dense[0][0]                      
==================================================================================================
Total params: 1,146,826
Trainable params: 1,146,826
Non-trainable params: 0
__________________________________________________________________________________________________
weights loaded
Model: "counterfactual_model"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 28, 28, 1)]       0         
_________________________________________________________________
conv2d (Conv2D)              (None, 28, 28, 64)        640       
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 28, 28, 64)        36928     
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 14, 14, 64)        0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 14, 14, 128)       73856     
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 14, 14, 128)       147584    
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 7, 7, 128)         0         
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 7, 7, 256)         295168    
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 7, 7, 256)         590080    
_________________________________________________________________
maxpool2 (MaxPooling2D)      (None, 3, 3, 256)         0         
_________________________________________________________________
global_average_pooling2d_1 ( (None, 256)               0         
_________________________________________________________________
dense_1 (Dense)              (None, 256)               65792     
=================================================================
Total params: 1,210,048
Trainable params: 65,792
Non-trainable params: 1,144,256
_________________________________________________________________
threshold:  0.5
l1 weight:  2
training CF model for alter class:  2
Training CF model for PNs
training for fixed alter class:  2
Model: "model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 28, 28, 1)]  0                                            
__________________________________________________________________________________________________
counterfactual_model (Functiona (None, 256)          1210048     input_1[0][0]                    
__________________________________________________________________________________________________
base_model (Functional)         [(None, 10), (None,  1146826     input_1[0][0]                    
                                                                 counterfactual_model[0][0]       
==================================================================================================
Total params: 1,212,618
Trainable params: 65,792
Non-trainable params: 1,146,826
__________________________________________________________________________________________________
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 0: 100%|#| 1875/1875 [00:23<00:00, 78.24it/s, acc=0.935, loss=[0.2962727, 0.0, -0.17063905, 0.0, 20.305216, 4.528
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 1: 100%|#| 1875/1875 [00:20<00:00, 90.30it/s, acc=0.967, loss=[0.11607124, 0.0, -0.119816974, 0.0, 11.565117, 4.1
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 2: 100%|#| 1875/1875 [00:21<00:00, 89.01it/s, acc=0.975, loss=[0.10618256, 0.0, -0.11414596, 0.0, 10.189716, 4.01
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 3: 100%|#| 1875/1875 [00:20<00:00, 90.20it/s, acc=0.98, loss=[0.10116064, 0.0, -0.111018784, 0.0, 9.462483, 3.928
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 4: 100%|#| 1875/1875 [00:20<00:00, 89.53it/s, acc=0.983, loss=[0.09865356, 0.0, -0.10807914, 0.0, 8.969733, 3.868
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 5: 100%|#| 1875/1875 [00:20<00:00, 89.66it/s, acc=0.986, loss=[0.09691353, 0.0, -0.10589834, 0.0, 8.57055, 3.8252
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 6: 100%|#| 1875/1875 [00:20<00:00, 89.51it/s, acc=0.987, loss=[0.095702074, 0.0, -0.10415456, 0.0, 8.294283, 3.79
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 7: 100%|#| 1875/1875 [00:20<00:00, 89.54it/s, acc=0.987, loss=[0.09491725, 0.0, -0.10290448, 0.0, 8.046066, 3.765
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 8: 100%|#| 1875/1875 [00:21<00:00, 88.70it/s, acc=0.989, loss=[0.09418936, 0.0, -0.10180634, 0.0, 7.846433, 3.743
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 9: 100%|#| 1875/1875 [00:20<00:00, 89.44it/s, acc=0.989, loss=[0.093572326, 0.0, -0.10100889, 0.0, 7.6780667, 3.7
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 10: 100%|#| 1875/1875 [00:20<00:00, 89.48it/s, acc=0.99, loss=[0.093288586, 0.0, -0.100160934, 0.0, 7.544017, 3.7
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 11: 100%|#| 1875/1875 [00:21<00:00, 89.17it/s, acc=0.99, loss=[0.09278995, 0.0, -0.099565506, 0.0, 7.431433, 3.69
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 12: 100%|#| 1875/1875 [00:21<00:00, 88.80it/s, acc=0.991, loss=[0.092455596, 0.0, -0.09904495, 0.0, 7.3222666, 3.
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 13: 100%|#| 1875/1875 [00:20<00:00, 89.43it/s, acc=0.991, loss=[0.092148416, 0.0, -0.098395586, 0.0, 7.2326, 3.67
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 14: 100%|#| 1875/1875 [00:20<00:00, 89.52it/s, acc=0.991, loss=[0.09187229, 0.0, -0.0978625, 0.0, 7.15355, 3.6650
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 15: 100%|#| 1875/1875 [00:20<00:00, 89.84it/s, acc=0.992, loss=[0.09172245, 0.0, -0.09750342, 0.0, 7.07615, 3.656
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 16: 100%|#| 1875/1875 [00:20<00:00, 89.97it/s, acc=0.992, loss=[0.09162352, 0.0, -0.097113915, 0.0, 7.0040336, 3.
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 17: 100%|#| 1875/1875 [00:21<00:00, 89.15it/s, acc=0.992, loss=[0.091194235, 0.0, -0.096814804, 0.0, 6.951317, 3.
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 18: 100%|#| 1875/1875 [00:20<00:00, 89.48it/s, acc=0.992, loss=[0.09115929, 0.0, -0.096422374, 0.0, 6.8905168, 3.
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 19: 100%|#| 1875/1875 [00:20<00:00, 89.67it/s, acc=0.993, loss=[0.09107511, 0.0, -0.09608171, 0.0, 6.8343334, 3.6
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 20: 100%|#| 1875/1875 [00:21<00:00, 88.28it/s, acc=0.992, loss=[0.09082178, 0.0, -0.09577622, 0.0, 6.78785, 3.625
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 21: 100%|#| 1875/1875 [00:21<00:00, 89.14it/s, acc=0.993, loss=[0.09070652, 0.0, -0.095488615, 0.0, 6.733617, 3.6
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 22: 100%|#| 1875/1875 [00:21<00:00, 88.91it/s, acc=0.993, loss=[0.090511605, 0.0, -0.09529018, 0.0, 6.685467, 3.6
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 23: 100%|#| 1875/1875 [00:21<00:00, 88.89it/s, acc=0.993, loss=[0.090437494, 0.0, -0.09516181, 0.0, 6.6376667, 3.
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 24: 100%|#| 1875/1875 [00:21<00:00, 88.51it/s, acc=0.993, loss=[0.090313494, 0.0, -0.09496693, 0.0, 6.6054, 3.607
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 25: 100%|#| 1875/1875 [00:20<00:00, 89.65it/s, acc=0.993, loss=[0.09020078, 0.0, -0.0947041, 0.0, 6.5671167, 3.60
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 26: 100%|#| 1875/1875 [00:21<00:00, 89.08it/s, acc=0.993, loss=[0.09010415, 0.0, -0.09447049, 0.0, 6.5339165, 3.6
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 27: 100%|#| 1875/1875 [00:21<00:00, 89.13it/s, acc=0.994, loss=[0.09003261, 0.0, -0.09430698, 0.0, 6.5022, 3.5974
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 28: 100%|#| 1875/1875 [00:20<00:00, 89.45it/s, acc=0.993, loss=[0.08993571, 0.0, -0.09410731, 0.0, 6.460533, 3.59
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 29: 100%|#| 1875/1875 [00:20<00:00, 89.67it/s, acc=0.993, loss=[0.089829445, 0.0, -0.09399235, 0.0, 6.4370666, 3.
