
 Namespace(filter_visualization=True, user_evaluation=False, train_counterfactual_net=True, train_all_classes=True, dropout=False, train_singular_counterfactual_net=False, choose_subclass=False, counterfactual_PP=True, resume_counterfactual_net=False, resume_from_epoch=10, test_counterfactual_net=False, load_counterfactual_net=True, resume=True, alter_class=1, analysis_class=6, find_global_filters=False, cfe_epochs=30, l1_weight=1, save_logFile=True, augmentation=True, dataset='fmnist', save_directory='./trained_weights/', train_using_builtin_fit_method=True, train=False, fine_tune=False, test=True, model='customCNN/', imagenet_weights=False) 

Model: "base_model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 28, 28, 1)]  0                                            
__________________________________________________________________________________________________
conv2d (Conv2D)                 (None, 28, 28, 64)   640         input_1[0][0]                    
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 28, 28, 64)   36928       conv2d[0][0]                     
__________________________________________________________________________________________________
max_pooling2d (MaxPooling2D)    (None, 14, 14, 64)   0           conv2d_1[0][0]                   
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 14, 14, 128)  73856       max_pooling2d[0][0]              
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (None, 14, 14, 128)  147584      conv2d_2[0][0]                   
__________________________________________________________________________________________________
max_pooling2d_1 (MaxPooling2D)  (None, 7, 7, 128)    0           conv2d_3[0][0]                   
__________________________________________________________________________________________________
conv2d_4 (Conv2D)               (None, 7, 7, 256)    295168      max_pooling2d_1[0][0]            
__________________________________________________________________________________________________
conv2d_5 (Conv2D)               (None, 7, 7, 256)    590080      conv2d_4[0][0]                   
__________________________________________________________________________________________________
maxpool2 (MaxPooling2D)         (None, 3, 3, 256)    0           conv2d_5[0][0]                   
__________________________________________________________________________________________________
global_average_pooling2d (Globa (None, 256)          0           maxpool2[0][0]                   
__________________________________________________________________________________________________
fmatrix (InputLayer)            [(None, 256)]        0                                            
__________________________________________________________________________________________________
tf.math.multiply (TFOpLambda)   (None, 256)          0           global_average_pooling2d[0][0]   
                                                                 fmatrix[0][0]                    
__________________________________________________________________________________________________
dense (Dense)                   (None, 10)           2570        tf.math.multiply[0][0]           
__________________________________________________________________________________________________
activation (Activation)         (None, 10)           0           dense[0][0]                      
==================================================================================================
Total params: 1,146,826
Trainable params: 1,146,826
Non-trainable params: 0
__________________________________________________________________________________________________
weights loaded
Model: "counterfactual_model"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 28, 28, 1)]       0         
_________________________________________________________________
conv2d (Conv2D)              (None, 28, 28, 64)        640       
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 28, 28, 64)        36928     
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 14, 14, 64)        0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 14, 14, 128)       73856     
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 14, 14, 128)       147584    
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 7, 7, 128)         0         
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 7, 7, 256)         295168    
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 7, 7, 256)         590080    
_________________________________________________________________
maxpool2 (MaxPooling2D)      (None, 3, 3, 256)         0         
_________________________________________________________________
global_average_pooling2d_1 ( (None, 256)               0         
_________________________________________________________________
dense_1 (Dense)              (None, 256)               65792     
_________________________________________________________________
thresholded_re_lu (Threshold (None, 256)               0         
=================================================================
Total params: 1,210,048
Trainable params: 65,792
Non-trainable params: 1,144,256
_________________________________________________________________
threshold:  0.5
l1 weight:  1
training CF model for alter class:  1
Training CF model for PPs
training for fixed alter class:  1
Model: "model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 28, 28, 1)]  0                                            
__________________________________________________________________________________________________
counterfactual_model (Functiona (None, 256)          1210048     input_1[0][0]                    
__________________________________________________________________________________________________
base_model (Functional)         [(None, 10), (None,  1146826     input_1[0][0]                    
                                                                 counterfactual_model[0][0]       
==================================================================================================
Total params: 1,212,618
Trainable params: 65,792
Non-trainable params: 1,146,826
__________________________________________________________________________________________________
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 0: 100%|#| 1875/1875 [00:25<00:00, 72.17it/s, acc=0.963, loss=[0.48996508, 0.7216467, -0.26751092, 0.0, 26.756834
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 1: 100%|#| 1875/1875 [00:22<00:00, 82.98it/s, acc=0.998, loss=[0.2801298, 0.4653663, -0.28823546, 0.0, 16.634466,
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 2: 100%|#| 1875/1875 [00:22<00:00, 82.71it/s, acc=0.999, loss=[0.26793775, 0.4349339, -0.2942158, 0.0, 15.452367,
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 3: 100%|#| 1875/1875 [00:22<00:00, 82.80it/s, acc=0.999, loss=[0.26285562, 0.41791272, -0.29683936, 0.0, 14.80906
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 4: 100%|#| 1875/1875 [00:22<00:00, 82.56it/s, acc=0.999, loss=[0.25972357, 0.40468225, -0.29790768, 0.0, 14.35953
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 5: 100%|#| 1875/1875 [00:22<00:00, 82.13it/s, acc=0.999, loss=[0.25596216, 0.39542383, -0.29971543, 0.0, 14.06225
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 6: 100%|#| 1875/1875 [00:22<00:00, 82.12it/s, acc=0.999, loss=[0.25181478, 0.39232057, -0.30801472, 0.0, 13.95625
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 7: 100%|#| 1875/1875 [00:22<00:00, 82.21it/s, acc=0.999, loss=[0.24768664, 0.3885202, -0.3111926, 0.0, 13.828466,
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 8: 100%|#| 1875/1875 [00:22<00:00, 81.95it/s, acc=0.999, loss=[0.24367313, 0.38508818, -0.3128703, 0.0, 13.715016
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 9: 100%|#| 1875/1875 [00:22<00:00, 82.03it/s, acc=0.999, loss=[0.23943244, 0.3825335, -0.3145206, 0.0, 13.64405, 
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 10: 100%|#| 1875/1875 [00:22<00:00, 82.37it/s, acc=0.999, loss=[0.2362482, 0.37950665, -0.3155733, 0.0, 13.5452, 
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 11: 100%|#| 1875/1875 [00:22<00:00, 82.09it/s, acc=1, loss=[0.23309273, 0.37693927, -0.31647846, 0.0, 13.470034, 
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 12: 100%|#| 1875/1875 [00:22<00:00, 82.11it/s, acc=1, loss=[0.23019327, 0.37408084, -0.31699482, 0.0, 13.386733, 
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 13: 100%|#| 1875/1875 [00:22<00:00, 82.46it/s, acc=1, loss=[0.22700842, 0.37206212, -0.31775114, 0.0, 13.33705, 0
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 14: 100%|#| 1875/1875 [00:22<00:00, 82.36it/s, acc=1, loss=[0.22447594, 0.3699242, -0.31849465, 0.0, 13.2825, 0.0
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 15: 100%|#| 1875/1875 [00:22<00:00, 82.52it/s, acc=1, loss=[0.2221251, 0.36773843, -0.3191966, 0.0, 13.22295, 0.0
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 16: 100%|#| 1875/1875 [00:22<00:00, 82.53it/s, acc=1, loss=[0.2196893, 0.3659174, -0.31993428, 0.0, 13.1736, 0.0]
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 17: 100%|#| 1875/1875 [00:22<00:00, 82.61it/s, acc=1, loss=[0.2174141, 0.36399046, -0.32046202, 0.0, 13.119066, 0
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 18: 100%|#| 1875/1875 [00:23<00:00, 81.35it/s, acc=1, loss=[0.21530356, 0.36212102, -0.32094303, 0.0, 13.065534, 
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 19: 100%|#| 1875/1875 [00:23<00:00, 81.16it/s, acc=1, loss=[0.2132476, 0.3604229, -0.32144699, 0.0, 13.017333, 0.
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 20: 100%|#| 1875/1875 [00:22<00:00, 82.08it/s, acc=1, loss=[0.21105546, 0.3590805, -0.3220531, 0.0, 12.9807, 0.0]
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 21: 100%|#| 1875/1875 [00:22<00:00, 84.32it/s, acc=1, loss=[0.20902008, 0.35767794, -0.32253587, 0.0, 12.938267, 
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 22: 100%|#| 1875/1875 [00:23<00:00, 80.36it/s, acc=1, loss=[0.20688574, 0.35672235, -0.3231278, 0.0, 12.912267, 0
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 23: 100%|#| 1875/1875 [00:22<00:00, 85.11it/s, acc=1, loss=[0.20522857, 0.35526174, -0.32360005, 0.0, 12.866, 0.0
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 24: 100%|#| 1875/1875 [00:24<00:00, 75.89it/s, acc=1, loss=[0.2032453, 0.35451078, -0.32424805, 0.0, 12.846, 0.0]
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 25: 100%|#| 1875/1875 [00:24<00:00, 76.76it/s, acc=1, loss=[0.2016025, 0.3535895, -0.32495296, 0.0, 12.819384, 0.
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 26: 100%|#| 1875/1875 [00:23<00:00, 79.88it/s, acc=1, loss=[0.19984582, 0.35311067, -0.3257481, 0.0, 12.807333, 0
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 27: 100%|#| 1875/1875 [00:23<00:00, 79.57it/s, acc=1, loss=[0.19837397, 0.35220414, -0.32638612, 0.0, 12.77785, 0
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 28: 100%|#| 1875/1875 [00:23<00:00, 79.79it/s, acc=1, loss=[0.19646648, 0.3517552, -0.32708704, 0.0, 12.7676, 0.0
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 29: 100%|#| 1875/1875 [00:23<00:00, 80.18it/s, acc=1, loss=[0.19408208, 0.3516471, -0.32793072, 0.0, 12.772183, 0
