
 Namespace(filter_visualization=True, user_evaluation=False, train_counterfactual_net=True, train_all_classes=True, dropout=False, train_singular_counterfactual_net=False, choose_subclass=False, counterfactual_PP=True, resume_counterfactual_net=False, resume_from_epoch=10, test_counterfactual_net=False, load_counterfactual_net=True, resume=True, alter_class=3, analysis_class=6, find_global_filters=False, cfe_epochs=30, l1_weight=1, save_logFile=True, augmentation=True, dataset='fmnist', save_directory='./trained_weights/', train_using_builtin_fit_method=True, train=False, fine_tune=False, test=True, model='customCNN/', imagenet_weights=False) 

Model: "base_model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 28, 28, 1)]  0                                            
__________________________________________________________________________________________________
conv2d (Conv2D)                 (None, 28, 28, 64)   640         input_1[0][0]                    
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 28, 28, 64)   36928       conv2d[0][0]                     
__________________________________________________________________________________________________
max_pooling2d (MaxPooling2D)    (None, 14, 14, 64)   0           conv2d_1[0][0]                   
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 14, 14, 128)  73856       max_pooling2d[0][0]              
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (None, 14, 14, 128)  147584      conv2d_2[0][0]                   
__________________________________________________________________________________________________
max_pooling2d_1 (MaxPooling2D)  (None, 7, 7, 128)    0           conv2d_3[0][0]                   
__________________________________________________________________________________________________
conv2d_4 (Conv2D)               (None, 7, 7, 256)    295168      max_pooling2d_1[0][0]            
__________________________________________________________________________________________________
conv2d_5 (Conv2D)               (None, 7, 7, 256)    590080      conv2d_4[0][0]                   
__________________________________________________________________________________________________
maxpool2 (MaxPooling2D)         (None, 3, 3, 256)    0           conv2d_5[0][0]                   
__________________________________________________________________________________________________
global_average_pooling2d (Globa (None, 256)          0           maxpool2[0][0]                   
__________________________________________________________________________________________________
fmatrix (InputLayer)            [(None, 256)]        0                                            
__________________________________________________________________________________________________
tf.math.multiply (TFOpLambda)   (None, 256)          0           global_average_pooling2d[0][0]   
                                                                 fmatrix[0][0]                    
__________________________________________________________________________________________________
dense (Dense)                   (None, 10)           2570        tf.math.multiply[0][0]           
__________________________________________________________________________________________________
activation (Activation)         (None, 10)           0           dense[0][0]                      
==================================================================================================
Total params: 1,146,826
Trainable params: 1,146,826
Non-trainable params: 0
__________________________________________________________________________________________________
weights loaded
Model: "counterfactual_model"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 28, 28, 1)]       0         
_________________________________________________________________
conv2d (Conv2D)              (None, 28, 28, 64)        640       
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 28, 28, 64)        36928     
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 14, 14, 64)        0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 14, 14, 128)       73856     
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 14, 14, 128)       147584    
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 7, 7, 128)         0         
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 7, 7, 256)         295168    
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 7, 7, 256)         590080    
_________________________________________________________________
maxpool2 (MaxPooling2D)      (None, 3, 3, 256)         0         
_________________________________________________________________
global_average_pooling2d_1 ( (None, 256)               0         
_________________________________________________________________
dense_1 (Dense)              (None, 256)               65792     
_________________________________________________________________
thresholded_re_lu (Threshold (None, 256)               0         
=================================================================
Total params: 1,210,048
Trainable params: 65,792
Non-trainable params: 1,144,256
_________________________________________________________________
threshold:  0.5
l1 weight:  1
training CF model for alter class:  3
Training CF model for PPs
training for fixed alter class:  3
Model: "model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 28, 28, 1)]  0                                            
__________________________________________________________________________________________________
counterfactual_model (Functiona (None, 256)          1210048     input_1[0][0]                    
__________________________________________________________________________________________________
base_model (Functional)         [(None, 10), (None,  1146826     input_1[0][0]                    
                                                                 counterfactual_model[0][0]       
==================================================================================================
Total params: 1,212,618
Trainable params: 65,792
Non-trainable params: 1,146,826
__________________________________________________________________________________________________
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 0: 100%|#| 1875/1875 [00:28<00:00, 66.33it/s, acc=0.946, loss=[0.585474, 0.7144855, -0.17188647, 0.0, 26.642883, 
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 1: 100%|#| 1875/1875 [00:24<00:00, 76.67it/s, acc=0.994, loss=[0.36362088, 0.44838512, -0.18133596, 0.0, 16.11091
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 2: 100%|#| 1875/1875 [00:24<00:00, 77.24it/s, acc=0.996, loss=[0.34906867, 0.4090554, -0.17942804, 0.0, 14.551184
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 3: 100%|#| 1875/1875 [00:23<00:00, 81.04it/s, acc=0.996, loss=[0.34583676, 0.3896411, -0.18042606, 0.0, 13.8341, 
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 4: 100%|#| 1875/1875 [00:23<00:00, 79.94it/s, acc=0.997, loss=[0.34308255, 0.37152192, -0.18121308, 0.0, 13.21518
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 5: 100%|#| 1875/1875 [00:23<00:00, 80.85it/s, acc=0.997, loss=[0.33953172, 0.35920596, -0.18284638, 0.0, 12.80023
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 6: 100%|#| 1875/1875 [00:23<00:00, 80.71it/s, acc=0.997, loss=[0.3353163, 0.35193768, -0.18480186, 0.0, 12.566083
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 7: 100%|#| 1875/1875 [00:23<00:00, 81.07it/s, acc=0.997, loss=[0.32993236, 0.34923, -0.18703602, 0.0, 12.48695, 0
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 8: 100%|#| 1875/1875 [00:23<00:00, 80.98it/s, acc=0.997, loss=[0.32473323, 0.34744498, -0.18934058, 0.0, 12.4425,
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 9: 100%|#| 1875/1875 [00:23<00:00, 80.64it/s, acc=0.997, loss=[0.3201421, 0.3454734, -0.19147362, 0.0, 12.394217,
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 10: 100%|#| 1875/1875 [00:23<00:00, 81.10it/s, acc=0.997, loss=[0.31427577, 0.344918, -0.19325079, 0.0, 12.397317
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 11: 100%|#| 1875/1875 [00:23<00:00, 79.54it/s, acc=0.997, loss=[0.3065634, 0.3450031, -0.19553272, 0.0, 12.424916
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 12: 100%|#| 1875/1875 [00:24<00:00, 78.01it/s, acc=0.998, loss=[0.30039695, 0.34364995, -0.19672373, 0.0, 12.3948
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 13: 100%|#| 1875/1875 [00:23<00:00, 78.78it/s, acc=0.998, loss=[0.29655802, 0.34206682, -0.19792935, 0.0, 12.3593
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 14: 100%|#| 1875/1875 [00:23<00:00, 78.75it/s, acc=0.998, loss=[0.29340374, 0.34006736, -0.1989296, 0.0, 12.30841
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 15: 100%|#| 1875/1875 [00:23<00:00, 78.78it/s, acc=0.998, loss=[0.29108194, 0.33601454, -0.19969308, 0.0, 12.1844
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 16: 100%|#| 1875/1875 [00:23<00:00, 78.70it/s, acc=0.998, loss=[0.28794858, 0.3348742, -0.20093335, 0.0, 12.15698
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 17: 100%|#| 1875/1875 [00:23<00:00, 78.65it/s, acc=0.998, loss=[0.28260726, 0.33486027, -0.20279075, 0.0, 12.1733
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 18: 100%|#| 1875/1875 [00:23<00:00, 78.32it/s, acc=0.998, loss=[0.27785143, 0.33425024, -0.20354229, 0.0, 12.1619
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 19: 100%|#| 1875/1875 [00:23<00:00, 78.29it/s, acc=0.998, loss=[0.2751702, 0.33268607, -0.20409574, 0.0, 12.10538
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 20: 100%|#| 1875/1875 [00:23<00:00, 78.78it/s, acc=0.998, loss=[0.2726134, 0.33159146, -0.20461993, 0.0, 12.07223
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 21: 100%|#| 1875/1875 [00:24<00:00, 78.11it/s, acc=0.998, loss=[0.27089527, 0.329935, -0.20506471, 0.0, 12.017667
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 22: 100%|#| 1875/1875 [00:24<00:00, 78.02it/s, acc=0.998, loss=[0.26840353, 0.32916513, -0.20553264, 0.0, 11.9958
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 23: 100%|#| 1875/1875 [00:24<00:00, 78.08it/s, acc=0.998, loss=[0.26618212, 0.32847074, -0.20619902, 0.0, 11.9772
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 24: 100%|#| 1875/1875 [00:23<00:00, 78.56it/s, acc=0.998, loss=[0.26361856, 0.32798427, -0.20689072, 0.0, 11.9690
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 25: 100%|#| 1875/1875 [00:23<00:00, 78.66it/s, acc=0.998, loss=[0.26116765, 0.32768172, -0.20763777, 0.0, 11.9637
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 26: 100%|#| 1875/1875 [00:23<00:00, 78.91it/s, acc=0.999, loss=[0.25926146, 0.32679254, -0.20800576, 0.0, 11.9388
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 27: 100%|#| 1875/1875 [00:23<00:00, 78.48it/s, acc=0.999, loss=[0.2573989, 0.3260001, -0.2084509, 0.0, 11.915883,
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 28: 100%|#| 1875/1875 [00:23<00:00, 78.84it/s, acc=0.999, loss=[0.25533614, 0.32558703, -0.20915924, 0.0, 11.9074
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 29: 100%|#| 1875/1875 [00:23<00:00, 78.85it/s, acc=0.999, loss=[0.25324762, 0.32507947, -0.20960511, 0.0, 11.9013
