
 Namespace(filter_visualization=True, user_evaluation=False, train_counterfactual_net=True, train_all_classes=True, dropout=False, train_singular_counterfactual_net=False, choose_subclass=False, counterfactual_PP=True, resume_counterfactual_net=False, resume_from_epoch=10, test_counterfactual_net=False, load_counterfactual_net=True, resume=True, alter_class=4, analysis_class=6, find_global_filters=False, cfe_epochs=30, l1_weight=1, save_logFile=True, augmentation=True, dataset='fmnist', save_directory='./trained_weights/', train_using_builtin_fit_method=True, train=False, fine_tune=False, test=True, model='customCNN/', imagenet_weights=False) 

Model: "base_model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 28, 28, 1)]  0                                            
__________________________________________________________________________________________________
conv2d (Conv2D)                 (None, 28, 28, 64)   640         input_1[0][0]                    
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 28, 28, 64)   36928       conv2d[0][0]                     
__________________________________________________________________________________________________
max_pooling2d (MaxPooling2D)    (None, 14, 14, 64)   0           conv2d_1[0][0]                   
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 14, 14, 128)  73856       max_pooling2d[0][0]              
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (None, 14, 14, 128)  147584      conv2d_2[0][0]                   
__________________________________________________________________________________________________
max_pooling2d_1 (MaxPooling2D)  (None, 7, 7, 128)    0           conv2d_3[0][0]                   
__________________________________________________________________________________________________
conv2d_4 (Conv2D)               (None, 7, 7, 256)    295168      max_pooling2d_1[0][0]            
__________________________________________________________________________________________________
conv2d_5 (Conv2D)               (None, 7, 7, 256)    590080      conv2d_4[0][0]                   
__________________________________________________________________________________________________
maxpool2 (MaxPooling2D)         (None, 3, 3, 256)    0           conv2d_5[0][0]                   
__________________________________________________________________________________________________
global_average_pooling2d (Globa (None, 256)          0           maxpool2[0][0]                   
__________________________________________________________________________________________________
fmatrix (InputLayer)            [(None, 256)]        0                                            
__________________________________________________________________________________________________
tf.math.multiply (TFOpLambda)   (None, 256)          0           global_average_pooling2d[0][0]   
                                                                 fmatrix[0][0]                    
__________________________________________________________________________________________________
dense (Dense)                   (None, 10)           2570        tf.math.multiply[0][0]           
__________________________________________________________________________________________________
activation (Activation)         (None, 10)           0           dense[0][0]                      
==================================================================================================
Total params: 1,146,826
Trainable params: 1,146,826
Non-trainable params: 0
__________________________________________________________________________________________________
weights loaded
Model: "counterfactual_model"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 28, 28, 1)]       0         
_________________________________________________________________
conv2d (Conv2D)              (None, 28, 28, 64)        640       
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 28, 28, 64)        36928     
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 14, 14, 64)        0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 14, 14, 128)       73856     
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 14, 14, 128)       147584    
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 7, 7, 128)         0         
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 7, 7, 256)         295168    
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 7, 7, 256)         590080    
_________________________________________________________________
maxpool2 (MaxPooling2D)      (None, 3, 3, 256)         0         
_________________________________________________________________
global_average_pooling2d_1 ( (None, 256)               0         
_________________________________________________________________
dense_1 (Dense)              (None, 256)               65792     
_________________________________________________________________
thresholded_re_lu (Threshold (None, 256)               0         
=================================================================
Total params: 1,210,048
Trainable params: 65,792
Non-trainable params: 1,144,256
_________________________________________________________________
threshold:  0.5
l1 weight:  1
training CF model for alter class:  4
Training CF model for PPs
training for fixed alter class:  4
Model: "model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 28, 28, 1)]  0                                            
__________________________________________________________________________________________________
counterfactual_model (Functiona (None, 256)          1210048     input_1[0][0]                    
__________________________________________________________________________________________________
base_model (Functional)         [(None, 10), (None,  1146826     input_1[0][0]                    
                                                                 counterfactual_model[0][0]       
==================================================================================================
Total params: 1,212,618
Trainable params: 65,792
Non-trainable params: 1,146,826
__________________________________________________________________________________________________
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 0: 100%|#| 1875/1875 [00:25<00:00, 74.22it/s, acc=0.929, loss=[0.54356176, 0.77127075, -0.19553214, 0.0, 28.78605
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 1: 100%|#| 1875/1875 [00:22<00:00, 85.01it/s, acc=0.965, loss=[0.35293037, 0.436925, -0.19686626, 0.0, 15.910483,
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 2: 100%|#| 1875/1875 [00:22<00:00, 84.29it/s, acc=0.97, loss=[0.34065682, 0.406997, -0.20038205, 0.0, 14.736816, 
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 3: 100%|#| 1875/1875 [00:22<00:00, 83.72it/s, acc=0.973, loss=[0.32303116, 0.3957149, -0.20607267, 0.0, 14.278417
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 4: 100%|#| 1875/1875 [00:22<00:00, 83.78it/s, acc=0.976, loss=[0.31370196, 0.387739, -0.20909926, 0.0, 13.98175, 
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 5: 100%|#| 1875/1875 [00:22<00:00, 83.70it/s, acc=0.978, loss=[0.30521753, 0.3841524, -0.2160711, 0.0, 13.856234,
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 6: 100%|#| 1875/1875 [00:22<00:00, 84.26it/s, acc=0.979, loss=[0.29985642, 0.37890133, -0.21898367, 0.0, 13.66693
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 7: 100%|#| 1875/1875 [00:22<00:00, 84.21it/s, acc=0.981, loss=[0.29385823, 0.37510678, -0.22028671, 0.0, 13.55035
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 8: 100%|#| 1875/1875 [00:22<00:00, 84.27it/s, acc=0.983, loss=[0.28813472, 0.37207672, -0.22173503, 0.0, 13.45798
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 9: 100%|#| 1875/1875 [00:22<00:00, 83.89it/s, acc=0.983, loss=[0.28314522, 0.3689419, -0.22282454, 0.0, 13.373317
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 10: 100%|#| 1875/1875 [00:22<00:00, 84.19it/s, acc=0.984, loss=[0.27819598, 0.36637607, -0.2240607, 0.0, 13.2982,
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 11: 100%|#| 1875/1875 [00:22<00:00, 84.41it/s, acc=0.985, loss=[0.27388394, 0.3635731, -0.22494152, 0.0, 13.22411
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 12: 100%|#| 1875/1875 [00:22<00:00, 84.22it/s, acc=0.985, loss=[0.26940882, 0.3611143, -0.22592185, 0.0, 13.1481,
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 13: 100%|#| 1875/1875 [00:22<00:00, 84.27it/s, acc=0.986, loss=[0.26597404, 0.35827202, -0.22659034, 0.0, 13.0510
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 14: 100%|#| 1875/1875 [00:22<00:00, 84.35it/s, acc=0.986, loss=[0.26267958, 0.35648355, -0.22739701, 0.0, 12.9934
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 15: 100%|#| 1875/1875 [00:22<00:00, 84.28it/s, acc=0.986, loss=[0.25988388, 0.35432747, -0.22784175, 0.0, 12.9228
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 16: 100%|#| 1875/1875 [00:22<00:00, 83.91it/s, acc=0.987, loss=[0.25660884, 0.353045, -0.22851259, 0.0, 12.886316
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 17: 100%|#| 1875/1875 [00:22<00:00, 83.89it/s, acc=0.987, loss=[0.25362083, 0.3518077, -0.22913544, 0.0, 12.84813
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 18: 100%|#| 1875/1875 [00:22<00:00, 84.34it/s, acc=0.988, loss=[0.25117236, 0.3502083, -0.22963896, 0.0, 12.79773
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 19: 100%|#| 1875/1875 [00:22<00:00, 83.56it/s, acc=0.988, loss=[0.24863066, 0.3491113, -0.23027582, 0.0, 12.76655
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 20: 100%|#| 1875/1875 [00:22<00:00, 84.17it/s, acc=0.988, loss=[0.2463625, 0.34766713, -0.23071855, 0.0, 12.72426
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 21: 100%|#| 1875/1875 [00:22<00:00, 84.16it/s, acc=0.989, loss=[0.24428439, 0.34644783, -0.23123886, 0.0, 12.6911
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 22: 100%|#| 1875/1875 [00:22<00:00, 84.37it/s, acc=0.989, loss=[0.24205531, 0.3452736, -0.23162203, 0.0, 12.66175
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 23: 100%|#| 1875/1875 [00:22<00:00, 84.15it/s, acc=0.989, loss=[0.23992606, 0.3442789, -0.2322021, 0.0, 12.638766
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 24: 100%|#| 1875/1875 [00:22<00:00, 84.36it/s, acc=0.99, loss=[0.23815458, 0.34283963, -0.23273814, 0.0, 12.6027,
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 25: 100%|#| 1875/1875 [00:22<00:00, 84.39it/s, acc=0.99, loss=[0.23540148, 0.34232327, -0.23373191, 0.0, 12.60665
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 26: 100%|#| 1875/1875 [00:22<00:00, 84.27it/s, acc=0.99, loss=[0.23318, 0.34157258, -0.23463328, 0.0, 12.5928, 0.
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 27: 100%|#| 1875/1875 [00:22<00:00, 84.23it/s, acc=0.99, loss=[0.23137057, 0.3405932, -0.2353034, 0.0, 12.567133,
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 28: 100%|#| 1875/1875 [00:22<00:00, 84.44it/s, acc=0.99, loss=[0.22956608, 0.3397573, -0.23586358, 0.0, 12.544066
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 29: 100%|#| 1875/1875 [00:22<00:00, 84.32it/s, acc=0.99, loss=[0.22792396, 0.3386679, -0.23619284, 0.0, 12.5107, 
