
 Namespace(filter_visualization=True, user_evaluation=False, train_counterfactual_net=True, train_all_classes=True, dropout=False, train_singular_counterfactual_net=False, choose_subclass=False, counterfactual_PP=False, resume_counterfactual_net=False, resume_from_epoch=10, test_counterfactual_net=False, load_counterfactual_net=True, resume=True, alter_class=3, analysis_class=6, find_global_filters=False, cfe_epochs=30, l1_weight=2, save_logFile=True, augmentation=True, dataset='fmnist', save_directory='./trained_weights/', train_using_builtin_fit_method=True, train=False, fine_tune=False, test=True, model='customCNN/', imagenet_weights=False) 

Model: "base_model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 28, 28, 1)]  0                                            
__________________________________________________________________________________________________
conv2d (Conv2D)                 (None, 28, 28, 64)   640         input_1[0][0]                    
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 28, 28, 64)   36928       conv2d[0][0]                     
__________________________________________________________________________________________________
max_pooling2d (MaxPooling2D)    (None, 14, 14, 64)   0           conv2d_1[0][0]                   
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 14, 14, 128)  73856       max_pooling2d[0][0]              
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (None, 14, 14, 128)  147584      conv2d_2[0][0]                   
__________________________________________________________________________________________________
max_pooling2d_1 (MaxPooling2D)  (None, 7, 7, 128)    0           conv2d_3[0][0]                   
__________________________________________________________________________________________________
conv2d_4 (Conv2D)               (None, 7, 7, 256)    295168      max_pooling2d_1[0][0]            
__________________________________________________________________________________________________
conv2d_5 (Conv2D)               (None, 7, 7, 256)    590080      conv2d_4[0][0]                   
__________________________________________________________________________________________________
maxpool2 (MaxPooling2D)         (None, 3, 3, 256)    0           conv2d_5[0][0]                   
__________________________________________________________________________________________________
global_average_pooling2d (Globa (None, 256)          0           maxpool2[0][0]                   
__________________________________________________________________________________________________
fmatrix (InputLayer)            [(None, 256)]        0                                            
__________________________________________________________________________________________________
tf.__operators__.add (TFOpLambd (None, 256)          0           global_average_pooling2d[0][0]   
                                                                 fmatrix[0][0]                    
__________________________________________________________________________________________________
dense (Dense)                   (None, 10)           2570        tf.__operators__.add[0][0]       
__________________________________________________________________________________________________
activation (Activation)         (None, 10)           0           dense[0][0]                      
==================================================================================================
Total params: 1,146,826
Trainable params: 1,146,826
Non-trainable params: 0
__________________________________________________________________________________________________
weights loaded
Model: "counterfactual_model"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 28, 28, 1)]       0         
_________________________________________________________________
conv2d (Conv2D)              (None, 28, 28, 64)        640       
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 28, 28, 64)        36928     
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 14, 14, 64)        0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 14, 14, 128)       73856     
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 14, 14, 128)       147584    
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 7, 7, 128)         0         
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 7, 7, 256)         295168    
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 7, 7, 256)         590080    
_________________________________________________________________
maxpool2 (MaxPooling2D)      (None, 3, 3, 256)         0         
_________________________________________________________________
global_average_pooling2d_1 ( (None, 256)               0         
_________________________________________________________________
dense_1 (Dense)              (None, 256)               65792     
=================================================================
Total params: 1,210,048
Trainable params: 65,792
Non-trainable params: 1,144,256
_________________________________________________________________
threshold:  0.5
l1 weight:  2
training CF model for alter class:  3
Training CF model for PNs
training for fixed alter class:  3
Model: "model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 28, 28, 1)]  0                                            
__________________________________________________________________________________________________
counterfactual_model (Functiona (None, 256)          1210048     input_1[0][0]                    
__________________________________________________________________________________________________
base_model (Functional)         [(None, 10), (None,  1146826     input_1[0][0]                    
                                                                 counterfactual_model[0][0]       
==================================================================================================
Total params: 1,212,618
Trainable params: 65,792
Non-trainable params: 1,146,826
__________________________________________________________________________________________________
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 0: 100%|#| 1875/1875 [00:24<00:00, 75.42it/s, acc=0.928, loss=[0.31679565, 0.0, -0.17467128, 0.0, 23.697332, 5.09
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 1: 100%|#| 1875/1875 [00:21<00:00, 86.23it/s, acc=0.962, loss=[0.12877318, 0.0, -0.10644636, 0.0, 13.607767, 4.69
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 2: 100%|#| 1875/1875 [00:21<00:00, 86.22it/s, acc=0.97, loss=[0.11789607, 0.0, -0.09390751, 0.0, 11.59895, 4.5206
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 3: 100%|#| 1875/1875 [00:21<00:00, 86.20it/s, acc=0.975, loss=[0.11338715, 0.0, -0.08789225, 0.0, 10.667033, 4.41
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 4: 100%|#| 1875/1875 [00:21<00:00, 85.90it/s, acc=0.978, loss=[0.11012346, 0.0, -0.08410668, 0.0, 10.05345, 4.352
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 5: 100%|#| 1875/1875 [00:21<00:00, 85.80it/s, acc=0.981, loss=[0.108771965, 0.0, -0.08117827, 0.0, 9.627666, 4.30
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 6: 100%|#| 1875/1875 [00:21<00:00, 86.08it/s, acc=0.983, loss=[0.10728857, 0.0, -0.0788635, 0.0, 9.2982, 4.266123
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 7: 100%|#| 1875/1875 [00:21<00:00, 85.97it/s, acc=0.984, loss=[0.106530935, 0.0, -0.07713958, 0.0, 9.020516, 4.23
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 8: 100%|#| 1875/1875 [00:21<00:00, 86.25it/s, acc=0.985, loss=[0.10559224, 0.0, -0.07563481, 0.0, 8.789817, 4.211
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 9: 100%|#| 1875/1875 [00:21<00:00, 86.10it/s, acc=0.985, loss=[0.10502493, 0.0, -0.07447251, 0.0, 8.573816, 4.191
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 10: 100%|#| 1875/1875 [00:21<00:00, 86.11it/s, acc=0.986, loss=[0.10464759, 0.0, -0.07393358, 0.0, 8.391684, 4.17
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 11: 100%|#| 1875/1875 [00:21<00:00, 86.14it/s, acc=0.987, loss=[0.103868656, 0.0, -0.07328171, 0.0, 8.256567, 4.1
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 12: 100%|#| 1875/1875 [00:21<00:00, 86.04it/s, acc=0.987, loss=[0.103602715, 0.0, -0.07265822, 0.0, 8.143217, 4.1
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 13: 100%|#| 1875/1875 [00:21<00:00, 86.89it/s, acc=0.988, loss=[0.10326424, 0.0, -0.072094016, 0.0, 8.041833, 4.1
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 14: 100%|#| 1875/1875 [00:21<00:00, 87.85it/s, acc=0.988, loss=[0.10258795, 0.0, -0.0714782, 0.0, 7.962983, 4.123
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 15: 100%|#| 1875/1875 [00:21<00:00, 87.56it/s, acc=0.989, loss=[0.10261112, 0.0, -0.071112454, 0.0, 7.8821836, 4.
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 16: 100%|#| 1875/1875 [00:21<00:00, 87.49it/s, acc=0.989, loss=[0.102324456, 0.0, -0.070487686, 0.0, 7.81775, 4.1
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 17: 100%|#| 1875/1875 [00:21<00:00, 87.64it/s, acc=0.989, loss=[0.101837076, 0.0, -0.070242524, 0.0, 7.7597833, 4
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 18: 100%|#| 1875/1875 [00:21<00:00, 87.73it/s, acc=0.989, loss=[0.10197654, 0.0, -0.06981043, 0.0, 7.6991, 4.0916
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 19: 100%|#| 1875/1875 [00:21<00:00, 87.45it/s, acc=0.99, loss=[0.1015478, 0.0, -0.06949451, 0.0, 7.65195, 4.08517
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 20: 100%|#| 1875/1875 [00:21<00:00, 87.28it/s, acc=0.99, loss=[0.101519614, 0.0, -0.06906287, 0.0, 7.6102333, 4.0
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 21: 100%|#| 1875/1875 [00:21<00:00, 87.27it/s, acc=0.99, loss=[0.1013235, 0.0, -0.068893515, 0.0, 7.584067, 4.073
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 22: 100%|#| 1875/1875 [00:21<00:00, 87.55it/s, acc=0.99, loss=[0.10128038, 0.0, -0.06864627, 0.0, 7.5631, 4.06869
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 23: 100%|#| 1875/1875 [00:21<00:00, 87.27it/s, acc=0.991, loss=[0.10115492, 0.0, -0.06846045, 0.0, 7.5315332, 4.0
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 24: 100%|#| 1875/1875 [00:21<00:00, 87.58it/s, acc=0.99, loss=[0.10094104, 0.0, -0.06829154, 0.0, 7.5178, 4.05949
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 25: 100%|#| 1875/1875 [00:21<00:00, 87.64it/s, acc=0.99, loss=[0.10076046, 0.0, -0.06822074, 0.0, 7.4882665, 4.05
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 26: 100%|#| 1875/1875 [00:21<00:00, 87.59it/s, acc=0.991, loss=[0.100680485, 0.0, -0.068044126, 0.0, 7.4505167, 4
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 27: 100%|#| 1875/1875 [00:21<00:00, 87.79it/s, acc=0.991, loss=[0.100732334, 0.0, -0.06799166, 0.0, 7.4143, 4.047
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 28: 100%|#| 1875/1875 [00:21<00:00, 87.44it/s, acc=0.991, loss=[0.10028691, 0.0, -0.06775133, 0.0, 7.3821, 4.0441
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 29: 100%|#| 1875/1875 [00:21<00:00, 87.77it/s, acc=0.991, loss=[0.10048974, 0.0, -0.06772808, 0.0, 7.357283, 4.04
