
 Namespace(filter_visualization=True, user_evaluation=False, train_counterfactual_net=True, train_all_classes=True, dropout=False, train_singular_counterfactual_net=False, choose_subclass=False, counterfactual_PP=False, resume_counterfactual_net=False, resume_from_epoch=10, test_counterfactual_net=False, load_counterfactual_net=True, resume=True, alter_class=6, analysis_class=6, find_global_filters=False, cfe_epochs=30, l1_weight=2, save_logFile=True, augmentation=True, dataset='fmnist', save_directory='./trained_weights/', train_using_builtin_fit_method=True, train=False, fine_tune=False, test=True, model='customCNN/', imagenet_weights=False) 

Model: "base_model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 28, 28, 1)]  0                                            
__________________________________________________________________________________________________
conv2d (Conv2D)                 (None, 28, 28, 64)   640         input_1[0][0]                    
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 28, 28, 64)   36928       conv2d[0][0]                     
__________________________________________________________________________________________________
max_pooling2d (MaxPooling2D)    (None, 14, 14, 64)   0           conv2d_1[0][0]                   
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 14, 14, 128)  73856       max_pooling2d[0][0]              
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (None, 14, 14, 128)  147584      conv2d_2[0][0]                   
__________________________________________________________________________________________________
max_pooling2d_1 (MaxPooling2D)  (None, 7, 7, 128)    0           conv2d_3[0][0]                   
__________________________________________________________________________________________________
conv2d_4 (Conv2D)               (None, 7, 7, 256)    295168      max_pooling2d_1[0][0]            
__________________________________________________________________________________________________
conv2d_5 (Conv2D)               (None, 7, 7, 256)    590080      conv2d_4[0][0]                   
__________________________________________________________________________________________________
maxpool2 (MaxPooling2D)         (None, 3, 3, 256)    0           conv2d_5[0][0]                   
__________________________________________________________________________________________________
global_average_pooling2d (Globa (None, 256)          0           maxpool2[0][0]                   
__________________________________________________________________________________________________
fmatrix (InputLayer)            [(None, 256)]        0                                            
__________________________________________________________________________________________________
tf.__operators__.add (TFOpLambd (None, 256)          0           global_average_pooling2d[0][0]   
                                                                 fmatrix[0][0]                    
__________________________________________________________________________________________________
dense (Dense)                   (None, 10)           2570        tf.__operators__.add[0][0]       
__________________________________________________________________________________________________
activation (Activation)         (None, 10)           0           dense[0][0]                      
==================================================================================================
Total params: 1,146,826
Trainable params: 1,146,826
Non-trainable params: 0
__________________________________________________________________________________________________
weights loaded
Model: "counterfactual_model"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 28, 28, 1)]       0         
_________________________________________________________________
conv2d (Conv2D)              (None, 28, 28, 64)        640       
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 28, 28, 64)        36928     
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 14, 14, 64)        0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 14, 14, 128)       73856     
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 14, 14, 128)       147584    
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 7, 7, 128)         0         
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 7, 7, 256)         295168    
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 7, 7, 256)         590080    
_________________________________________________________________
maxpool2 (MaxPooling2D)      (None, 3, 3, 256)         0         
_________________________________________________________________
global_average_pooling2d_1 ( (None, 256)               0         
_________________________________________________________________
dense_1 (Dense)              (None, 256)               65792     
=================================================================
Total params: 1,210,048
Trainable params: 65,792
Non-trainable params: 1,144,256
_________________________________________________________________
threshold:  0.5
l1 weight:  2
training CF model for alter class:  6
Training CF model for PNs
training for fixed alter class:  6
Model: "model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 28, 28, 1)]  0                                            
__________________________________________________________________________________________________
counterfactual_model (Functiona (None, 256)          1210048     input_1[0][0]                    
__________________________________________________________________________________________________
base_model (Functional)         [(None, 10), (None,  1146826     input_1[0][0]                    
                                                                 counterfactual_model[0][0]       
==================================================================================================
Total params: 1,212,618
Trainable params: 65,792
Non-trainable params: 1,146,826
__________________________________________________________________________________________________
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 0: 100%|#| 1875/1875 [00:24<00:00, 77.49it/s, acc=0.934, loss=[0.3013153, 0.0, -0.26414707, 0.0, 19.4257, 4.21202
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 1: 100%|#| 1875/1875 [00:21<00:00, 87.86it/s, acc=0.966, loss=[0.11511726, 0.0, -0.19141158, 0.0, 10.50215, 3.839
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 2: 100%|#| 1875/1875 [00:21<00:00, 87.45it/s, acc=0.974, loss=[0.105029985, 0.0, -0.18077198, 0.0, 8.98375, 3.680
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 3: 100%|#| 1875/1875 [00:21<00:00, 87.33it/s, acc=0.979, loss=[0.10054954, 0.0, -0.1746158, 0.0, 8.25585, 3.58889
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 4: 100%|#| 1875/1875 [00:21<00:00, 87.44it/s, acc=0.982, loss=[0.097395614, 0.0, -0.17073022, 0.0, 7.7854333, 3.5
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 5: 100%|#| 1875/1875 [00:21<00:00, 87.40it/s, acc=0.984, loss=[0.09552195, 0.0, -0.16851433, 0.0, 7.4231, 3.48551
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 6: 100%|#| 1875/1875 [00:21<00:00, 87.34it/s, acc=0.985, loss=[0.09389607, 0.0, -0.16723593, 0.0, 7.1398335, 3.45
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 7: 100%|#| 1875/1875 [00:21<00:00, 87.31it/s, acc=0.987, loss=[0.09247982, 0.0, -0.16617805, 0.0, 6.9257665, 3.42
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 8: 100%|#| 1875/1875 [00:21<00:00, 87.44it/s, acc=0.988, loss=[0.091710515, 0.0, -0.16553134, 0.0, 6.74385, 3.405
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 9: 100%|#| 1875/1875 [00:21<00:00, 87.39it/s, acc=0.988, loss=[0.09081047, 0.0, -0.16492355, 0.0, 6.5927334, 3.38
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 10: 100%|#| 1875/1875 [00:21<00:00, 87.48it/s, acc=0.989, loss=[0.090179175, 0.0, -0.16423036, 0.0, 6.468167, 3.3
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 11: 100%|#| 1875/1875 [00:21<00:00, 87.37it/s, acc=0.99, loss=[0.08947527, 0.0, -0.16402937, 0.0, 6.360833, 3.359
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 12: 100%|#| 1875/1875 [00:21<00:00, 87.27it/s, acc=0.99, loss=[0.0891143, 0.0, -0.16350064, 0.0, 6.2634335, 3.348
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 13: 100%|#| 1875/1875 [00:21<00:00, 87.34it/s, acc=0.991, loss=[0.08853073, 0.0, -0.16314206, 0.0, 6.18265, 3.338
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 14: 100%|#| 1875/1875 [00:21<00:00, 87.41it/s, acc=0.992, loss=[0.08804066, 0.0, -0.16279039, 0.0, 6.1099834, 3.3
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 15: 100%|#| 1875/1875 [00:21<00:00, 87.42it/s, acc=0.992, loss=[0.087787546, 0.0, -0.16254573, 0.0, 6.0551, 3.321
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 16: 100%|#| 1875/1875 [00:21<00:00, 87.59it/s, acc=0.992, loss=[0.0876575, 0.0, -0.1624095, 0.0, 5.9884334, 3.313
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 17: 100%|#| 1875/1875 [00:21<00:00, 87.49it/s, acc=0.992, loss=[0.087225944, 0.0, -0.16214052, 0.0, 5.9382668, 3.
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 18: 100%|#| 1875/1875 [00:21<00:00, 87.33it/s, acc=0.992, loss=[0.08697793, 0.0, -0.16199985, 0.0, 5.88985, 3.301
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 19: 100%|#| 1875/1875 [00:21<00:00, 87.36it/s, acc=0.993, loss=[0.08695173, 0.0, -0.16186714, 0.0, 5.8416667, 3.2
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 20: 100%|#| 1875/1875 [00:21<00:00, 87.61it/s, acc=0.993, loss=[0.08662342, 0.0, -0.16174832, 0.0, 5.8085833, 3.2
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 21: 100%|#| 1875/1875 [00:21<00:00, 87.44it/s, acc=0.993, loss=[0.08650032, 0.0, -0.16158178, 0.0, 5.7679167, 3.2
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 22: 100%|#| 1875/1875 [00:21<00:00, 87.52it/s, acc=0.993, loss=[0.086318515, 0.0, -0.16152976, 0.0, 5.72965, 3.28
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 23: 100%|#| 1875/1875 [00:21<00:00, 87.35it/s, acc=0.993, loss=[0.086187035, 0.0, -0.16144074, 0.0, 5.6745667, 3.
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 24: 100%|#| 1875/1875 [00:21<00:00, 87.24it/s, acc=0.993, loss=[0.085947454, 0.0, -0.1613618, 0.0, 5.6493835, 3.2
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 25: 100%|#| 1875/1875 [00:21<00:00, 87.45it/s, acc=0.994, loss=[0.085869595, 0.0, -0.16119123, 0.0, 5.618467, 3.2
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 26: 100%|#| 1875/1875 [00:21<00:00, 87.11it/s, acc=0.994, loss=[0.08570542, 0.0, -0.16111489, 0.0, 5.5871, 3.2672
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 27: 100%|#| 1875/1875 [00:21<00:00, 87.17it/s, acc=0.993, loss=[0.085625306, 0.0, -0.16107918, 0.0, 5.5526, 3.264
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 28: 100%|#| 1875/1875 [00:21<00:00, 87.43it/s, acc=0.994, loss=[0.08545523, 0.0, -0.16099505, 0.0, 5.52535, 3.261
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 29: 100%|#| 1875/1875 [00:21<00:00, 87.45it/s, acc=0.994, loss=[0.085497454, 0.0, -0.16090389, 0.0, 5.5000167, 3.
