
 Namespace(filter_visualization=True, user_evaluation=False, train_counterfactual_net=True, train_all_classes=True, dropout=False, train_singular_counterfactual_net=False, choose_subclass=False, counterfactual_PP=False, resume_counterfactual_net=False, resume_from_epoch=10, test_counterfactual_net=False, load_counterfactual_net=True, resume=True, alter_class=9, analysis_class=6, find_global_filters=False, cfe_epochs=30, l1_weight=2, save_logFile=True, augmentation=True, dataset='fmnist', save_directory='./trained_weights/', train_using_builtin_fit_method=True, train=False, fine_tune=False, test=True, model='customCNN/', imagenet_weights=False) 

Model: "base_model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 28, 28, 1)]  0                                            
__________________________________________________________________________________________________
conv2d (Conv2D)                 (None, 28, 28, 64)   640         input_1[0][0]                    
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 28, 28, 64)   36928       conv2d[0][0]                     
__________________________________________________________________________________________________
max_pooling2d (MaxPooling2D)    (None, 14, 14, 64)   0           conv2d_1[0][0]                   
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 14, 14, 128)  73856       max_pooling2d[0][0]              
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (None, 14, 14, 128)  147584      conv2d_2[0][0]                   
__________________________________________________________________________________________________
max_pooling2d_1 (MaxPooling2D)  (None, 7, 7, 128)    0           conv2d_3[0][0]                   
__________________________________________________________________________________________________
conv2d_4 (Conv2D)               (None, 7, 7, 256)    295168      max_pooling2d_1[0][0]            
__________________________________________________________________________________________________
conv2d_5 (Conv2D)               (None, 7, 7, 256)    590080      conv2d_4[0][0]                   
__________________________________________________________________________________________________
maxpool2 (MaxPooling2D)         (None, 3, 3, 256)    0           conv2d_5[0][0]                   
__________________________________________________________________________________________________
global_average_pooling2d (Globa (None, 256)          0           maxpool2[0][0]                   
__________________________________________________________________________________________________
fmatrix (InputLayer)            [(None, 256)]        0                                            
__________________________________________________________________________________________________
tf.__operators__.add (TFOpLambd (None, 256)          0           global_average_pooling2d[0][0]   
                                                                 fmatrix[0][0]                    
__________________________________________________________________________________________________
dense (Dense)                   (None, 10)           2570        tf.__operators__.add[0][0]       
__________________________________________________________________________________________________
activation (Activation)         (None, 10)           0           dense[0][0]                      
==================================================================================================
Total params: 1,146,826
Trainable params: 1,146,826
Non-trainable params: 0
__________________________________________________________________________________________________
weights loaded
Model: "counterfactual_model"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 28, 28, 1)]       0         
_________________________________________________________________
conv2d (Conv2D)              (None, 28, 28, 64)        640       
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 28, 28, 64)        36928     
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 14, 14, 64)        0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 14, 14, 128)       73856     
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 14, 14, 128)       147584    
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 7, 7, 128)         0         
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 7, 7, 256)         295168    
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 7, 7, 256)         590080    
_________________________________________________________________
maxpool2 (MaxPooling2D)      (None, 3, 3, 256)         0         
_________________________________________________________________
global_average_pooling2d_1 ( (None, 256)               0         
_________________________________________________________________
dense_1 (Dense)              (None, 256)               65792     
=================================================================
Total params: 1,210,048
Trainable params: 65,792
Non-trainable params: 1,144,256
_________________________________________________________________
threshold:  0.5
l1 weight:  2
training CF model for alter class:  9
Training CF model for PNs
training for fixed alter class:  9
Model: "model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 28, 28, 1)]  0                                            
__________________________________________________________________________________________________
counterfactual_model (Functiona (None, 256)          1210048     input_1[0][0]                    
__________________________________________________________________________________________________
base_model (Functional)         [(None, 10), (None,  1146826     input_1[0][0]                    
                                                                 counterfactual_model[0][0]       
==================================================================================================
Total params: 1,212,618
Trainable params: 65,792
Non-trainable params: 1,146,826
__________________________________________________________________________________________________
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 0: 100%|#| 1875/1875 [00:23<00:00, 78.33it/s, acc=0.931, loss=[0.3544185, 0.0, -0.3382578, 0.0, 24.49775, 5.19667
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 1: 100%|#| 1875/1875 [00:20<00:00, 89.76it/s, acc=0.966, loss=[0.12535632, 0.0, -0.28360072, 0.0, 14.3502, 4.7968
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 2: 100%|#| 1875/1875 [00:20<00:00, 89.35it/s, acc=0.977, loss=[0.11493103, 0.0, -0.2744476, 0.0, 12.1833, 4.62680
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 3: 100%|#| 1875/1875 [00:20<00:00, 89.66it/s, acc=0.981, loss=[0.11015779, 0.0, -0.2705666, 0.0, 10.98495, 4.5281
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 4: 100%|#| 1875/1875 [00:20<00:00, 89.74it/s, acc=0.985, loss=[0.107401565, 0.0, -0.26863062, 0.0, 10.222816, 4.4
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 5: 100%|#| 1875/1875 [00:20<00:00, 89.49it/s, acc=0.986, loss=[0.10581038, 0.0, -0.26768067, 0.0, 9.715883, 4.414
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 6: 100%|#| 1875/1875 [00:20<00:00, 89.72it/s, acc=0.988, loss=[0.10461401, 0.0, -0.26728356, 0.0, 9.320434, 4.378
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 7: 100%|#| 1875/1875 [00:20<00:00, 89.42it/s, acc=0.989, loss=[0.10373222, 0.0, -0.26673225, 0.0, 9.027284, 4.349
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 8: 100%|#| 1875/1875 [00:20<00:00, 89.48it/s, acc=0.99, loss=[0.103047214, 0.0, -0.26637706, 0.0, 8.793467, 4.325
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 9: 100%|#| 1875/1875 [00:21<00:00, 89.22it/s, acc=0.991, loss=[0.1026574, 0.0, -0.26573664, 0.0, 8.608033, 4.3057
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 10: 100%|#| 1875/1875 [00:20<00:00, 89.40it/s, acc=0.991, loss=[0.10236859, 0.0, -0.26521513, 0.0, 8.439584, 4.28
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 11: 100%|#| 1875/1875 [00:20<00:00, 89.64it/s, acc=0.992, loss=[0.10173311, 0.0, -0.2646066, 0.0, 8.284516, 4.274
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 12: 100%|#| 1875/1875 [00:20<00:00, 89.76it/s, acc=0.992, loss=[0.10169481, 0.0, -0.2640989, 0.0, 8.1459, 4.26152
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 13: 100%|#| 1875/1875 [00:20<00:00, 89.58it/s, acc=0.992, loss=[0.10137232, 0.0, -0.26396957, 0.0, 8.019867, 4.25
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 14: 100%|#| 1875/1875 [00:21<00:00, 88.47it/s, acc=0.993, loss=[0.10107238, 0.0, -0.26337478, 0.0, 7.897033, 4.24
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 15: 100%|#| 1875/1875 [00:20<00:00, 89.58it/s, acc=0.993, loss=[0.100856684, 0.0, -0.26297733, 0.0, 7.8017335, 4.
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 16: 100%|#| 1875/1875 [00:20<00:00, 89.86it/s, acc=0.993, loss=[0.10065226, 0.0, -0.26277447, 0.0, 7.6914167, 4.2
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 17: 100%|#| 1875/1875 [00:21<00:00, 87.24it/s, acc=0.993, loss=[0.10052205, 0.0, -0.26213714, 0.0, 7.6266665, 4.2
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 18: 100%|#| 1875/1875 [00:20<00:00, 89.30it/s, acc=0.993, loss=[0.10035277, 0.0, -0.2618318, 0.0, 7.5607166, 4.20
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 19: 100%|#| 1875/1875 [00:20<00:00, 89.79it/s, acc=0.993, loss=[0.10024677, 0.0, -0.2615817, 0.0, 7.4890666, 4.20
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 20: 100%|#| 1875/1875 [00:20<00:00, 89.67it/s, acc=0.994, loss=[0.10007946, 0.0, -0.26141003, 0.0, 7.43315, 4.196
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 21: 100%|#| 1875/1875 [00:20<00:00, 89.64it/s, acc=0.994, loss=[0.09979111, 0.0, -0.26113242, 0.0, 7.3840165, 4.1
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 22: 100%|#| 1875/1875 [00:20<00:00, 89.52it/s, acc=0.994, loss=[0.09982124, 0.0, -0.26095816, 0.0, 7.34155, 4.186
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 23: 100%|#| 1875/1875 [00:20<00:00, 89.70it/s, acc=0.994, loss=[0.09976257, 0.0, -0.2607127, 0.0, 7.2974834, 4.18
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 24: 100%|#| 1875/1875 [00:20<00:00, 89.94it/s, acc=0.995, loss=[0.09939195, 0.0, -0.2605009, 0.0, 7.2549834, 4.17
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 25: 100%|#| 1875/1875 [00:20<00:00, 89.90it/s, acc=0.994, loss=[0.09951181, 0.0, -0.26028538, 0.0, 7.2187667, 4.1
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 26: 100%|#| 1875/1875 [00:20<00:00, 89.69it/s, acc=0.995, loss=[0.09936471, 0.0, -0.26013434, 0.0, 7.1922336, 4.1
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 27: 100%|#| 1875/1875 [00:20<00:00, 89.84it/s, acc=0.995, loss=[0.099190585, 0.0, -0.2601318, 0.0, 7.1534667, 4.1
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 28: 100%|#| 1875/1875 [00:20<00:00, 89.50it/s, acc=0.995, loss=[0.09909242, 0.0, -0.26012382, 0.0, 7.115383, 4.16
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 29: 100%|#| 1875/1875 [00:20<00:00, 89.73it/s, acc=0.995, loss=[0.099132635, 0.0, -0.2597913, 0.0, 7.0960665, 4.1
