
 Namespace(filter_visualization=True, user_evaluation=False, train_counterfactual_net=True, train_all_classes=True, dropout=False, train_singular_counterfactual_net=False, choose_subclass=False, counterfactual_PP=True, resume_counterfactual_net=False, resume_from_epoch=10, test_counterfactual_net=False, load_counterfactual_net=True, resume=True, alter_class=0, analysis_class=6, find_global_filters=False, cfe_epochs=30, l1_weight=1, save_logFile=True, augmentation=True, dataset='fmnist', save_directory='./trained_weights/', train_using_builtin_fit_method=True, train=False, fine_tune=False, test=True, model='customCNN/', imagenet_weights=False) 

Model: "base_model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 28, 28, 1)]  0                                            
__________________________________________________________________________________________________
conv2d (Conv2D)                 (None, 28, 28, 64)   640         input_1[0][0]                    
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 28, 28, 64)   36928       conv2d[0][0]                     
__________________________________________________________________________________________________
max_pooling2d (MaxPooling2D)    (None, 14, 14, 64)   0           conv2d_1[0][0]                   
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 14, 14, 128)  73856       max_pooling2d[0][0]              
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (None, 14, 14, 128)  147584      conv2d_2[0][0]                   
__________________________________________________________________________________________________
max_pooling2d_1 (MaxPooling2D)  (None, 7, 7, 128)    0           conv2d_3[0][0]                   
__________________________________________________________________________________________________
conv2d_4 (Conv2D)               (None, 7, 7, 256)    295168      max_pooling2d_1[0][0]            
__________________________________________________________________________________________________
conv2d_5 (Conv2D)               (None, 7, 7, 256)    590080      conv2d_4[0][0]                   
__________________________________________________________________________________________________
maxpool2 (MaxPooling2D)         (None, 3, 3, 256)    0           conv2d_5[0][0]                   
__________________________________________________________________________________________________
global_average_pooling2d (Globa (None, 256)          0           maxpool2[0][0]                   
__________________________________________________________________________________________________
fmatrix (InputLayer)            [(None, 256)]        0                                            
__________________________________________________________________________________________________
tf.math.multiply (TFOpLambda)   (None, 256)          0           global_average_pooling2d[0][0]   
                                                                 fmatrix[0][0]                    
__________________________________________________________________________________________________
dense (Dense)                   (None, 10)           2570        tf.math.multiply[0][0]           
__________________________________________________________________________________________________
activation (Activation)         (None, 10)           0           dense[0][0]                      
==================================================================================================
Total params: 1,146,826
Trainable params: 1,146,826
Non-trainable params: 0
__________________________________________________________________________________________________
weights loaded
Model: "counterfactual_model"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 28, 28, 1)]       0         
_________________________________________________________________
conv2d (Conv2D)              (None, 28, 28, 64)        640       
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 28, 28, 64)        36928     
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 14, 14, 64)        0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 14, 14, 128)       73856     
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 14, 14, 128)       147584    
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 7, 7, 128)         0         
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 7, 7, 256)         295168    
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 7, 7, 256)         590080    
_________________________________________________________________
maxpool2 (MaxPooling2D)      (None, 3, 3, 256)         0         
_________________________________________________________________
global_average_pooling2d_1 ( (None, 256)               0         
_________________________________________________________________
dense_1 (Dense)              (None, 256)               65792     
_________________________________________________________________
thresholded_re_lu (Threshold (None, 256)               0         
=================================================================
Total params: 1,210,048
Trainable params: 65,792
Non-trainable params: 1,144,256
_________________________________________________________________
threshold:  0.5
l1 weight:  1
training CF model for alter class:  0
Training CF model for PPs
training for fixed alter class:  0
Model: "model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 28, 28, 1)]  0                                            
__________________________________________________________________________________________________
counterfactual_model (Functiona (None, 256)          1210048     input_1[0][0]                    
__________________________________________________________________________________________________
base_model (Functional)         [(None, 10), (None,  1146826     input_1[0][0]                    
                                                                 counterfactual_model[0][0]       
==================================================================================================
Total params: 1,212,618
Trainable params: 65,792
Non-trainable params: 1,146,826
__________________________________________________________________________________________________
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 0: 100%|#| 1875/1875 [00:26<00:00, 71.99it/s, acc=0.945, loss=[0.54084486, 0.73843914, -0.17429826, 0.0, 27.54991
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 1: 100%|#| 1875/1875 [00:22<00:00, 83.06it/s, acc=0.98, loss=[0.34756267, 0.44722092, -0.18280365, 0.0, 16.0009, 
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 2: 100%|#| 1875/1875 [00:21<00:00, 86.55it/s, acc=0.983, loss=[0.33255208, 0.4225461, -0.18923414, 0.0, 14.995633
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 3: 100%|#| 1875/1875 [00:21<00:00, 86.50it/s, acc=0.983, loss=[0.32777235, 0.40659294, -0.19184366, 0.0, 14.41306
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 4: 100%|#| 1875/1875 [00:22<00:00, 84.92it/s, acc=0.984, loss=[0.32305053, 0.39722815, -0.19365431, 0.0, 14.0738,
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 5: 100%|#| 1875/1875 [00:24<00:00, 76.15it/s, acc=0.985, loss=[0.31861863, 0.38918912, -0.19459148, 0.0, 13.80968
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 6: 100%|#| 1875/1875 [00:24<00:00, 76.27it/s, acc=0.985, loss=[0.3140887, 0.38356647, -0.19572073, 0.0, 13.64985,
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 7: 100%|#| 1875/1875 [00:22<00:00, 82.67it/s, acc=0.986, loss=[0.31032926, 0.37748575, -0.19670348, 0.0, 13.46468
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 8: 100%|#| 1875/1875 [00:22<00:00, 83.09it/s, acc=0.986, loss=[0.30592683, 0.37432832, -0.19781692, 0.0, 13.3604,
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 9: 100%|#| 1875/1875 [00:22<00:00, 82.61it/s, acc=0.987, loss=[0.30204004, 0.37165695, -0.19868164, 0.0, 13.27841
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 10: 100%|#| 1875/1875 [00:22<00:00, 82.87it/s, acc=0.987, loss=[0.29876396, 0.36910543, -0.19929318, 0.0, 13.1999
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 11: 100%|#| 1875/1875 [00:22<00:00, 82.85it/s, acc=0.987, loss=[0.29582822, 0.3667282, -0.19995685, 0.0, 13.13008
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 12: 100%|#| 1875/1875 [00:22<00:00, 82.73it/s, acc=0.988, loss=[0.29354018, 0.36394063, -0.20035213, 0.0, 13.0468
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 13: 100%|#| 1875/1875 [00:22<00:00, 82.62it/s, acc=0.988, loss=[0.29111922, 0.3614242, -0.2008463, 0.0, 12.9802, 
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 14: 100%|#| 1875/1875 [00:22<00:00, 82.75it/s, acc=0.988, loss=[0.28892642, 0.35791647, -0.20120007, 0.0, 12.9005
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 15: 100%|#| 1875/1875 [00:23<00:00, 78.93it/s, acc=0.989, loss=[0.28760272, 0.35107893, -0.2015606, 0.0, 12.72936
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 16: 100%|#| 1875/1875 [00:22<00:00, 82.98it/s, acc=0.99, loss=[0.28321925, 0.34779978, -0.20244737, 0.0, 12.65181
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 17: 100%|#| 1875/1875 [00:22<00:00, 83.03it/s, acc=0.99, loss=[0.27875742, 0.34645274, -0.2037825, 0.0, 12.631017
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 18: 100%|#| 1875/1875 [00:22<00:00, 82.55it/s, acc=0.992, loss=[0.27399147, 0.34496894, -0.20541893, 0.0, 12.5958
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 19: 100%|#| 1875/1875 [00:22<00:00, 83.00it/s, acc=0.992, loss=[0.2706986, 0.3425888, -0.20556954, 0.0, 12.522634
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 20: 100%|#| 1875/1875 [00:22<00:00, 82.54it/s, acc=0.993, loss=[0.2665847, 0.34150308, -0.20599508, 0.0, 12.49608
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 21: 100%|#| 1875/1875 [00:22<00:00, 82.90it/s, acc=0.993, loss=[0.26191312, 0.34043643, -0.20653108, 0.0, 12.4693
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 22: 100%|#| 1875/1875 [00:22<00:00, 82.44it/s, acc=0.993, loss=[0.25917467, 0.33873022, -0.20705122, 0.0, 12.4130
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 23: 100%|#| 1875/1875 [00:22<00:00, 82.55it/s, acc=0.993, loss=[0.25653863, 0.33734244, -0.2075429, 0.0, 12.37366
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 24: 100%|#| 1875/1875 [00:23<00:00, 79.82it/s, acc=0.994, loss=[0.2542097, 0.3356904, -0.20787457, 0.0, 12.324616
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 25: 100%|#| 1875/1875 [00:22<00:00, 82.79it/s, acc=0.994, loss=[0.2519256, 0.33445522, -0.208325, 0.0, 12.287483,
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 26: 100%|#| 1875/1875 [00:23<00:00, 80.78it/s, acc=0.994, loss=[0.24988618, 0.33321363, -0.20862468, 0.0, 12.2491
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 27: 100%|#| 1875/1875 [00:22<00:00, 82.69it/s, acc=0.994, loss=[0.24795204, 0.33211568, -0.20903805, 0.0, 12.2130
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 28: 100%|#| 1875/1875 [00:22<00:00, 82.64it/s, acc=0.994, loss=[0.2459251, 0.33130032, -0.20939244, 0.0, 12.19335
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 29: 100%|#| 1875/1875 [00:22<00:00, 82.46it/s, acc=0.994, loss=[0.24428257, 0.3302939, -0.20982644, 0.0, 12.16178
