
 Namespace(filter_visualization=True, user_evaluation=False, train_counterfactual_net=True, train_all_classes=True, dropout=False, train_singular_counterfactual_net=False, choose_subclass=False, counterfactual_PP=True, resume_counterfactual_net=False, resume_from_epoch=10, test_counterfactual_net=False, load_counterfactual_net=True, resume=True, alter_class=2, analysis_class=6, find_global_filters=False, cfe_epochs=30, l1_weight=1, save_logFile=True, augmentation=True, dataset='fmnist', save_directory='./trained_weights/', train_using_builtin_fit_method=True, train=False, fine_tune=False, test=True, model='customCNN/', imagenet_weights=False) 

Model: "base_model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 28, 28, 1)]  0                                            
__________________________________________________________________________________________________
conv2d (Conv2D)                 (None, 28, 28, 64)   640         input_1[0][0]                    
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 28, 28, 64)   36928       conv2d[0][0]                     
__________________________________________________________________________________________________
max_pooling2d (MaxPooling2D)    (None, 14, 14, 64)   0           conv2d_1[0][0]                   
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 14, 14, 128)  73856       max_pooling2d[0][0]              
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (None, 14, 14, 128)  147584      conv2d_2[0][0]                   
__________________________________________________________________________________________________
max_pooling2d_1 (MaxPooling2D)  (None, 7, 7, 128)    0           conv2d_3[0][0]                   
__________________________________________________________________________________________________
conv2d_4 (Conv2D)               (None, 7, 7, 256)    295168      max_pooling2d_1[0][0]            
__________________________________________________________________________________________________
conv2d_5 (Conv2D)               (None, 7, 7, 256)    590080      conv2d_4[0][0]                   
__________________________________________________________________________________________________
maxpool2 (MaxPooling2D)         (None, 3, 3, 256)    0           conv2d_5[0][0]                   
__________________________________________________________________________________________________
global_average_pooling2d (Globa (None, 256)          0           maxpool2[0][0]                   
__________________________________________________________________________________________________
fmatrix (InputLayer)            [(None, 256)]        0                                            
__________________________________________________________________________________________________
tf.math.multiply (TFOpLambda)   (None, 256)          0           global_average_pooling2d[0][0]   
                                                                 fmatrix[0][0]                    
__________________________________________________________________________________________________
dense (Dense)                   (None, 10)           2570        tf.math.multiply[0][0]           
__________________________________________________________________________________________________
activation (Activation)         (None, 10)           0           dense[0][0]                      
==================================================================================================
Total params: 1,146,826
Trainable params: 1,146,826
Non-trainable params: 0
__________________________________________________________________________________________________
weights loaded
Model: "counterfactual_model"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 28, 28, 1)]       0         
_________________________________________________________________
conv2d (Conv2D)              (None, 28, 28, 64)        640       
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 28, 28, 64)        36928     
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 14, 14, 64)        0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 14, 14, 128)       73856     
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 14, 14, 128)       147584    
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 7, 7, 128)         0         
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 7, 7, 256)         295168    
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 7, 7, 256)         590080    
_________________________________________________________________
maxpool2 (MaxPooling2D)      (None, 3, 3, 256)         0         
_________________________________________________________________
global_average_pooling2d_1 ( (None, 256)               0         
_________________________________________________________________
dense_1 (Dense)              (None, 256)               65792     
_________________________________________________________________
thresholded_re_lu (Threshold (None, 256)               0         
=================================================================
Total params: 1,210,048
Trainable params: 65,792
Non-trainable params: 1,144,256
_________________________________________________________________
threshold:  0.5
l1 weight:  1
training CF model for alter class:  2
Training CF model for PPs
training for fixed alter class:  2
Model: "model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 28, 28, 1)]  0                                            
__________________________________________________________________________________________________
counterfactual_model (Functiona (None, 256)          1210048     input_1[0][0]                    
__________________________________________________________________________________________________
base_model (Functional)         [(None, 10), (None,  1146826     input_1[0][0]                    
                                                                 counterfactual_model[0][0]       
==================================================================================================
Total params: 1,212,618
Trainable params: 65,792
Non-trainable params: 1,146,826
__________________________________________________________________________________________________
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 0: 100%|#| 1875/1875 [00:26<00:00, 70.82it/s, acc=0.956, loss=[0.53283346, 0.70909727, -0.16937594, 0.0, 26.83491
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 1: 100%|#| 1875/1875 [00:23<00:00, 80.96it/s, acc=0.988, loss=[0.37054455, 0.3932349, -0.17552653, 0.0, 14.512533
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 2: 100%|#| 1875/1875 [00:23<00:00, 80.94it/s, acc=0.99, loss=[0.35317174, 0.37480447, -0.184633, 0.0, 13.619433, 
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 3: 100%|#| 1875/1875 [00:23<00:00, 80.79it/s, acc=0.991, loss=[0.33911863, 0.36843607, -0.18975146, 0.0, 13.29756
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 4: 100%|#| 1875/1875 [00:23<00:00, 80.82it/s, acc=0.991, loss=[0.3326342, 0.36242324, -0.19386083, 0.0, 13.027, 0
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 5: 100%|#| 1875/1875 [00:23<00:00, 80.56it/s, acc=0.992, loss=[0.32583302, 0.35829937, -0.19638897, 0.0, 12.86188
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 6: 100%|#| 1875/1875 [00:23<00:00, 80.51it/s, acc=0.992, loss=[0.3153453, 0.35589594, -0.2016561, 0.0, 12.762167,
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 7: 100%|#| 1875/1875 [00:23<00:00, 80.09it/s, acc=0.993, loss=[0.3105139, 0.3516303, -0.20348717, 0.0, 12.59685, 
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 8: 100%|#| 1875/1875 [00:23<00:00, 80.56it/s, acc=0.993, loss=[0.3064258, 0.3487314, -0.20440064, 0.0, 12.490017,
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 9: 100%|#| 1875/1875 [00:23<00:00, 80.87it/s, acc=0.993, loss=[0.30275178, 0.34604633, -0.20502122, 0.0, 12.3984,
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 10: 100%|#| 1875/1875 [00:23<00:00, 80.64it/s, acc=0.994, loss=[0.29875225, 0.34448814, -0.20607004, 0.0, 12.3517
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 11: 100%|#| 1875/1875 [00:23<00:00, 80.99it/s, acc=0.994, loss=[0.29458955, 0.34396508, -0.20778072, 0.0, 12.3393
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 12: 100%|#| 1875/1875 [00:23<00:00, 80.97it/s, acc=0.994, loss=[0.29206237, 0.34235194, -0.20920163, 0.0, 12.2922
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 13: 100%|#| 1875/1875 [00:23<00:00, 80.15it/s, acc=0.995, loss=[0.28988424, 0.33967787, -0.20970005, 0.0, 12.2243
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 14: 100%|#| 1875/1875 [00:23<00:00, 80.65it/s, acc=0.995, loss=[0.2874166, 0.3379652, -0.2103325, 0.0, 12.182034,
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 15: 100%|#| 1875/1875 [00:23<00:00, 80.83it/s, acc=0.995, loss=[0.28525004, 0.33649188, -0.21127261, 0.0, 12.1458
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 16: 100%|#| 1875/1875 [00:23<00:00, 81.00it/s, acc=0.995, loss=[0.28261885, 0.3356683, -0.2124335, 0.0, 12.132116
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 17: 100%|#| 1875/1875 [00:23<00:00, 80.92it/s, acc=0.996, loss=[0.28000578, 0.33494493, -0.21373713, 0.0, 12.1227
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 18: 100%|#| 1875/1875 [00:23<00:00, 80.68it/s, acc=0.996, loss=[0.27764076, 0.3339904, -0.21468481, 0.0, 12.10218
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 19: 100%|#| 1875/1875 [00:23<00:00, 80.78it/s, acc=0.996, loss=[0.27521753, 0.33336985, -0.21568327, 0.0, 12.0939
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 20: 100%|#| 1875/1875 [00:23<00:00, 80.59it/s, acc=0.996, loss=[0.27288333, 0.33287337, -0.21662089, 0.0, 12.0870
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 21: 100%|#| 1875/1875 [00:23<00:00, 80.66it/s, acc=0.996, loss=[0.2708186, 0.33206397, -0.21746232, 0.0, 12.07035
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 22: 100%|#| 1875/1875 [00:23<00:00, 81.08it/s, acc=0.996, loss=[0.26889062, 0.33127096, -0.2181601, 0.0, 12.05311
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 23: 100%|#| 1875/1875 [00:23<00:00, 81.43it/s, acc=0.996, loss=[0.26739177, 0.3299317, -0.21855655, 0.0, 12.01193
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 24: 100%|#| 1875/1875 [00:21<00:00, 85.52it/s, acc=0.996, loss=[0.26536915, 0.3293612, -0.21919303, 0.0, 12.0013,
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 25: 100%|#| 1875/1875 [00:23<00:00, 80.90it/s, acc=0.996, loss=[0.26359078, 0.32861617, -0.21977025, 0.0, 11.9824
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 26: 100%|#| 1875/1875 [00:24<00:00, 76.02it/s, acc=0.996, loss=[0.26175612, 0.32789433, -0.22024733, 0.0, 11.9654
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 27: 100%|#| 1875/1875 [00:23<00:00, 80.86it/s, acc=0.996, loss=[0.2602447, 0.32699934, -0.22066739, 0.0, 11.94101
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 28: 100%|#| 1875/1875 [00:23<00:00, 79.77it/s, acc=0.996, loss=[0.258479, 0.32640135, -0.2211296, 0.0, 11.9286, 0
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 29: 100%|#| 1875/1875 [00:23<00:00, 79.13it/s, acc=0.996, loss=[0.2569599, 0.32550308, -0.22148526, 0.0, 11.90575
