
 Namespace(filter_visualization=True, user_evaluation=False, train_counterfactual_net=True, train_all_classes=True, dropout=False, train_singular_counterfactual_net=False, choose_subclass=False, counterfactual_PP=False, resume_counterfactual_net=False, resume_from_epoch=10, test_counterfactual_net=False, load_counterfactual_net=True, resume=True, alter_class=7, analysis_class=6, find_global_filters=False, cfe_epochs=30, l1_weight=2, save_logFile=True, augmentation=True, dataset='fmnist', save_directory='./trained_weights/', train_using_builtin_fit_method=True, train=False, fine_tune=False, test=True, model='customCNN/', imagenet_weights=False) 

Model: "base_model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 28, 28, 1)]  0                                            
__________________________________________________________________________________________________
conv2d (Conv2D)                 (None, 28, 28, 64)   640         input_1[0][0]                    
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 28, 28, 64)   36928       conv2d[0][0]                     
__________________________________________________________________________________________________
max_pooling2d (MaxPooling2D)    (None, 14, 14, 64)   0           conv2d_1[0][0]                   
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 14, 14, 128)  73856       max_pooling2d[0][0]              
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (None, 14, 14, 128)  147584      conv2d_2[0][0]                   
__________________________________________________________________________________________________
max_pooling2d_1 (MaxPooling2D)  (None, 7, 7, 128)    0           conv2d_3[0][0]                   
__________________________________________________________________________________________________
conv2d_4 (Conv2D)               (None, 7, 7, 256)    295168      max_pooling2d_1[0][0]            
__________________________________________________________________________________________________
conv2d_5 (Conv2D)               (None, 7, 7, 256)    590080      conv2d_4[0][0]                   
__________________________________________________________________________________________________
maxpool2 (MaxPooling2D)         (None, 3, 3, 256)    0           conv2d_5[0][0]                   
__________________________________________________________________________________________________
global_average_pooling2d (Globa (None, 256)          0           maxpool2[0][0]                   
__________________________________________________________________________________________________
fmatrix (InputLayer)            [(None, 256)]        0                                            
__________________________________________________________________________________________________
tf.__operators__.add (TFOpLambd (None, 256)          0           global_average_pooling2d[0][0]   
                                                                 fmatrix[0][0]                    
__________________________________________________________________________________________________
dense (Dense)                   (None, 10)           2570        tf.__operators__.add[0][0]       
__________________________________________________________________________________________________
activation (Activation)         (None, 10)           0           dense[0][0]                      
==================================================================================================
Total params: 1,146,826
Trainable params: 1,146,826
Non-trainable params: 0
__________________________________________________________________________________________________
weights loaded
Model: "counterfactual_model"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 28, 28, 1)]       0         
_________________________________________________________________
conv2d (Conv2D)              (None, 28, 28, 64)        640       
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 28, 28, 64)        36928     
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 14, 14, 64)        0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 14, 14, 128)       73856     
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 14, 14, 128)       147584    
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 7, 7, 128)         0         
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 7, 7, 256)         295168    
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 7, 7, 256)         590080    
_________________________________________________________________
maxpool2 (MaxPooling2D)      (None, 3, 3, 256)         0         
_________________________________________________________________
global_average_pooling2d_1 ( (None, 256)               0         
_________________________________________________________________
dense_1 (Dense)              (None, 256)               65792     
=================================================================
Total params: 1,210,048
Trainable params: 65,792
Non-trainable params: 1,144,256
_________________________________________________________________
threshold:  0.5
l1 weight:  2
training CF model for alter class:  7
Training CF model for PNs
training for fixed alter class:  7
Model: "model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 28, 28, 1)]  0                                            
__________________________________________________________________________________________________
counterfactual_model (Functiona (None, 256)          1210048     input_1[0][0]                    
__________________________________________________________________________________________________
base_model (Functional)         [(None, 10), (None,  1146826     input_1[0][0]                    
                                                                 counterfactual_model[0][0]       
==================================================================================================
Total params: 1,212,618
Trainable params: 65,792
Non-trainable params: 1,146,826
__________________________________________________________________________________________________
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 0: 100%|#| 1875/1875 [00:24<00:00, 76.93it/s, acc=0.924, loss=[0.45024046, 0.0, -0.13920085, 0.0, 24.774282, 6.54
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 1: 100%|#| 1875/1875 [00:21<00:00, 87.50it/s, acc=0.962, loss=[0.13560052, 0.0, -0.06991826, 0.0, 15.18425, 6.097
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 2: 100%|#| 1875/1875 [00:21<00:00, 85.99it/s, acc=0.974, loss=[0.12364373, 0.0, -0.054790005, 0.0, 13.273617, 5.9
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 3: 100%|#| 1875/1875 [00:21<00:00, 86.29it/s, acc=0.979, loss=[0.11870921, 0.0, -0.044782333, 0.0, 12.24015, 5.79
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 4: 100%|#| 1875/1875 [00:21<00:00, 86.35it/s, acc=0.982, loss=[0.11568674, 0.0, -0.037886515, 0.0, 11.5618, 5.715
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 5: 100%|#| 1875/1875 [00:21<00:00, 86.31it/s, acc=0.984, loss=[0.11426311, 0.0, -0.032511096, 0.0, 11.017183, 5.6
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 6: 100%|#| 1875/1875 [00:21<00:00, 86.38it/s, acc=0.986, loss=[0.1130927, 0.0, -0.028107436, 0.0, 10.62695, 5.616
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 7: 100%|#| 1875/1875 [00:21<00:00, 86.03it/s, acc=0.987, loss=[0.11211561, 0.0, -0.024880351, 0.0, 10.31095, 5.58
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 8: 100%|#| 1875/1875 [00:21<00:00, 86.25it/s, acc=0.988, loss=[0.111499235, 0.0, -0.022380922, 0.0, 10.0477, 5.55
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 9: 100%|#| 1875/1875 [00:21<00:00, 85.91it/s, acc=0.988, loss=[0.1110558, 0.0, -0.020880446, 0.0, 9.829717, 5.529
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 10: 100%|#| 1875/1875 [00:21<00:00, 85.84it/s, acc=0.989, loss=[0.11052197, 0.0, -0.019256538, 0.0, 9.668433, 5.5
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 11: 100%|#| 1875/1875 [00:21<00:00, 86.07it/s, acc=0.99, loss=[0.110271215, 0.0, -0.018677741, 0.0, 9.508284, 5.4
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 12: 100%|#| 1875/1875 [00:21<00:00, 86.14it/s, acc=0.99, loss=[0.109807074, 0.0, -0.01802405, 0.0, 9.378866, 5.47
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 13: 100%|#| 1875/1875 [00:21<00:00, 86.34it/s, acc=0.99, loss=[0.10955814, 0.0, -0.017504247, 0.0, 9.255433, 5.46
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 14: 100%|#| 1875/1875 [00:21<00:00, 86.55it/s, acc=0.991, loss=[0.10894063, 0.0, -0.017234957, 0.0, 9.1525, 5.451
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 15: 100%|#| 1875/1875 [00:21<00:00, 86.32it/s, acc=0.991, loss=[0.10874856, 0.0, -0.016752146, 0.0, 9.0654, 5.440
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 16: 100%|#| 1875/1875 [00:21<00:00, 86.05it/s, acc=0.992, loss=[0.108601645, 0.0, -0.016359596, 0.0, 8.9644165, 5
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 17: 100%|#| 1875/1875 [00:21<00:00, 86.18it/s, acc=0.992, loss=[0.10829243, 0.0, -0.016182523, 0.0, 8.88455, 5.42
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 18: 100%|#| 1875/1875 [00:21<00:00, 85.67it/s, acc=0.992, loss=[0.10814838, 0.0, -0.015706465, 0.0, 8.8166, 5.413
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 19: 100%|#| 1875/1875 [00:21<00:00, 85.31it/s, acc=0.992, loss=[0.10795502, 0.0, -0.015465162, 0.0, 8.7393, 5.406
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 20: 100%|#| 1875/1875 [00:21<00:00, 86.00it/s, acc=0.993, loss=[0.10762651, 0.0, -0.01521587, 0.0, 8.674383, 5.39
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 21: 100%|#| 1875/1875 [00:21<00:00, 85.76it/s, acc=0.993, loss=[0.10762455, 0.0, -0.014993893, 0.0, 8.609467, 5.3
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 22: 100%|#| 1875/1875 [00:21<00:00, 85.37it/s, acc=0.993, loss=[0.1074265, 0.0, -0.014812049, 0.0, 8.547916, 5.38
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 23: 100%|#| 1875/1875 [00:21<00:00, 85.81it/s, acc=0.993, loss=[0.10728723, 0.0, -0.01453726, 0.0, 8.498983, 5.38
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 24: 100%|#| 1875/1875 [00:21<00:00, 85.58it/s, acc=0.993, loss=[0.107162066, 0.0, -0.014456817, 0.0, 8.43365, 5.3
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 25: 100%|#| 1875/1875 [00:21<00:00, 85.81it/s, acc=0.993, loss=[0.10709682, 0.0, -0.014432244, 0.0, 8.38745, 5.37
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 26: 100%|#| 1875/1875 [00:21<00:00, 85.74it/s, acc=0.993, loss=[0.10680655, 0.0, -0.014307393, 0.0, 8.339467, 5.3
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 27: 100%|#| 1875/1875 [00:21<00:00, 86.07it/s, acc=0.993, loss=[0.10685059, 0.0, -0.014093488, 0.0, 8.3016, 5.362
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 28: 100%|#| 1875/1875 [00:21<00:00, 86.05it/s, acc=0.994, loss=[0.10648517, 0.0, -0.014126328, 0.0, 8.260983, 5.3
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 29: 100%|#| 1875/1875 [00:21<00:00, 86.26it/s, acc=0.994, loss=[0.106587134, 0.0, -0.01392387, 0.0, 8.232583, 5.3
