
 Namespace(filter_visualization=True, user_evaluation=False, train_counterfactual_net=True, train_all_classes=True, dropout=False, train_singular_counterfactual_net=False, choose_subclass=False, counterfactual_PP=True, resume_counterfactual_net=False, resume_from_epoch=10, test_counterfactual_net=False, load_counterfactual_net=True, resume=True, alter_class=8, analysis_class=6, find_global_filters=False, cfe_epochs=30, l1_weight=1, save_logFile=True, augmentation=True, dataset='fmnist', save_directory='./trained_weights/', train_using_builtin_fit_method=True, train=False, fine_tune=False, test=True, model='customCNN/', imagenet_weights=False) 

Model: "base_model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 28, 28, 1)]  0                                            
__________________________________________________________________________________________________
conv2d (Conv2D)                 (None, 28, 28, 64)   640         input_1[0][0]                    
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 28, 28, 64)   36928       conv2d[0][0]                     
__________________________________________________________________________________________________
max_pooling2d (MaxPooling2D)    (None, 14, 14, 64)   0           conv2d_1[0][0]                   
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 14, 14, 128)  73856       max_pooling2d[0][0]              
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (None, 14, 14, 128)  147584      conv2d_2[0][0]                   
__________________________________________________________________________________________________
max_pooling2d_1 (MaxPooling2D)  (None, 7, 7, 128)    0           conv2d_3[0][0]                   
__________________________________________________________________________________________________
conv2d_4 (Conv2D)               (None, 7, 7, 256)    295168      max_pooling2d_1[0][0]            
__________________________________________________________________________________________________
conv2d_5 (Conv2D)               (None, 7, 7, 256)    590080      conv2d_4[0][0]                   
__________________________________________________________________________________________________
maxpool2 (MaxPooling2D)         (None, 3, 3, 256)    0           conv2d_5[0][0]                   
__________________________________________________________________________________________________
global_average_pooling2d (Globa (None, 256)          0           maxpool2[0][0]                   
__________________________________________________________________________________________________
fmatrix (InputLayer)            [(None, 256)]        0                                            
__________________________________________________________________________________________________
tf.math.multiply (TFOpLambda)   (None, 256)          0           global_average_pooling2d[0][0]   
                                                                 fmatrix[0][0]                    
__________________________________________________________________________________________________
dense (Dense)                   (None, 10)           2570        tf.math.multiply[0][0]           
__________________________________________________________________________________________________
activation (Activation)         (None, 10)           0           dense[0][0]                      
==================================================================================================
Total params: 1,146,826
Trainable params: 1,146,826
Non-trainable params: 0
__________________________________________________________________________________________________
weights loaded
Model: "counterfactual_model"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 28, 28, 1)]       0         
_________________________________________________________________
conv2d (Conv2D)              (None, 28, 28, 64)        640       
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 28, 28, 64)        36928     
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 14, 14, 64)        0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 14, 14, 128)       73856     
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 14, 14, 128)       147584    
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 7, 7, 128)         0         
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 7, 7, 256)         295168    
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 7, 7, 256)         590080    
_________________________________________________________________
maxpool2 (MaxPooling2D)      (None, 3, 3, 256)         0         
_________________________________________________________________
global_average_pooling2d_1 ( (None, 256)               0         
_________________________________________________________________
dense_1 (Dense)              (None, 256)               65792     
_________________________________________________________________
thresholded_re_lu (Threshold (None, 256)               0         
=================================================================
Total params: 1,210,048
Trainable params: 65,792
Non-trainable params: 1,144,256
_________________________________________________________________
threshold:  0.5
l1 weight:  1
training CF model for alter class:  8
Training CF model for PPs
training for fixed alter class:  8
Model: "model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 28, 28, 1)]  0                                            
__________________________________________________________________________________________________
counterfactual_model (Functiona (None, 256)          1210048     input_1[0][0]                    
__________________________________________________________________________________________________
base_model (Functional)         [(None, 10), (None,  1146826     input_1[0][0]                    
                                                                 counterfactual_model[0][0]       
==================================================================================================
Total params: 1,212,618
Trainable params: 65,792
Non-trainable params: 1,146,826
__________________________________________________________________________________________________
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 0: 100%|#| 1875/1875 [00:24<00:00, 76.27it/s, acc=0.972, loss=[0.42297933, 0.7667192, -0.21298814, 0.0, 28.6333, 
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 1: 100%|#| 1875/1875 [00:21<00:00, 87.42it/s, acc=0.999, loss=[0.2527567, 0.46054864, -0.21702035, 0.0, 16.665016
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 2: 100%|#| 1875/1875 [00:21<00:00, 87.40it/s, acc=0.999, loss=[0.2394314, 0.43168724, -0.22214693, 0.0, 15.4385, 
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 3: 100%|#| 1875/1875 [00:21<00:00, 86.56it/s, acc=0.999, loss=[0.23124646, 0.41593564, -0.22555803, 0.0, 14.82265
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 4: 100%|#| 1875/1875 [00:21<00:00, 85.25it/s, acc=1, loss=[0.2247062, 0.40701786, -0.23295027, 0.0, 14.500816, 0.
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 5: 100%|#| 1875/1875 [00:21<00:00, 86.78it/s, acc=1, loss=[0.22015436, 0.3986709, -0.23643136, 0.0, 14.234667, 0.
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 6: 100%|#| 1875/1875 [00:21<00:00, 87.23it/s, acc=1, loss=[0.21628432, 0.39240932, -0.23903248, 0.0, 14.02495, 0.
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 7: 100%|#| 1875/1875 [00:21<00:00, 87.23it/s, acc=1, loss=[0.21296254, 0.3881177, -0.24220191, 0.0, 13.887134, 0.
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 8: 100%|#| 1875/1875 [00:21<00:00, 87.28it/s, acc=1, loss=[0.20890547, 0.38416103, -0.24716845, 0.0, 13.7954, 0.0
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 9: 100%|#| 1875/1875 [00:21<00:00, 87.26it/s, acc=1, loss=[0.20359656, 0.3796398, -0.25447506, 0.0, 13.664267, 0.
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 10: 100%|#| 1875/1875 [00:21<00:00, 87.07it/s, acc=1, loss=[0.20085907, 0.37406415, -0.25633442, 0.0, 13.489683, 
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 11: 100%|#| 1875/1875 [00:21<00:00, 86.94it/s, acc=1, loss=[0.19829863, 0.37024093, -0.25746948, 0.0, 13.372117, 
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 12: 100%|#| 1875/1875 [00:21<00:00, 86.92it/s, acc=1, loss=[0.1954124, 0.3672217, -0.25856617, 0.0, 13.28725, 0.0
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 13: 100%|#| 1875/1875 [00:21<00:00, 86.02it/s, acc=1, loss=[0.19280367, 0.36442646, -0.25959703, 0.0, 13.208817, 
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 14: 100%|#| 1875/1875 [00:21<00:00, 85.70it/s, acc=1, loss=[0.19033204, 0.36227572, -0.26098388, 0.0, 13.150084, 
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 15: 100%|#| 1875/1875 [00:22<00:00, 84.95it/s, acc=1, loss=[0.1878118, 0.36001295, -0.26191837, 0.0, 13.086367, 0
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 16: 100%|#| 1875/1875 [00:21<00:00, 87.17it/s, acc=1, loss=[0.18555468, 0.3579527, -0.26283765, 0.0, 13.027667, 0
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 17: 100%|#| 1875/1875 [00:21<00:00, 87.28it/s, acc=1, loss=[0.18322323, 0.35633492, -0.26371425, 0.0, 12.985267, 
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 18: 100%|#| 1875/1875 [00:21<00:00, 86.63it/s, acc=1, loss=[0.18129458, 0.35459563, -0.26482224, 0.0, 12.92995, 0
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 19: 100%|#| 1875/1875 [00:21<00:00, 87.14it/s, acc=1, loss=[0.17934667, 0.35338643, -0.2664667, 0.0, 12.9026165, 
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 20: 100%|#| 1875/1875 [00:21<00:00, 87.36it/s, acc=1, loss=[0.17723227, 0.35225555, -0.26838797, 0.0, 12.881, 0.0
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 21: 100%|#| 1875/1875 [00:21<00:00, 87.36it/s, acc=1, loss=[0.17529906, 0.35128835, -0.26974827, 0.0, 12.85, 0.0]
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 22: 100%|#| 1875/1875 [00:21<00:00, 87.17it/s, acc=1, loss=[0.17349441, 0.35005525, -0.27067512, 0.0, 12.809867, 
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 23: 100%|#| 1875/1875 [00:21<00:00, 87.39it/s, acc=1, loss=[0.17148475, 0.34915093, -0.2715017, 0.0, 12.782267, 0
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 24: 100%|#| 1875/1875 [00:21<00:00, 87.42it/s, acc=1, loss=[0.16943811, 0.34843913, -0.27245712, 0.0, 12.762584, 
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 25: 100%|#| 1875/1875 [00:21<00:00, 86.95it/s, acc=1, loss=[0.16701141, 0.34793815, -0.2733233, 0.0, 12.75355, 0.
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 26: 100%|#| 1875/1875 [00:21<00:00, 87.28it/s, acc=1, loss=[0.164962, 0.34719488, -0.27391967, 0.0, 12.734183, 0.
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 27: 100%|#| 1875/1875 [00:21<00:00, 87.29it/s, acc=1, loss=[0.16324116, 0.34623697, -0.27438864, 0.0, 12.7062, 0.
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 28: 100%|#| 1875/1875 [00:21<00:00, 87.05it/s, acc=1, loss=[0.16168909, 0.34529835, -0.27479398, 0.0, 12.6738, 0.
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 29: 100%|#| 1875/1875 [00:21<00:00, 87.51it/s, acc=1, loss=[0.16028418, 0.3443932, -0.27520147, 0.0, 12.647, 0.0]
