
 Namespace(filter_visualization=True, user_evaluation=False, train_counterfactual_net=True, train_all_classes=True, dropout=False, train_singular_counterfactual_net=False, choose_subclass=False, counterfactual_PP=False, resume_counterfactual_net=False, resume_from_epoch=10, test_counterfactual_net=False, load_counterfactual_net=True, resume=True, alter_class=0, analysis_class=6, find_global_filters=False, cfe_epochs=30, l1_weight=2, save_logFile=True, augmentation=True, dataset='fmnist', save_directory='./trained_weights/', train_using_builtin_fit_method=True, train=False, fine_tune=False, test=True, model='customCNN/', imagenet_weights=False) 

Model: "base_model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 28, 28, 1)]  0                                            
__________________________________________________________________________________________________
conv2d (Conv2D)                 (None, 28, 28, 64)   640         input_1[0][0]                    
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 28, 28, 64)   36928       conv2d[0][0]                     
__________________________________________________________________________________________________
max_pooling2d (MaxPooling2D)    (None, 14, 14, 64)   0           conv2d_1[0][0]                   
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 14, 14, 128)  73856       max_pooling2d[0][0]              
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (None, 14, 14, 128)  147584      conv2d_2[0][0]                   
__________________________________________________________________________________________________
max_pooling2d_1 (MaxPooling2D)  (None, 7, 7, 128)    0           conv2d_3[0][0]                   
__________________________________________________________________________________________________
conv2d_4 (Conv2D)               (None, 7, 7, 256)    295168      max_pooling2d_1[0][0]            
__________________________________________________________________________________________________
conv2d_5 (Conv2D)               (None, 7, 7, 256)    590080      conv2d_4[0][0]                   
__________________________________________________________________________________________________
maxpool2 (MaxPooling2D)         (None, 3, 3, 256)    0           conv2d_5[0][0]                   
__________________________________________________________________________________________________
global_average_pooling2d (Globa (None, 256)          0           maxpool2[0][0]                   
__________________________________________________________________________________________________
fmatrix (InputLayer)            [(None, 256)]        0                                            
__________________________________________________________________________________________________
tf.__operators__.add (TFOpLambd (None, 256)          0           global_average_pooling2d[0][0]   
                                                                 fmatrix[0][0]                    
__________________________________________________________________________________________________
dense (Dense)                   (None, 10)           2570        tf.__operators__.add[0][0]       
__________________________________________________________________________________________________
activation (Activation)         (None, 10)           0           dense[0][0]                      
==================================================================================================
Total params: 1,146,826
Trainable params: 1,146,826
Non-trainable params: 0
__________________________________________________________________________________________________
weights loaded
Model: "counterfactual_model"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 28, 28, 1)]       0         
_________________________________________________________________
conv2d (Conv2D)              (None, 28, 28, 64)        640       
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 28, 28, 64)        36928     
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 14, 14, 64)        0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 14, 14, 128)       73856     
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 14, 14, 128)       147584    
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 7, 7, 128)         0         
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 7, 7, 256)         295168    
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 7, 7, 256)         590080    
_________________________________________________________________
maxpool2 (MaxPooling2D)      (None, 3, 3, 256)         0         
_________________________________________________________________
global_average_pooling2d_1 ( (None, 256)               0         
_________________________________________________________________
dense_1 (Dense)              (None, 256)               65792     
=================================================================
Total params: 1,210,048
Trainable params: 65,792
Non-trainable params: 1,144,256
_________________________________________________________________
threshold:  0.5
l1 weight:  2
training CF model for alter class:  0
Training CF model for PNs
training for fixed alter class:  0
Model: "model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 28, 28, 1)]  0                                            
__________________________________________________________________________________________________
counterfactual_model (Functiona (None, 256)          1210048     input_1[0][0]                    
__________________________________________________________________________________________________
base_model (Functional)         [(None, 10), (None,  1146826     input_1[0][0]                    
                                                                 counterfactual_model[0][0]       
==================================================================================================
Total params: 1,212,618
Trainable params: 65,792
Non-trainable params: 1,146,826
__________________________________________________________________________________________________
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 0: 100%|#| 1875/1875 [00:24<00:00, 76.86it/s, acc=0.936, loss=[0.28008914, 0.0, -0.29658732, 0.0, 20.744267, 4.63
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 1: 100%|#| 1875/1875 [00:20<00:00, 89.54it/s, acc=0.967, loss=[0.11582053, 0.0, -0.2355663, 0.0, 11.410067, 4.279
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 2: 100%|#| 1875/1875 [00:20<00:00, 90.78it/s, acc=0.976, loss=[0.104811385, 0.0, -0.21795306, 0.0, 9.733084, 4.12
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 3: 100%|#| 1875/1875 [00:20<00:00, 90.77it/s, acc=0.981, loss=[0.09978403, 0.0, -0.20816149, 0.0, 8.9031, 4.03705
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 4: 100%|#| 1875/1875 [00:20<00:00, 90.47it/s, acc=0.985, loss=[0.09659244, 0.0, -0.20213386, 0.0, 8.382334, 3.977
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 5: 100%|#| 1875/1875 [00:20<00:00, 91.08it/s, acc=0.987, loss=[0.09484521, 0.0, -0.19807899, 0.0, 8.012584, 3.935
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 6: 100%|#| 1875/1875 [00:20<00:00, 91.07it/s, acc=0.988, loss=[0.09341602, 0.0, -0.19513935, 0.0, 7.7557836, 3.90
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 7: 100%|#| 1875/1875 [00:20<00:00, 91.04it/s, acc=0.99, loss=[0.09229035, 0.0, -0.19267927, 0.0, 7.528333, 3.8768
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 8: 100%|#| 1875/1875 [00:20<00:00, 90.80it/s, acc=0.99, loss=[0.09131377, 0.0, -0.19077, 0.0, 7.3522, 3.8558898]]
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 9: 100%|#| 1875/1875 [00:20<00:00, 91.02it/s, acc=0.991, loss=[0.0906603, 0.0, -0.18947047, 0.0, 7.1921167, 3.838
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 10: 100%|#| 1875/1875 [00:20<00:00, 90.94it/s, acc=0.992, loss=[0.09014013, 0.0, -0.18834324, 0.0, 7.0562835, 3.8
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 11: 100%|#| 1875/1875 [00:20<00:00, 90.86it/s, acc=0.992, loss=[0.08947561, 0.0, -0.1875098, 0.0, 6.92005, 3.8106
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 12: 100%|#| 1875/1875 [00:20<00:00, 90.84it/s, acc=0.992, loss=[0.08932048, 0.0, -0.18645601, 0.0, 6.8100333, 3.7
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 13: 100%|#| 1875/1875 [00:20<00:00, 90.76it/s, acc=0.993, loss=[0.088680536, 0.0, -0.18606512, 0.0, 6.720383, 3.7
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 14: 100%|#| 1875/1875 [00:20<00:00, 89.53it/s, acc=0.993, loss=[0.08843247, 0.0, -0.18522498, 0.0, 6.6399665, 3.7
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 15: 100%|#| 1875/1875 [00:20<00:00, 89.49it/s, acc=0.993, loss=[0.088124186, 0.0, -0.18490323, 0.0, 6.55785, 3.77
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 16: 100%|#| 1875/1875 [00:21<00:00, 88.80it/s, acc=0.994, loss=[0.08780819, 0.0, -0.18454714, 0.0, 6.492883, 3.76
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 17: 100%|#| 1875/1875 [00:21<00:00, 89.14it/s, acc=0.994, loss=[0.08764189, 0.0, -0.1840998, 0.0, 6.431667, 3.759
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 18: 100%|#| 1875/1875 [00:21<00:00, 89.05it/s, acc=0.994, loss=[0.08741974, 0.0, -0.1836388, 0.0, 6.3774667, 3.75
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 19: 100%|#| 1875/1875 [00:20<00:00, 89.51it/s, acc=0.995, loss=[0.0871909, 0.0, -0.1833549, 0.0, 6.3257, 3.748285
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 20: 100%|#| 1875/1875 [00:20<00:00, 89.52it/s, acc=0.995, loss=[0.086934015, 0.0, -0.18281567, 0.0, 6.2804666, 3.
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 21: 100%|#| 1875/1875 [00:20<00:00, 89.42it/s, acc=0.995, loss=[0.086915195, 0.0, -0.18252824, 0.0, 6.231933, 3.7
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 22: 100%|#| 1875/1875 [00:20<00:00, 89.45it/s, acc=0.995, loss=[0.086723365, 0.0, -0.18228613, 0.0, 6.1942835, 3.
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 23: 100%|#| 1875/1875 [00:20<00:00, 89.32it/s, acc=0.995, loss=[0.08656826, 0.0, -0.1821214, 0.0, 6.15655, 3.7305
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 24: 100%|#| 1875/1875 [00:20<00:00, 89.39it/s, acc=0.995, loss=[0.086377166, 0.0, -0.18181631, 0.0, 6.1206164, 3.
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 25: 100%|#| 1875/1875 [00:20<00:00, 89.31it/s, acc=0.996, loss=[0.086320706, 0.0, -0.18137777, 0.0, 6.085533, 3.7
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 26: 100%|#| 1875/1875 [00:21<00:00, 89.17it/s, acc=0.996, loss=[0.086105436, 0.0, -0.18124564, 0.0, 6.044317, 3.7
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 27: 100%|#| 1875/1875 [00:20<00:00, 89.30it/s, acc=0.996, loss=[0.086146206, 0.0, -0.18114182, 0.0, 6.0145335, 3.
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 28: 100%|#| 1875/1875 [00:20<00:00, 89.33it/s, acc=0.996, loss=[0.08593866, 0.0, -0.18088445, 0.0, 5.9908834, 3.7
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 29: 100%|#| 1875/1875 [00:20<00:00, 89.33it/s, acc=0.996, loss=[0.085958965, 0.0, -0.18069094, 0.0, 5.9583836, 3.
