
 Namespace(alter_class=126, analysis_class=9, cfe_epochs=10, choose_subclass=False, counterfactual_PP=True, dataset='CUB200', filter_visualization=True, find_global_filters=False, fine_tune=False, imagenet_weights=True, l1_weight=2, load_counterfactual_net=True, model='VGG16/', resume=True, resume_counterfactual_net=True, resume_from_epoch=9, save_directory='/kaggle/working/trained_weights/', save_logFile=True, test=False, test_counterfactual_net=False, train=False, train_all_classes=True, train_counterfactual_net=True, train_singular_counterfactual_net=False, train_using_builtin_fit_method=True, user_evaluation=False) 

Model: "base_model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 224, 224, 3) 0                                            
__________________________________________________________________________________________________
block1_conv1 (Conv2D)           (None, 224, 224, 64) 1792        input_1[0][0]                    
__________________________________________________________________________________________________
block1_conv2 (Conv2D)           (None, 224, 224, 64) 36928       block1_conv1[0][0]               
__________________________________________________________________________________________________
block1_pool (MaxPooling2D)      (None, 112, 112, 64) 0           block1_conv2[0][0]               
__________________________________________________________________________________________________
block2_conv1 (Conv2D)           (None, 112, 112, 128 73856       block1_pool[0][0]                
__________________________________________________________________________________________________
block2_conv2 (Conv2D)           (None, 112, 112, 128 147584      block2_conv1[0][0]               
__________________________________________________________________________________________________
block2_pool (MaxPooling2D)      (None, 56, 56, 128)  0           block2_conv2[0][0]               
__________________________________________________________________________________________________
block3_conv1 (Conv2D)           (None, 56, 56, 256)  295168      block2_pool[0][0]                
__________________________________________________________________________________________________
block3_conv2 (Conv2D)           (None, 56, 56, 256)  590080      block3_conv1[0][0]               
__________________________________________________________________________________________________
block3_conv3 (Conv2D)           (None, 56, 56, 256)  590080      block3_conv2[0][0]               
__________________________________________________________________________________________________
block3_pool (MaxPooling2D)      (None, 28, 28, 256)  0           block3_conv3[0][0]               
__________________________________________________________________________________________________
block4_conv1 (Conv2D)           (None, 28, 28, 512)  1180160     block3_pool[0][0]                
__________________________________________________________________________________________________
block4_conv2 (Conv2D)           (None, 28, 28, 512)  2359808     block4_conv1[0][0]               
__________________________________________________________________________________________________
block4_conv3 (Conv2D)           (None, 28, 28, 512)  2359808     block4_conv2[0][0]               
__________________________________________________________________________________________________
block4_pool (MaxPooling2D)      (None, 14, 14, 512)  0           block4_conv3[0][0]               
__________________________________________________________________________________________________
block5_conv1 (Conv2D)           (None, 14, 14, 512)  2359808     block4_pool[0][0]                
__________________________________________________________________________________________________
block5_conv2 (Conv2D)           (None, 14, 14, 512)  2359808     block5_conv1[0][0]               
__________________________________________________________________________________________________
block5_conv3 (Conv2D)           (None, 14, 14, 512)  2359808     block5_conv2[0][0]               
__________________________________________________________________________________________________
max_pooling2d (MaxPooling2D)    (None, 7, 7, 512)    0           block5_conv3[0][0]               
__________________________________________________________________________________________________
global_average_pooling2d (Globa (None, 512)          0           max_pooling2d[0][0]              
__________________________________________________________________________________________________
fmatrix (InputLayer)            [(None, 512)]        0                                            
__________________________________________________________________________________________________
tf.math.multiply (TFOpLambda)   (None, 512)          0           global_average_pooling2d[0][0]   
                                                                 fmatrix[0][0]                    
__________________________________________________________________________________________________
dense (Dense)                   (None, 200)          102600      tf.math.multiply[0][0]           
__________________________________________________________________________________________________
activation (Activation)         (None, 200)          0           dense[0][0]                      
==================================================================================================
Total params: 14,817,288
Trainable params: 102,600
Non-trainable params: 14,714,688
__________________________________________________________________________________________________
weights loaded
threshold:  0.5
l1 weight:  2
training CF model for alter class:  127.Savannah_Sparrow
Training CF model for PPs
training for fixed alter class:  127.Savannah_Sparrow
Model: "model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 224, 224, 3) 0                                            
__________________________________________________________________________________________________
counterfactual_model (Functiona (None, 512)          14977344    input_1[0][0]                    
__________________________________________________________________________________________________
base_model (Functional)         [(None, 200), (None, 14817288    input_1[0][0]                    
                                                                 counterfactual_model[0][0]       
==================================================================================================
Total params: 15,079,944
Trainable params: 262,656
Non-trainable params: 14,817,288
__________________________________________________________________________________________________
  0%|          | 0/338 [00:00<?, ?it/s]epoch 9: 100%|██████████| 338/338 [02:15<00:00,  2.49it/s, acc=0.999, loss=[0.35268316, 0.8423805, -0.16307624, 0.0, 28.83321, 0.0]]
