save_path:  ./trained_weights/VGG16/BraTS/standard
resuming training

 Namespace(alter_class=0, alter_class_2=0, analysis_class=0, analyze_filter_importance=False, cfe_epochs=100, choose_subclass=False, counterfactual_PP=False, create_counterfactual_combined=True, dataset='BraTS', filter_category_method='own_reduce_loss', filter_modified_directly=True, filter_visualization=True, find_filter_class=False, find_global_filters=False, fine_tune=False, fixed_classes=True, fixed_classes_reduce_loss=True, full_standard=True, high_capacity_model=True, imagenet_weights=True, interpretable=False, l1_weight=2, load_counterfactual_net=True, loss_compute=True, model='VGG16/', resume=True, resume_counterfactual_net=False, save_directory='./trained_weights/', save_filter_fmap=False, save_filter_importance=False, save_logFile=True, save_path='./trained_weights/VGG16/BraTS/standard', save_top_layer=True, test=False, test_counterfactual_net=False, test_filter_importance=False, train=False, train_counterfactual_net=True, train_using_builtin_fit_method=True, visualize_fmaps=False) 

batch_size:  32
BraTS 2020 dataset
num classes: 2
using imagenet_weights
Found 33424 images belonging to 2 classes.
Found 3713 images belonging to 2 classes.
Found 33424 images belonging to 2 classes.
Found 3713 images belonging to 2 classes.
Found 9372 images belonging to 2 classes.
Found 9372 images belonging to 2 classes.
loading VGG model
using VGG16 imagenet weights for BraTS dataset
input_1
block1_conv1
block1_conv2
block1_pool
block2_conv1
block2_conv2
block2_pool
block3_conv1
block3_conv2
block3_conv3
block3_pool
block4_conv1
block4_conv2
block4_conv3
block4_pool
block5_conv1
block5_conv2
block5_conv3
block5_pool
block1_conv1 		 (None, 240, 240, 64)
block1_conv2 		 (None, 240, 240, 64)
block2_conv1 		 (None, 120, 120, 128)
block2_conv2 		 (None, 120, 120, 128)
block3_conv1 		 (None, 60, 60, 256)
block3_conv2 		 (None, 60, 60, 256)
block3_conv3 		 (None, 60, 60, 256)
block4_conv1 		 (None, 30, 30, 512)
block4_conv2 		 (None, 30, 30, 512)
block4_conv3 		 (None, 30, 30, 512)
block5_conv1 		 (None, 15, 15, 512)
block5_conv2 		 (None, 15, 15, 512)
block5_conv3 		 (None, 15, 15, 512)
total neurons:  4224
Model: "base_model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 240, 240, 3) 0                                            
__________________________________________________________________________________________________
block1_conv1 (Conv2D)           (None, 240, 240, 64) 1792        input_1[0][0]                    
__________________________________________________________________________________________________
block1_conv2 (Conv2D)           (None, 240, 240, 64) 36928       block1_conv1[0][0]               
__________________________________________________________________________________________________
block1_pool (MaxPooling2D)      (None, 120, 120, 64) 0           block1_conv2[0][0]               
__________________________________________________________________________________________________
block2_conv1 (Conv2D)           (None, 120, 120, 128 73856       block1_pool[0][0]                
__________________________________________________________________________________________________
block2_conv2 (Conv2D)           (None, 120, 120, 128 147584      block2_conv1[0][0]               
__________________________________________________________________________________________________
block2_pool (MaxPooling2D)      (None, 60, 60, 128)  0           block2_conv2[0][0]               
__________________________________________________________________________________________________
block3_conv1 (Conv2D)           (None, 60, 60, 256)  295168      block2_pool[0][0]                
__________________________________________________________________________________________________
block3_conv2 (Conv2D)           (None, 60, 60, 256)  590080      block3_conv1[0][0]               
__________________________________________________________________________________________________
block3_conv3 (Conv2D)           (None, 60, 60, 256)  590080      block3_conv2[0][0]               
__________________________________________________________________________________________________
block3_pool (MaxPooling2D)      (None, 30, 30, 256)  0           block3_conv3[0][0]               
__________________________________________________________________________________________________
block4_conv1 (Conv2D)           (None, 30, 30, 512)  1180160     block3_pool[0][0]                
__________________________________________________________________________________________________
block4_conv2 (Conv2D)           (None, 30, 30, 512)  2359808     block4_conv1[0][0]               
__________________________________________________________________________________________________
block4_conv3 (Conv2D)           (None, 30, 30, 512)  2359808     block4_conv2[0][0]               
__________________________________________________________________________________________________
block4_pool (MaxPooling2D)      (None, 15, 15, 512)  0           block4_conv3[0][0]               
__________________________________________________________________________________________________
block5_conv1 (Conv2D)           (None, 15, 15, 512)  2359808     block4_pool[0][0]                
__________________________________________________________________________________________________
block5_conv2 (Conv2D)           (None, 15, 15, 512)  2359808     block5_conv1[0][0]               
__________________________________________________________________________________________________
block5_conv3 (Conv2D)           (None, 15, 15, 512)  2359808     block5_conv2[0][0]               
__________________________________________________________________________________________________
max_pooling2d (MaxPooling2D)    (None, 7, 7, 512)    0           block5_conv3[0][0]               
__________________________________________________________________________________________________
global_average_pooling2d (Globa (None, 512)          0           max_pooling2d[0][0]              
__________________________________________________________________________________________________
input_2 (InputLayer)            [(None, 512)]        0                                            
__________________________________________________________________________________________________
tf.__operators__.add (TFOpLambd (None, 512)          0           global_average_pooling2d[0][0]   
                                                                 input_2[0][0]                    
__________________________________________________________________________________________________
dense (Dense)                   (None, 2)            1026        tf.__operators__.add[0][0]       
__________________________________________________________________________________________________
activation (Activation)         (None, 2)            0           dense[0][0]                      
==================================================================================================
Total params: 14,715,714
Trainable params: 1,026
Non-trainable params: 14,714,688
__________________________________________________________________________________________________
weights loaded
Model: "counterfactual_model"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 240, 240, 3)]     0         
_________________________________________________________________
block1_conv1 (Conv2D)        (None, 240, 240, 64)      1792      
_________________________________________________________________
block1_conv2 (Conv2D)        (None, 240, 240, 64)      36928     
_________________________________________________________________
block1_pool (MaxPooling2D)   (None, 120, 120, 64)      0         
_________________________________________________________________
block2_conv1 (Conv2D)        (None, 120, 120, 128)     73856     
_________________________________________________________________
block2_conv2 (Conv2D)        (None, 120, 120, 128)     147584    
_________________________________________________________________
block2_pool (MaxPooling2D)   (None, 60, 60, 128)       0         
_________________________________________________________________
block3_conv1 (Conv2D)        (None, 60, 60, 256)       295168    
_________________________________________________________________
block3_conv2 (Conv2D)        (None, 60, 60, 256)       590080    
_________________________________________________________________
block3_conv3 (Conv2D)        (None, 60, 60, 256)       590080    
_________________________________________________________________
block3_pool (MaxPooling2D)   (None, 30, 30, 256)       0         
_________________________________________________________________
block4_conv1 (Conv2D)        (None, 30, 30, 512)       1180160   
_________________________________________________________________
block4_conv2 (Conv2D)        (None, 30, 30, 512)       2359808   
_________________________________________________________________
block4_conv3 (Conv2D)        (None, 30, 30, 512)       2359808   
_________________________________________________________________
block4_pool (MaxPooling2D)   (None, 15, 15, 512)       0         
_________________________________________________________________
block5_conv1 (Conv2D)        (None, 15, 15, 512)       2359808   
_________________________________________________________________
block5_conv2 (Conv2D)        (None, 15, 15, 512)       2359808   
_________________________________________________________________
block5_conv3 (Conv2D)        (None, 15, 15, 512)       2359808   
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 7, 7, 512)         0         
_________________________________________________________________
global_average_pooling2d_1 ( (None, 512)               0         
_________________________________________________________________
dense_1 (Dense)              (None, 512)               262656    
=================================================================
Total params: 14,977,344
Trainable params: 262,656
Non-trainable params: 14,714,688
_________________________________________________________________
threshold:  0.5
l1 weight:  2
training CF model for alter class:  non_tumor
Training CF model for PNs
Model: "model_1"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_3 (InputLayer)            [(None, 240, 240, 3) 0                                            
__________________________________________________________________________________________________
counterfactual_model (Functiona (None, 512)          14977344    input_3[0][0]                    
__________________________________________________________________________________________________
base_model (Functional)         [(None, 2), (None, 1 14715714    input_3[0][0]                    
                                                                 counterfactual_model[0][0]       
==================================================================================================
Total params: 14,978,370
Trainable params: 262,656
Non-trainable params: 14,715,714
__________________________________________________________________________________________________
training for fixed alter class:  non_tumor
  0%|          | 0/1045 [00:00<?, ?it/s]epoch 0: 100%|##########| 1045/1045 [05:45<00:00,  3.02it/s, acc=0.983, loss=[0.21933487, 0.0, -0.02128453, 0.0, 13.92213, 3.3355083]]
  0%|          | 0/1045 [00:00<?, ?it/s]epoch 1: 100%|##########| 1045/1045 [05:33<00:00,  3.13it/s, acc=0.998, loss=[0.042943295, 0.0, 0.04869274, 0.0, 2.1912081, 3.0314167]]
  0%|          | 0/1045 [00:00<?, ?it/s]epoch 2: 100%|##########| 1045/1045 [05:35<00:00,  3.11it/s, acc=0.999, loss=[0.043217547, 0.0, 0.051417384, 0.0, 1.5374701, 2.924327]]
  0%|          | 0/1045 [00:00<?, ?it/s]epoch 3: 100%|##########| 1045/1045 [05:36<00:00,  3.10it/s, acc=1, loss=[0.043363992, 0.0, 0.052874446, 0.0, 1.223116, 2.8686721]]
  0%|          | 0/1045 [00:00<?, ?it/s]epoch 4: 100%|##########| 1045/1045 [05:35<00:00,  3.12it/s, acc=1, loss=[0.043535445, 0.0, 0.05380831, 0.0, 1.0525718, 2.8342779]]
  0%|          | 0/1045 [00:00<?, ?it/s]