
 Namespace(filter_visualization=True, user_evaluation=False, train_counterfactual_net=True, train_all_classes=True, dropout=False, train_singular_counterfactual_net=False, choose_subclass=False, counterfactual_PP=False, resume_counterfactual_net=False, resume_from_epoch=10, test_counterfactual_net=False, load_counterfactual_net=True, resume=True, alter_class=5, analysis_class=6, find_global_filters=False, cfe_epochs=10, l1_weight=0.1, save_logFile=True, augmentation=True, dataset='fmnist', save_directory='./trained_weights/', train_using_builtin_fit_method=True, train=False, fine_tune=False, test=True, model='customCNN/', imagenet_weights=False) 

Model: "base_model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 28, 28, 1)]  0                                            
__________________________________________________________________________________________________
conv2d (Conv2D)                 (None, 28, 28, 64)   640         input_1[0][0]                    
__________________________________________________________________________________________________
max_pooling2d (MaxPooling2D)    (None, 14, 14, 64)   0           conv2d[0][0]                     
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 14, 14, 64)   36928       max_pooling2d[0][0]              
__________________________________________________________________________________________________
max_pooling2d_1 (MaxPooling2D)  (None, 7, 7, 64)     0           conv2d_1[0][0]                   
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 7, 7, 64)     36928       max_pooling2d_1[0][0]            
__________________________________________________________________________________________________
max_pooling2d_2 (MaxPooling2D)  (None, 3, 3, 64)     0           conv2d_2[0][0]                   
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (None, 3, 3, 128)    73856       max_pooling2d_2[0][0]            
__________________________________________________________________________________________________
maxpool2 (MaxPooling2D)         (None, 1, 1, 128)    0           conv2d_3[0][0]                   
__________________________________________________________________________________________________
global_average_pooling2d (Globa (None, 128)          0           maxpool2[0][0]                   
__________________________________________________________________________________________________
fmatrix (InputLayer)            [(None, 128)]        0                                            
__________________________________________________________________________________________________
tf.__operators__.add (TFOpLambd (None, 128)          0           global_average_pooling2d[0][0]   
                                                                 fmatrix[0][0]                    
__________________________________________________________________________________________________
dense (Dense)                   (None, 10)           1290        tf.__operators__.add[0][0]       
__________________________________________________________________________________________________
activation (Activation)         (None, 10)           0           dense[0][0]                      
==================================================================================================
Total params: 149,642
Trainable params: 149,642
Non-trainable params: 0
__________________________________________________________________________________________________
weights loaded
Model: "counterfactual_model"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 28, 28, 1)]       0         
_________________________________________________________________
conv2d (Conv2D)              (None, 28, 28, 64)        640       
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 14, 14, 64)        0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 14, 14, 64)        36928     
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 7, 7, 64)          0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 7, 7, 64)          36928     
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 3, 3, 64)          0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 3, 3, 128)         73856     
_________________________________________________________________
maxpool2 (MaxPooling2D)      (None, 1, 1, 128)         0         
_________________________________________________________________
global_average_pooling2d_1 ( (None, 128)               0         
_________________________________________________________________
dense_1 (Dense)              (None, 128)               16512     
=================================================================
Total params: 164,864
Trainable params: 16,512
Non-trainable params: 148,352
_________________________________________________________________
threshold:  0.5
l1 weight:  0.1
training CF model for alter class:  5
Training CF model for PNs
training for fixed alter class:  5
Model: "model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 28, 28, 1)]  0                                            
__________________________________________________________________________________________________
counterfactual_model (Functiona (None, 128)          164864      input_1[0][0]                    
__________________________________________________________________________________________________
base_model (Functional)         [(None, 10), (None,  149642      input_1[0][0]                    
                                                                 counterfactual_model[0][0]       
==================================================================================================
Total params: 166,154
Trainable params: 16,512
Non-trainable params: 149,642
__________________________________________________________________________________________________
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 0: 100%|#| 1875/1875 [00:24<00:00, 78.07it/s, acc=0.97, loss=[0.36494792, 0.0, 0.38113222, 0.0, 19.76785, 2.72716
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 1: 100%|#| 1875/1875 [00:19<00:00, 96.08it/s, acc=0.997, loss=[0.057507336, 0.0, 0.3782055, 0.0, 11.309183, 2.476
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 2: 100%|#| 1875/1875 [00:21<00:00, 85.28it/s, acc=0.999, loss=[0.053706095, 0.0, 0.3695339, 0.0, 9.479083, 2.3688
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 3: 100%|#| 1875/1875 [00:23<00:00, 80.61it/s, acc=0.999, loss=[0.05216007, 0.0, 0.37070718, 0.0, 8.4776, 2.305822
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 4: 100%|#| 1875/1875 [00:19<00:00, 96.88it/s, acc=0.999, loss=[0.051432118, 0.0, 0.37592614, 0.0, 7.85325, 2.2632
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 5: 100%|#| 1875/1875 [00:27<00:00, 69.04it/s, acc=0.999, loss=[0.05094848, 0.0, 0.37854752, 0.0, 7.3987, 2.232057
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 6: 100%|##| 1875/1875 [00:24<00:00, 76.32it/s, acc=1, loss=[0.05058347, 0.0, 0.38043374, 0.0, 7.04505, 2.208096]]
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 7: 100%|##| 1875/1875 [00:27<00:00, 67.06it/s, acc=1, loss=[0.050211232, 0.0, 0.38168103, 0.0, 6.79275, 2.18905]]
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 8: 100%|###| 1875/1875 [00:28<00:00, 64.66it/s, acc=1, loss=[0.049987435, 0.0, 0.3824353, 0.0, 6.6034, 2.173523]]
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 9: 100%|#| 1875/1875 [00:28<00:00, 65.76it/s, acc=1, loss=[0.04961866, 0.0, 0.38274094, 0.0, 6.46345, 2.1606174]]
