
 Namespace(filter_visualization=True, user_evaluation=False, train_counterfactual_net=True, train_all_classes=True, dropout=False, train_singular_counterfactual_net=False, choose_subclass=False, counterfactual_PP=True, resume_counterfactual_net=False, resume_from_epoch=10, test_counterfactual_net=False, load_counterfactual_net=True, resume=True, alter_class=0, analysis_class=6, find_global_filters=False, cfe_epochs=10, l1_weight=0.1, save_logFile=True, augmentation=True, dataset='fmnist', save_directory='./trained_weights/', train_using_builtin_fit_method=True, train=False, fine_tune=False, test=True, model='customCNN/', imagenet_weights=False) 

Model: "base_model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 28, 28, 1)]  0                                            
__________________________________________________________________________________________________
conv2d (Conv2D)                 (None, 28, 28, 64)   640         input_1[0][0]                    
__________________________________________________________________________________________________
max_pooling2d (MaxPooling2D)    (None, 14, 14, 64)   0           conv2d[0][0]                     
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 14, 14, 64)   36928       max_pooling2d[0][0]              
__________________________________________________________________________________________________
max_pooling2d_1 (MaxPooling2D)  (None, 7, 7, 64)     0           conv2d_1[0][0]                   
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 7, 7, 64)     36928       max_pooling2d_1[0][0]            
__________________________________________________________________________________________________
max_pooling2d_2 (MaxPooling2D)  (None, 3, 3, 64)     0           conv2d_2[0][0]                   
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (None, 3, 3, 128)    73856       max_pooling2d_2[0][0]            
__________________________________________________________________________________________________
maxpool2 (MaxPooling2D)         (None, 1, 1, 128)    0           conv2d_3[0][0]                   
__________________________________________________________________________________________________
global_average_pooling2d (Globa (None, 128)          0           maxpool2[0][0]                   
__________________________________________________________________________________________________
fmatrix (InputLayer)            [(None, 128)]        0                                            
__________________________________________________________________________________________________
tf.math.multiply (TFOpLambda)   (None, 128)          0           global_average_pooling2d[0][0]   
                                                                 fmatrix[0][0]                    
__________________________________________________________________________________________________
dense (Dense)                   (None, 10)           1290        tf.math.multiply[0][0]           
__________________________________________________________________________________________________
activation (Activation)         (None, 10)           0           dense[0][0]                      
==================================================================================================
Total params: 149,642
Trainable params: 149,642
Non-trainable params: 0
__________________________________________________________________________________________________
weights loaded
Model: "counterfactual_model"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 28, 28, 1)]       0         
_________________________________________________________________
conv2d (Conv2D)              (None, 28, 28, 64)        640       
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 14, 14, 64)        0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 14, 14, 64)        36928     
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 7, 7, 64)          0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 7, 7, 64)          36928     
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 3, 3, 64)          0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 3, 3, 128)         73856     
_________________________________________________________________
maxpool2 (MaxPooling2D)      (None, 1, 1, 128)         0         
_________________________________________________________________
global_average_pooling2d_1 ( (None, 128)               0         
_________________________________________________________________
dense_1 (Dense)              (None, 128)               16512     
_________________________________________________________________
thresholded_re_lu (Threshold (None, 128)               0         
=================================================================
Total params: 164,864
Trainable params: 16,512
Non-trainable params: 148,352
_________________________________________________________________
threshold:  0.5
l1 weight:  0.1
training CF model for alter class:  0
Training CF model for PPs
training for fixed alter class:  0
Model: "model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 28, 28, 1)]  0                                            
__________________________________________________________________________________________________
counterfactual_model (Functiona (None, 128)          164864      input_1[0][0]                    
__________________________________________________________________________________________________
base_model (Functional)         [(None, 10), (None,  149642      input_1[0][0]                    
                                                                 counterfactual_model[0][0]       
==================================================================================================
Total params: 166,154
Trainable params: 16,512
Non-trainable params: 149,642
__________________________________________________________________________________________________
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 0: 100%|#| 1875/1875 [00:20<00:00, 90.24it/s, acc=0.735, loss=[0.8260885, 0.10451965, -0.10345187, 0.0, 41.463966
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 1: 100%|#| 1875/1875 [00:16<00:00, 110.75it/s, acc=0.901, loss=[0.49347028, 0.10645226, -0.13393651, 0.0, 40.1243
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 2: 100%|#| 1875/1875 [00:18<00:00, 101.41it/s, acc=0.92, loss=[0.46973798, 0.10402221, -0.13971812, 0.0, 38.31761
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 3: 100%|#| 1875/1875 [00:18<00:00, 100.60it/s, acc=0.925, loss=[0.4611212, 0.10173401, -0.14221175, 0.0, 36.96, 0
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 4: 100%|#| 1875/1875 [00:17<00:00, 105.02it/s, acc=0.928, loss=[0.4549457, 0.10033719, -0.14403954, 0.0, 36.0883,
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 5: 100%|#| 1875/1875 [00:17<00:00, 107.69it/s, acc=0.931, loss=[0.4509626, 0.09917416, -0.14526932, 0.0, 35.37801
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 6: 100%|#| 1875/1875 [00:17<00:00, 108.14it/s, acc=0.932, loss=[0.44817477, 0.09809636, -0.14607444, 0.0, 34.7523
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 7: 100%|#| 1875/1875 [00:19<00:00, 95.17it/s, acc=0.933, loss=[0.44580892, 0.0972069, -0.14659747, 0.0, 34.253033
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 8: 100%|#| 1875/1875 [00:16<00:00, 116.16it/s, acc=0.934, loss=[0.44388676, 0.09651341, -0.14716278, 0.0, 33.8725
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 9: 100%|#| 1875/1875 [00:18<00:00, 99.99it/s, acc=0.935, loss=[0.4421614, 0.09596608, -0.14776354, 0.0, 33.570034
