
 Namespace(filter_visualization=True, user_evaluation=False, train_counterfactual_net=True, train_all_classes=True, dropout=False, train_singular_counterfactual_net=False, choose_subclass=False, counterfactual_PP=True, resume_counterfactual_net=False, resume_from_epoch=10, test_counterfactual_net=False, load_counterfactual_net=True, resume=True, alter_class=6, analysis_class=6, find_global_filters=False, cfe_epochs=10, l1_weight=0.1, save_logFile=True, augmentation=True, dataset='fmnist', save_directory='./trained_weights/', train_using_builtin_fit_method=True, train=False, fine_tune=False, test=True, model='customCNN/', imagenet_weights=False) 

Model: "base_model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 28, 28, 1)]  0                                            
__________________________________________________________________________________________________
conv2d (Conv2D)                 (None, 28, 28, 64)   640         input_1[0][0]                    
__________________________________________________________________________________________________
max_pooling2d (MaxPooling2D)    (None, 14, 14, 64)   0           conv2d[0][0]                     
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 14, 14, 64)   36928       max_pooling2d[0][0]              
__________________________________________________________________________________________________
max_pooling2d_1 (MaxPooling2D)  (None, 7, 7, 64)     0           conv2d_1[0][0]                   
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 7, 7, 64)     36928       max_pooling2d_1[0][0]            
__________________________________________________________________________________________________
max_pooling2d_2 (MaxPooling2D)  (None, 3, 3, 64)     0           conv2d_2[0][0]                   
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (None, 3, 3, 128)    73856       max_pooling2d_2[0][0]            
__________________________________________________________________________________________________
maxpool2 (MaxPooling2D)         (None, 1, 1, 128)    0           conv2d_3[0][0]                   
__________________________________________________________________________________________________
global_average_pooling2d (Globa (None, 128)          0           maxpool2[0][0]                   
__________________________________________________________________________________________________
fmatrix (InputLayer)            [(None, 128)]        0                                            
__________________________________________________________________________________________________
tf.math.multiply (TFOpLambda)   (None, 128)          0           global_average_pooling2d[0][0]   
                                                                 fmatrix[0][0]                    
__________________________________________________________________________________________________
dense (Dense)                   (None, 10)           1290        tf.math.multiply[0][0]           
__________________________________________________________________________________________________
activation (Activation)         (None, 10)           0           dense[0][0]                      
==================================================================================================
Total params: 149,642
Trainable params: 149,642
Non-trainable params: 0
__________________________________________________________________________________________________
weights loaded
Model: "counterfactual_model"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 28, 28, 1)]       0         
_________________________________________________________________
conv2d (Conv2D)              (None, 28, 28, 64)        640       
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 14, 14, 64)        0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 14, 14, 64)        36928     
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 7, 7, 64)          0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 7, 7, 64)          36928     
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 3, 3, 64)          0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 3, 3, 128)         73856     
_________________________________________________________________
maxpool2 (MaxPooling2D)      (None, 1, 1, 128)         0         
_________________________________________________________________
global_average_pooling2d_1 ( (None, 128)               0         
_________________________________________________________________
dense_1 (Dense)              (None, 128)               16512     
_________________________________________________________________
thresholded_re_lu (Threshold (None, 128)               0         
=================================================================
Total params: 164,864
Trainable params: 16,512
Non-trainable params: 148,352
_________________________________________________________________
threshold:  0.5
l1 weight:  0.1
training CF model for alter class:  6
Training CF model for PPs
training for fixed alter class:  6
Model: "model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 28, 28, 1)]  0                                            
__________________________________________________________________________________________________
counterfactual_model (Functiona (None, 128)          164864      input_1[0][0]                    
__________________________________________________________________________________________________
base_model (Functional)         [(None, 10), (None,  149642      input_1[0][0]                    
                                                                 counterfactual_model[0][0]       
==================================================================================================
Total params: 166,154
Trainable params: 16,512
Non-trainable params: 149,642
__________________________________________________________________________________________________
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 0: 100%|#| 1875/1875 [00:33<00:00, 56.64it/s, acc=0.837, loss=[0.7317743, 0.10638526, -0.10338004, 0.0, 42.101482
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 1: 100%|#| 1875/1875 [00:25<00:00, 72.73it/s, acc=0.943, loss=[0.4920998, 0.104601964, -0.1226699, 0.0, 39.96165,
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 2: 100%|#| 1875/1875 [00:27<00:00, 68.11it/s, acc=0.952, loss=[0.46827227, 0.10331747, -0.12760267, 0.0, 38.7552,
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 3: 100%|#| 1875/1875 [00:25<00:00, 73.71it/s, acc=0.959, loss=[0.4558648, 0.10158659, -0.13034017, 0.0, 37.590416
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 4: 100%|#| 1875/1875 [00:26<00:00, 69.97it/s, acc=0.962, loss=[0.4482929, 0.099984325, -0.1313083, 0.0, 36.649185
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 5: 100%|#| 1875/1875 [00:27<00:00, 68.14it/s, acc=0.972, loss=[0.43765202, 0.09897833, -0.13243656, 0.0, 36.02041
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 6: 100%|#| 1875/1875 [00:26<00:00, 71.33it/s, acc=0.975, loss=[0.43321362, 0.09785461, -0.1330289, 0.0, 35.40875,
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 7: 100%|#| 1875/1875 [00:25<00:00, 72.98it/s, acc=0.976, loss=[0.43047005, 0.09678595, -0.13323952, 0.0, 34.84893
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 8: 100%|#| 1875/1875 [00:27<00:00, 68.86it/s, acc=0.978, loss=[0.42794958, 0.095844544, -0.13337114, 0.0, 34.3692
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 9: 100%|#| 1875/1875 [00:27<00:00, 68.86it/s, acc=0.979, loss=[0.4261861, 0.094954506, -0.13344899, 0.0, 33.92193
