
 Namespace(filter_visualization=True, user_evaluation=False, train_counterfactual_net=True, train_all_classes=True, dropout=False, train_singular_counterfactual_net=False, choose_subclass=False, counterfactual_PP=False, resume_counterfactual_net=False, resume_from_epoch=30, test_counterfactual_net=False, load_counterfactual_net=True, resume=True, alter_class=5, analysis_class=6, find_global_filters=False, cfe_epochs=10, l1_weight=2, save_logFile=True, augmentation=True, dataset='fmnist', save_directory='./trained_weights/', train_using_builtin_fit_method=True, train=False, fine_tune=False, test=True, model='customCNN/', imagenet_weights=False) 

Model: "base_model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 28, 28, 1)]  0                                            
__________________________________________________________________________________________________
conv2d (Conv2D)                 (None, 28, 28, 64)   640         input_1[0][0]                    
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 28, 28, 64)   36928       conv2d[0][0]                     
__________________________________________________________________________________________________
max_pooling2d (MaxPooling2D)    (None, 14, 14, 64)   0           conv2d_1[0][0]                   
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 14, 14, 128)  73856       max_pooling2d[0][0]              
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (None, 14, 14, 128)  147584      conv2d_2[0][0]                   
__________________________________________________________________________________________________
max_pooling2d_1 (MaxPooling2D)  (None, 7, 7, 128)    0           conv2d_3[0][0]                   
__________________________________________________________________________________________________
conv2d_4 (Conv2D)               (None, 7, 7, 256)    295168      max_pooling2d_1[0][0]            
__________________________________________________________________________________________________
conv2d_5 (Conv2D)               (None, 7, 7, 256)    590080      conv2d_4[0][0]                   
__________________________________________________________________________________________________
maxpool2 (MaxPooling2D)         (None, 3, 3, 256)    0           conv2d_5[0][0]                   
__________________________________________________________________________________________________
global_average_pooling2d (Globa (None, 256)          0           maxpool2[0][0]                   
__________________________________________________________________________________________________
fmatrix (InputLayer)            [(None, 256)]        0                                            
__________________________________________________________________________________________________
tf.__operators__.add (TFOpLambd (None, 256)          0           global_average_pooling2d[0][0]   
                                                                 fmatrix[0][0]                    
__________________________________________________________________________________________________
dense (Dense)                   (None, 10)           2570        tf.__operators__.add[0][0]       
__________________________________________________________________________________________________
activation (Activation)         (None, 10)           0           dense[0][0]                      
==================================================================================================
Total params: 1,146,826
Trainable params: 1,146,826
Non-trainable params: 0
__________________________________________________________________________________________________
weights loaded
Model: "counterfactual_model"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 28, 28, 1)]       0         
_________________________________________________________________
conv2d (Conv2D)              (None, 28, 28, 64)        640       
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 28, 28, 64)        36928     
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 14, 14, 64)        0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 14, 14, 128)       73856     
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 14, 14, 128)       147584    
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 7, 7, 128)         0         
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 7, 7, 256)         295168    
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 7, 7, 256)         590080    
_________________________________________________________________
maxpool2 (MaxPooling2D)      (None, 3, 3, 256)         0         
_________________________________________________________________
global_average_pooling2d_1 ( (None, 256)               0         
_________________________________________________________________
dense_1 (Dense)              (None, 256)               65792     
=================================================================
Total params: 1,210,048
Trainable params: 65,792
Non-trainable params: 1,144,256
_________________________________________________________________
threshold:  0.5
l1 weight:  2
training CF model for alter class:  5
Training CF model for PNs
training for fixed alter class:  5
Model: "model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 28, 28, 1)]  0                                            
__________________________________________________________________________________________________
counterfactual_model (Functiona (None, 256)          1210048     input_1[0][0]                    
__________________________________________________________________________________________________
base_model (Functional)         [(None, 10), (None,  1146826     input_1[0][0]                    
                                                                 counterfactual_model[0][0]       
==================================================================================================
Total params: 1,212,618
Trainable params: 65,792
Non-trainable params: 1,146,826
__________________________________________________________________________________________________
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 0: 100%|#| 1875/1875 [00:26<00:00, 71.71it/s, acc=0.926, loss=[0.38763878, 0.0, -0.30425802, 0.0, 24.90595, 5.556
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 1: 100%|#| 1875/1875 [00:23<00:00, 80.21it/s, acc=0.964, loss=[0.1314732, 0.0, -0.24981654, 0.0, 14.612066, 5.158
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 2: 100%|#| 1875/1875 [00:22<00:00, 81.79it/s, acc=0.974, loss=[0.1205193, 0.0, -0.24035305, 0.0, 12.499733, 4.985
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 3: 100%|#| 1875/1875 [00:22<00:00, 81.90it/s, acc=0.98, loss=[0.116069555, 0.0, -0.2376655, 0.0, 11.382367, 4.883
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 4: 100%|#| 1875/1875 [00:22<00:00, 82.85it/s, acc=0.983, loss=[0.113405414, 0.0, -0.23676242, 0.0, 10.65585, 4.81
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 5: 100%|#| 1875/1875 [00:22<00:00, 81.74it/s, acc=0.985, loss=[0.11144846, 0.0, -0.23519243, 0.0, 10.147083, 4.76
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 6: 100%|#| 1875/1875 [00:23<00:00, 79.61it/s, acc=0.987, loss=[0.11015152, 0.0, -0.23398542, 0.0, 9.791433, 4.730
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 7: 100%|#| 1875/1875 [00:22<00:00, 81.86it/s, acc=0.988, loss=[0.108888924, 0.0, -0.23295145, 0.0, 9.51765, 4.700
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 8: 100%|#| 1875/1875 [00:23<00:00, 81.47it/s, acc=0.989, loss=[0.10788249, 0.0, -0.23214848, 0.0, 9.29605, 4.6769
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 9: 100%|#| 1875/1875 [00:22<00:00, 83.09it/s, acc=0.99, loss=[0.10713118, 0.0, -0.2312705, 0.0, 9.123616, 4.65684
