
 Namespace(filter_visualization=True, user_evaluation=False, train_counterfactual_net=True, train_all_classes=True, train_singular_counterfactual_net=False, choose_subclass=False, counterfactual_PP=True, resume_counterfactual_net=True, resume_from_epoch=3, test_counterfactual_net=False, load_counterfactual_net=True, resume=True, alter_class=193, analysis_class=9, find_global_filters=False, cfe_epochs=7, l1_weight=2, save_logFile=True, dataset='CUB200', save_directory='./trained_weights/', train_using_builtin_fit_method=True, train=False, fine_tune=False, test=False, model='VGG16/', imagenet_weights=True) 

Model: "base_model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 224, 224, 3) 0                                            
__________________________________________________________________________________________________
block1_conv1 (Conv2D)           (None, 224, 224, 64) 1792        input_1[0][0]                    
__________________________________________________________________________________________________
block1_conv2 (Conv2D)           (None, 224, 224, 64) 36928       block1_conv1[0][0]               
__________________________________________________________________________________________________
block1_pool (MaxPooling2D)      (None, 112, 112, 64) 0           block1_conv2[0][0]               
__________________________________________________________________________________________________
block2_conv1 (Conv2D)           (None, 112, 112, 128 73856       block1_pool[0][0]                
__________________________________________________________________________________________________
block2_conv2 (Conv2D)           (None, 112, 112, 128 147584      block2_conv1[0][0]               
__________________________________________________________________________________________________
block2_pool (MaxPooling2D)      (None, 56, 56, 128)  0           block2_conv2[0][0]               
__________________________________________________________________________________________________
block3_conv1 (Conv2D)           (None, 56, 56, 256)  295168      block2_pool[0][0]                
__________________________________________________________________________________________________
block3_conv2 (Conv2D)           (None, 56, 56, 256)  590080      block3_conv1[0][0]               
__________________________________________________________________________________________________
block3_conv3 (Conv2D)           (None, 56, 56, 256)  590080      block3_conv2[0][0]               
__________________________________________________________________________________________________
block3_pool (MaxPooling2D)      (None, 28, 28, 256)  0           block3_conv3[0][0]               
__________________________________________________________________________________________________
block4_conv1 (Conv2D)           (None, 28, 28, 512)  1180160     block3_pool[0][0]                
__________________________________________________________________________________________________
block4_conv2 (Conv2D)           (None, 28, 28, 512)  2359808     block4_conv1[0][0]               
__________________________________________________________________________________________________
block4_conv3 (Conv2D)           (None, 28, 28, 512)  2359808     block4_conv2[0][0]               
__________________________________________________________________________________________________
block4_pool (MaxPooling2D)      (None, 14, 14, 512)  0           block4_conv3[0][0]               
__________________________________________________________________________________________________
block5_conv1 (Conv2D)           (None, 14, 14, 512)  2359808     block4_pool[0][0]                
__________________________________________________________________________________________________
block5_conv2 (Conv2D)           (None, 14, 14, 512)  2359808     block5_conv1[0][0]               
__________________________________________________________________________________________________
block5_conv3 (Conv2D)           (None, 14, 14, 512)  2359808     block5_conv2[0][0]               
__________________________________________________________________________________________________
max_pooling2d (MaxPooling2D)    (None, 7, 7, 512)    0           block5_conv3[0][0]               
__________________________________________________________________________________________________
global_average_pooling2d (Globa (None, 512)          0           max_pooling2d[0][0]              
__________________________________________________________________________________________________
fmatrix (InputLayer)            [(None, 512)]        0                                            
__________________________________________________________________________________________________
tf.math.multiply (TFOpLambda)   (None, 512)          0           global_average_pooling2d[0][0]   
                                                                 fmatrix[0][0]                    
__________________________________________________________________________________________________
dense (Dense)                   (None, 200)          102600      tf.math.multiply[0][0]           
__________________________________________________________________________________________________
activation (Activation)         (None, 200)          0           dense[0][0]                      
==================================================================================================
Total params: 14,817,288
Trainable params: 102,600
Non-trainable params: 14,714,688
__________________________________________________________________________________________________
weights loaded
threshold:  0.5
l1 weight:  2
training CF model for alter class:  194.Cactus_Wren
Training CF model for PPs
training for fixed alter class:  194.Cactus_Wren
Model: "model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 224, 224, 3) 0                                            
__________________________________________________________________________________________________
counterfactual_model (Functiona (None, 512)          14977344    input_1[0][0]                    
__________________________________________________________________________________________________
base_model (Functional)         [(None, 200), (None, 14817288    input_1[0][0]                    
                                                                 counterfactual_model[0][0]       
==================================================================================================
Total params: 15,079,944
Trainable params: 262,656
Non-trainable params: 14,817,288
__________________________________________________________________________________________________
  0%|                                                                                          | 0/338 [00:00<?, ?it/s]epoch 3: 100%|#| 338/338 [01:56<00:00,  2.91it/s, acc=0.999, loss=[0.37872866, 0.8840446, -0.15460393, 0.0, 30.451923, 
  0%|                                                                                          | 0/338 [00:00<?, ?it/s]epoch 4: 100%|#| 338/338 [01:45<00:00,  3.19it/s, acc=0.999, loss=[0.36882412, 0.8395077, -0.15489934, 0.0, 28.813055, 
  0%|                                                                                          | 0/338 [00:00<?, ?it/s]epoch 5: 100%|#| 338/338 [01:45<00:00,  3.20it/s, acc=0.999, loss=[0.3567636, 0.80553615, -0.15570036, 0.0, 27.639608, 
  0%|                                                                                          | 0/338 [00:00<?, ?it/s]epoch 6: 100%|#| 338/338 [01:45<00:00,  3.20it/s, acc=0.999, loss=[0.34970513, 0.77682, -0.15637515, 0.0, 26.656065, 0.
