
 Namespace(filter_visualization=True, user_evaluation=False, train_counterfactual_net=True, train_all_classes=True, dropout=False, train_singular_counterfactual_net=False, choose_subclass=False, counterfactual_PP=False, resume_counterfactual_net=False, resume_from_epoch=10, test_counterfactual_net=False, load_counterfactual_net=True, resume=True, alter_class=0, analysis_class=6, find_global_filters=False, cfe_epochs=10, l1_weight=2, save_logFile=True, augmentation=True, dataset='mnist', save_directory='./trained_weights/', train_using_builtin_fit_method=True, train=False, fine_tune=False, test=True, model='customCNN/', imagenet_weights=False) 

Model: "base_model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 28, 28, 1)]  0                                            
__________________________________________________________________________________________________
conv2d (Conv2D)                 (None, 28, 28, 64)   640         input_1[0][0]                    
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 28, 28, 64)   36928       conv2d[0][0]                     
__________________________________________________________________________________________________
max_pooling2d (MaxPooling2D)    (None, 14, 14, 64)   0           conv2d_1[0][0]                   
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 14, 14, 128)  73856       max_pooling2d[0][0]              
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (None, 14, 14, 128)  147584      conv2d_2[0][0]                   
__________________________________________________________________________________________________
max_pooling2d_1 (MaxPooling2D)  (None, 7, 7, 128)    0           conv2d_3[0][0]                   
__________________________________________________________________________________________________
conv2d_4 (Conv2D)               (None, 7, 7, 256)    295168      max_pooling2d_1[0][0]            
__________________________________________________________________________________________________
conv2d_5 (Conv2D)               (None, 7, 7, 256)    590080      conv2d_4[0][0]                   
__________________________________________________________________________________________________
conv2d_6 (Conv2D)               (None, 7, 7, 256)    590080      conv2d_5[0][0]                   
__________________________________________________________________________________________________
max_pooling2d_2 (MaxPooling2D)  (None, 3, 3, 256)    0           conv2d_6[0][0]                   
__________________________________________________________________________________________________
conv2d_7 (Conv2D)               (None, 3, 3, 512)    1180160     max_pooling2d_2[0][0]            
__________________________________________________________________________________________________
conv2d_8 (Conv2D)               (None, 3, 3, 512)    2359808     conv2d_7[0][0]                   
__________________________________________________________________________________________________
conv2d_9 (Conv2D)               (None, 3, 3, 512)    2359808     conv2d_8[0][0]                   
__________________________________________________________________________________________________
maxpool2 (MaxPooling2D)         (None, 1, 1, 512)    0           conv2d_9[0][0]                   
__________________________________________________________________________________________________
global_average_pooling2d (Globa (None, 512)          0           maxpool2[0][0]                   
__________________________________________________________________________________________________
fmatrix (InputLayer)            [(None, 512)]        0                                            
__________________________________________________________________________________________________
tf.__operators__.add (TFOpLambd (None, 512)          0           global_average_pooling2d[0][0]   
                                                                 fmatrix[0][0]                    
__________________________________________________________________________________________________
dense (Dense)                   (None, 10)           5130        tf.__operators__.add[0][0]       
__________________________________________________________________________________________________
activation (Activation)         (None, 10)           0           dense[0][0]                      
==================================================================================================
Total params: 7,639,242
Trainable params: 7,639,242
Non-trainable params: 0
__________________________________________________________________________________________________
weights loaded
Model: "counterfactual_model"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 28, 28, 1)]       0         
_________________________________________________________________
conv2d (Conv2D)              (None, 28, 28, 64)        640       
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 28, 28, 64)        36928     
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 14, 14, 64)        0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 14, 14, 128)       73856     
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 14, 14, 128)       147584    
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 7, 7, 128)         0         
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 7, 7, 256)         295168    
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 7, 7, 256)         590080    
_________________________________________________________________
conv2d_6 (Conv2D)            (None, 7, 7, 256)         590080    
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 3, 3, 256)         0         
_________________________________________________________________
conv2d_7 (Conv2D)            (None, 3, 3, 512)         1180160   
_________________________________________________________________
conv2d_8 (Conv2D)            (None, 3, 3, 512)         2359808   
_________________________________________________________________
conv2d_9 (Conv2D)            (None, 3, 3, 512)         2359808   
_________________________________________________________________
maxpool2 (MaxPooling2D)      (None, 1, 1, 512)         0         
_________________________________________________________________
global_average_pooling2d_1 ( (None, 512)               0         
_________________________________________________________________
dense_1 (Dense)              (None, 512)               262656    
=================================================================
Total params: 7,896,768
Trainable params: 262,656
Non-trainable params: 7,634,112
_________________________________________________________________
threshold:  0.5
l1 weight:  2
training CF model for alter class:  0
Training CF model for PNs
training for fixed alter class:  0
Model: "model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 28, 28, 1)]  0                                            
__________________________________________________________________________________________________
counterfactual_model (Functiona (None, 512)          7896768     input_1[0][0]                    
__________________________________________________________________________________________________
base_model (Functional)         [(None, 10), (None,  7639242     input_1[0][0]                    
                                                                 counterfactual_model[0][0]       
==================================================================================================
Total params: 7,901,898
Trainable params: 262,656
Non-trainable params: 7,639,242
__________________________________________________________________________________________________
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 0: 100%|#| 1875/1875 [00:39<00:00, 47.73it/s, acc=0.97, loss=[0.30393538, 0.0, 0.24398825, 0.0, 28.70185, 4.98422
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 1: 100%|#| 1875/1875 [00:39<00:00, 47.04it/s, acc=0.996, loss=[0.1427575, 0.0, 0.25119296, 0.0, 12.7109, 4.619110
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 2: 100%|#| 1875/1875 [00:36<00:00, 50.94it/s, acc=0.998, loss=[0.13606718, 0.0, 0.2404028, 0.0, 10.351967, 4.4672
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 3: 100%|#| 1875/1875 [00:35<00:00, 52.12it/s, acc=0.999, loss=[0.13188107, 0.0, 0.23314966, 0.0, 9.27065, 4.38030
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 4: 100%|#| 1875/1875 [00:41<00:00, 45.01it/s, acc=0.999, loss=[0.12904783, 0.0, 0.2275563, 0.0, 8.5542, 4.3222523
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 5: 100%|###| 1875/1875 [00:42<00:00, 44.33it/s, acc=1, loss=[0.12727593, 0.0, 0.22348404, 0.0, 8.0515, 4.280042]]
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 6: 100%|#| 1875/1875 [00:43<00:00, 43.60it/s, acc=1, loss=[0.12587626, 0.0, 0.2201337, 0.0, 7.6836667, 4.2475257]
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 7: 100%|#| 1875/1875 [00:42<00:00, 44.50it/s, acc=1, loss=[0.124400385, 0.0, 0.2174579, 0.0, 7.36655, 4.2216744]]
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 8: 100%|#| 1875/1875 [00:41<00:00, 45.07it/s, acc=1, loss=[0.12343996, 0.0, 0.21580587, 0.0, 7.1111665, 4.200643]
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 9: 100%|#| 1875/1875 [00:36<00:00, 51.65it/s, acc=1, loss=[0.12268675, 0.0, 0.21436623, 0.0, 6.9016333, 4.18309]]
