
 Namespace(filter_visualization=True, user_evaluation=False, train_counterfactual_net=True, train_all_classes=True, dropout=False, train_singular_counterfactual_net=False, choose_subclass=False, counterfactual_PP=False, resume_counterfactual_net=False, resume_from_epoch=10, test_counterfactual_net=False, load_counterfactual_net=True, resume=True, alter_class=6, analysis_class=6, find_global_filters=False, cfe_epochs=10, l1_weight=2, save_logFile=True, augmentation=True, dataset='mnist', save_directory='./trained_weights/', train_using_builtin_fit_method=True, train=False, fine_tune=False, test=True, model='customCNN/', imagenet_weights=False) 

Model: "base_model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 28, 28, 1)]  0                                            
__________________________________________________________________________________________________
conv2d (Conv2D)                 (None, 28, 28, 64)   640         input_1[0][0]                    
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 28, 28, 64)   36928       conv2d[0][0]                     
__________________________________________________________________________________________________
max_pooling2d (MaxPooling2D)    (None, 14, 14, 64)   0           conv2d_1[0][0]                   
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 14, 14, 128)  73856       max_pooling2d[0][0]              
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (None, 14, 14, 128)  147584      conv2d_2[0][0]                   
__________________________________________________________________________________________________
max_pooling2d_1 (MaxPooling2D)  (None, 7, 7, 128)    0           conv2d_3[0][0]                   
__________________________________________________________________________________________________
conv2d_4 (Conv2D)               (None, 7, 7, 256)    295168      max_pooling2d_1[0][0]            
__________________________________________________________________________________________________
conv2d_5 (Conv2D)               (None, 7, 7, 256)    590080      conv2d_4[0][0]                   
__________________________________________________________________________________________________
conv2d_6 (Conv2D)               (None, 7, 7, 256)    590080      conv2d_5[0][0]                   
__________________________________________________________________________________________________
max_pooling2d_2 (MaxPooling2D)  (None, 3, 3, 256)    0           conv2d_6[0][0]                   
__________________________________________________________________________________________________
conv2d_7 (Conv2D)               (None, 3, 3, 512)    1180160     max_pooling2d_2[0][0]            
__________________________________________________________________________________________________
conv2d_8 (Conv2D)               (None, 3, 3, 512)    2359808     conv2d_7[0][0]                   
__________________________________________________________________________________________________
conv2d_9 (Conv2D)               (None, 3, 3, 512)    2359808     conv2d_8[0][0]                   
__________________________________________________________________________________________________
maxpool2 (MaxPooling2D)         (None, 1, 1, 512)    0           conv2d_9[0][0]                   
__________________________________________________________________________________________________
global_average_pooling2d (Globa (None, 512)          0           maxpool2[0][0]                   
__________________________________________________________________________________________________
fmatrix (InputLayer)            [(None, 512)]        0                                            
__________________________________________________________________________________________________
tf.__operators__.add (TFOpLambd (None, 512)          0           global_average_pooling2d[0][0]   
                                                                 fmatrix[0][0]                    
__________________________________________________________________________________________________
dense (Dense)                   (None, 10)           5130        tf.__operators__.add[0][0]       
__________________________________________________________________________________________________
activation (Activation)         (None, 10)           0           dense[0][0]                      
==================================================================================================
Total params: 7,639,242
Trainable params: 7,639,242
Non-trainable params: 0
__________________________________________________________________________________________________
weights loaded
Model: "counterfactual_model"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 28, 28, 1)]       0         
_________________________________________________________________
conv2d (Conv2D)              (None, 28, 28, 64)        640       
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 28, 28, 64)        36928     
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 14, 14, 64)        0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 14, 14, 128)       73856     
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 14, 14, 128)       147584    
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 7, 7, 128)         0         
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 7, 7, 256)         295168    
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 7, 7, 256)         590080    
_________________________________________________________________
conv2d_6 (Conv2D)            (None, 7, 7, 256)         590080    
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 3, 3, 256)         0         
_________________________________________________________________
conv2d_7 (Conv2D)            (None, 3, 3, 512)         1180160   
_________________________________________________________________
conv2d_8 (Conv2D)            (None, 3, 3, 512)         2359808   
_________________________________________________________________
conv2d_9 (Conv2D)            (None, 3, 3, 512)         2359808   
_________________________________________________________________
maxpool2 (MaxPooling2D)      (None, 1, 1, 512)         0         
_________________________________________________________________
global_average_pooling2d_1 ( (None, 512)               0         
_________________________________________________________________
dense_1 (Dense)              (None, 512)               262656    
=================================================================
Total params: 7,896,768
Trainable params: 262,656
Non-trainable params: 7,634,112
_________________________________________________________________
threshold:  0.5
l1 weight:  2
training CF model for alter class:  6
Training CF model for PNs
training for fixed alter class:  6
Model: "model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 28, 28, 1)]  0                                            
__________________________________________________________________________________________________
counterfactual_model (Functiona (None, 512)          7896768     input_1[0][0]                    
__________________________________________________________________________________________________
base_model (Functional)         [(None, 10), (None,  7639242     input_1[0][0]                    
                                                                 counterfactual_model[0][0]       
==================================================================================================
Total params: 7,901,898
Trainable params: 262,656
Non-trainable params: 7,639,242
__________________________________________________________________________________________________
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 0: 100%|#| 1875/1875 [00:45<00:00, 41.51it/s, acc=0.968, loss=[0.33401486, 0.0, 0.30792624, 0.0, 21.7765, 4.51215
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 1: 100%|#| 1875/1875 [00:39<00:00, 47.17it/s, acc=0.997, loss=[0.12690452, 0.0, 0.33244732, 0.0, 9.815066, 4.1709
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 2: 100%|#| 1875/1875 [00:40<00:00, 46.22it/s, acc=0.999, loss=[0.1201017, 0.0, 0.33317053, 0.0, 8.316566, 4.02685
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 3: 100%|#| 1875/1875 [00:40<00:00, 46.14it/s, acc=0.999, loss=[0.115758665, 0.0, 0.33617386, 0.0, 7.35955, 3.9457
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 4: 100%|#| 1875/1875 [00:41<00:00, 45.56it/s, acc=0.999, loss=[0.11408104, 0.0, 0.3406047, 0.0, 6.7358665, 3.8931
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 5: 100%|#| 1875/1875 [00:40<00:00, 46.00it/s, acc=1, loss=[0.112643674, 0.0, 0.34403378, 0.0, 6.36325, 3.8558965]
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 6: 100%|##| 1875/1875 [00:42<00:00, 44.60it/s, acc=1, loss=[0.11157475, 0.0, 0.3458944, 0.0, 6.0197167, 3.82804]]
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 7: 100%|##| 1875/1875 [00:42<00:00, 44.09it/s, acc=1, loss=[0.110750355, 0.0, 0.346306, 0.0, 5.7752666, 3.80629]]
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 8: 100%|###| 1875/1875 [00:41<00:00, 44.70it/s, acc=1, loss=[0.10996806, 0.0, 0.34647045, 0.0, 5.5579, 3.788783]]
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 9: 100%|#| 1875/1875 [00:42<00:00, 44.49it/s, acc=1, loss=[0.10928128, 0.0, 0.3468635, 0.0, 5.3735166, 3.7743404]
