
 Namespace(filter_visualization=True, user_evaluation=False, train_counterfactual_net=True, train_all_classes=True, dropout=False, train_singular_counterfactual_net=False, choose_subclass=False, counterfactual_PP=False, resume_counterfactual_net=True, resume_from_epoch=30, test_counterfactual_net=False, load_counterfactual_net=True, resume=True, alter_class=7, analysis_class=6, find_global_filters=False, cfe_epochs=60, l1_weight=2, save_logFile=True, augmentation=True, dataset='fmnist', save_directory='./trained_weights/', train_using_builtin_fit_method=True, train=False, fine_tune=False, test=True, model='customCNN/', imagenet_weights=False) 

Model: "base_model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 28, 28, 1)]  0                                            
__________________________________________________________________________________________________
conv2d (Conv2D)                 (None, 28, 28, 64)   640         input_1[0][0]                    
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 28, 28, 64)   36928       conv2d[0][0]                     
__________________________________________________________________________________________________
max_pooling2d (MaxPooling2D)    (None, 14, 14, 64)   0           conv2d_1[0][0]                   
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 14, 14, 128)  73856       max_pooling2d[0][0]              
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (None, 14, 14, 128)  147584      conv2d_2[0][0]                   
__________________________________________________________________________________________________
max_pooling2d_1 (MaxPooling2D)  (None, 7, 7, 128)    0           conv2d_3[0][0]                   
__________________________________________________________________________________________________
conv2d_4 (Conv2D)               (None, 7, 7, 256)    295168      max_pooling2d_1[0][0]            
__________________________________________________________________________________________________
conv2d_5 (Conv2D)               (None, 7, 7, 256)    590080      conv2d_4[0][0]                   
__________________________________________________________________________________________________
maxpool2 (MaxPooling2D)         (None, 3, 3, 256)    0           conv2d_5[0][0]                   
__________________________________________________________________________________________________
global_average_pooling2d (Globa (None, 256)          0           maxpool2[0][0]                   
__________________________________________________________________________________________________
fmatrix (InputLayer)            [(None, 256)]        0                                            
__________________________________________________________________________________________________
tf.__operators__.add (TFOpLambd (None, 256)          0           global_average_pooling2d[0][0]   
                                                                 fmatrix[0][0]                    
__________________________________________________________________________________________________
dense (Dense)                   (None, 10)           2570        tf.__operators__.add[0][0]       
__________________________________________________________________________________________________
activation (Activation)         (None, 10)           0           dense[0][0]                      
==================================================================================================
Total params: 1,146,826
Trainable params: 1,146,826
Non-trainable params: 0
__________________________________________________________________________________________________
weights loaded
Model: "counterfactual_model"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 28, 28, 1)]       0         
_________________________________________________________________
conv2d (Conv2D)              (None, 28, 28, 64)        640       
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 28, 28, 64)        36928     
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 14, 14, 64)        0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 14, 14, 128)       73856     
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 14, 14, 128)       147584    
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 7, 7, 128)         0         
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 7, 7, 256)         295168    
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 7, 7, 256)         590080    
_________________________________________________________________
maxpool2 (MaxPooling2D)      (None, 3, 3, 256)         0         
_________________________________________________________________
global_average_pooling2d_1 ( (None, 256)               0         
_________________________________________________________________
dense_1 (Dense)              (None, 256)               65792     
=================================================================
Total params: 1,210,048
Trainable params: 65,792
Non-trainable params: 1,144,256
_________________________________________________________________
threshold:  0.5
l1 weight:  2
training CF model for alter class:  7
Training CF model for PNs
training for fixed alter class:  7
Model: "model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 28, 28, 1)]  0                                            
__________________________________________________________________________________________________
counterfactual_model (Functiona (None, 256)          1210048     input_1[0][0]                    
__________________________________________________________________________________________________
base_model (Functional)         [(None, 10), (None,  1146826     input_1[0][0]                    
                                                                 counterfactual_model[0][0]       
==================================================================================================
Total params: 1,212,618
Trainable params: 65,792
Non-trainable params: 1,146,826
__________________________________________________________________________________________________
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 30: 100%|#| 1875/1875 [00:24<00:00, 75.81it/s, acc=0.994, loss=[0.10632634, 0.0, -0.013860269, 0.0, 8.19575, 5.24
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 31: 100%|#| 1875/1875 [00:21<00:00, 86.53it/s, acc=0.994, loss=[0.10639394, 0.0, -0.013868323, 0.0, 8.167283, 5.2
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 32: 100%|#| 1875/1875 [00:21<00:00, 86.47it/s, acc=0.994, loss=[0.1063201, 0.0, -0.013798994, 0.0, 8.1353, 5.2411
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 33: 100%|#| 1875/1875 [00:21<00:00, 86.31it/s, acc=0.994, loss=[0.10602173, 0.0, -0.0136077115, 0.0, 8.110133, 5.
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 34: 100%|#| 1875/1875 [00:21<00:00, 86.39it/s, acc=0.994, loss=[0.10608999, 0.0, -0.01364808, 0.0, 8.079184, 5.23
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 35: 100%|#| 1875/1875 [00:21<00:00, 86.46it/s, acc=0.994, loss=[0.105926745, 0.0, -0.013694236, 0.0, 8.04935, 5.2
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 36: 100%|#| 1875/1875 [00:21<00:00, 86.39it/s, acc=0.994, loss=[0.10581167, 0.0, -0.013601713, 0.0, 8.038366, 5.2
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 37: 100%|#| 1875/1875 [00:21<00:00, 86.54it/s, acc=0.994, loss=[0.10569183, 0.0, -0.013469419, 0.0, 8.010067, 5.2
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 38: 100%|#| 1875/1875 [00:21<00:00, 86.42it/s, acc=0.995, loss=[0.10565726, 0.0, -0.01352344, 0.0, 7.985133, 5.23
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 39: 100%|#| 1875/1875 [00:21<00:00, 86.54it/s, acc=0.995, loss=[0.10556894, 0.0, -0.013633887, 0.0, 7.9598, 5.237
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 40: 100%|#| 1875/1875 [00:21<00:00, 86.22it/s, acc=0.995, loss=[0.105529614, 0.0, -0.013279532, 0.0, 7.95175, 5.2
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 41: 100%|#| 1875/1875 [00:21<00:00, 86.45it/s, acc=0.995, loss=[0.10550679, 0.0, -0.0135837225, 0.0, 7.9229665, 5
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 42: 100%|#| 1875/1875 [00:21<00:00, 86.50it/s, acc=0.995, loss=[0.10540907, 0.0, -0.013376222, 0.0, 7.91355, 5.23
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 43: 100%|#| 1875/1875 [00:21<00:00, 86.36it/s, acc=0.995, loss=[0.10527216, 0.0, -0.013487255, 0.0, 7.8915167, 5.
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 44: 100%|#| 1875/1875 [00:21<00:00, 86.37it/s, acc=0.995, loss=[0.10514076, 0.0, -0.013490689, 0.0, 7.86715, 5.23
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 45: 100%|#| 1875/1875 [00:21<00:00, 86.30it/s, acc=0.995, loss=[0.105099715, 0.0, -0.013432802, 0.0, 7.850333, 5.
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 46: 100%|#| 1875/1875 [00:21<00:00, 86.38it/s, acc=0.995, loss=[0.10495771, 0.0, -0.013407416, 0.0, 7.8397, 5.234
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 47: 100%|#| 1875/1875 [00:21<00:00, 86.32it/s, acc=0.995, loss=[0.10498474, 0.0, -0.013454456, 0.0, 7.82885, 5.23
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 48: 100%|#| 1875/1875 [00:21<00:00, 86.45it/s, acc=0.995, loss=[0.10489217, 0.0, -0.013426217, 0.0, 7.80445, 5.23
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 49: 100%|#| 1875/1875 [00:21<00:00, 86.62it/s, acc=0.995, loss=[0.1048241, 0.0, -0.013419962, 0.0, 7.7848835, 5.2
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 50: 100%|#| 1875/1875 [00:21<00:00, 86.45it/s, acc=0.995, loss=[0.104690276, 0.0, -0.013459712, 0.0, 7.78105, 5.2
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 51: 100%|#| 1875/1875 [00:21<00:00, 86.67it/s, acc=0.995, loss=[0.10467392, 0.0, -0.013327245, 0.0, 7.7593, 5.232
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 52: 100%|#| 1875/1875 [00:21<00:00, 86.49it/s, acc=0.995, loss=[0.104658194, 0.0, -0.013553077, 0.0, 7.7516, 5.23
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 53: 100%|#| 1875/1875 [00:21<00:00, 86.40it/s, acc=0.995, loss=[0.10456858, 0.0, -0.013393926, 0.0, 7.7377167, 5.
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 54: 100%|#| 1875/1875 [00:21<00:00, 86.72it/s, acc=0.995, loss=[0.10452812, 0.0, -0.01352661, 0.0, 7.718167, 5.23
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 55: 100%|#| 1875/1875 [00:21<00:00, 86.52it/s, acc=0.995, loss=[0.10449433, 0.0, -0.013564147, 0.0, 7.7088, 5.230
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 56: 100%|#| 1875/1875 [00:21<00:00, 86.52it/s, acc=0.995, loss=[0.104360744, 0.0, -0.013486176, 0.0, 7.6950336, 5
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 57: 100%|#| 1875/1875 [00:21<00:00, 86.45it/s, acc=0.995, loss=[0.10443142, 0.0, -0.013459061, 0.0, 7.6815333, 5.
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 58: 100%|#| 1875/1875 [00:21<00:00, 86.49it/s, acc=0.995, loss=[0.1042227, 0.0, -0.013608977, 0.0, 7.665283, 5.22
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 59: 100%|#| 1875/1875 [00:21<00:00, 86.26it/s, acc=0.995, loss=[0.10435613, 0.0, -0.013559475, 0.0, 7.655783, 5.2
