
 Namespace(filter_visualization=True, user_evaluation=False, train_counterfactual_net=True, train_all_classes=True, dropout=False, train_singular_counterfactual_net=False, choose_subclass=False, counterfactual_PP=False, resume_counterfactual_net=True, resume_from_epoch=30, test_counterfactual_net=False, load_counterfactual_net=True, resume=True, alter_class=3, analysis_class=6, find_global_filters=False, cfe_epochs=60, l1_weight=2, save_logFile=True, augmentation=True, dataset='fmnist', save_directory='./trained_weights/', train_using_builtin_fit_method=True, train=False, fine_tune=False, test=True, model='customCNN/', imagenet_weights=False) 

Model: "base_model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 28, 28, 1)]  0                                            
__________________________________________________________________________________________________
conv2d (Conv2D)                 (None, 28, 28, 64)   640         input_1[0][0]                    
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 28, 28, 64)   36928       conv2d[0][0]                     
__________________________________________________________________________________________________
max_pooling2d (MaxPooling2D)    (None, 14, 14, 64)   0           conv2d_1[0][0]                   
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 14, 14, 128)  73856       max_pooling2d[0][0]              
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (None, 14, 14, 128)  147584      conv2d_2[0][0]                   
__________________________________________________________________________________________________
max_pooling2d_1 (MaxPooling2D)  (None, 7, 7, 128)    0           conv2d_3[0][0]                   
__________________________________________________________________________________________________
conv2d_4 (Conv2D)               (None, 7, 7, 256)    295168      max_pooling2d_1[0][0]            
__________________________________________________________________________________________________
conv2d_5 (Conv2D)               (None, 7, 7, 256)    590080      conv2d_4[0][0]                   
__________________________________________________________________________________________________
maxpool2 (MaxPooling2D)         (None, 3, 3, 256)    0           conv2d_5[0][0]                   
__________________________________________________________________________________________________
global_average_pooling2d (Globa (None, 256)          0           maxpool2[0][0]                   
__________________________________________________________________________________________________
fmatrix (InputLayer)            [(None, 256)]        0                                            
__________________________________________________________________________________________________
tf.__operators__.add (TFOpLambd (None, 256)          0           global_average_pooling2d[0][0]   
                                                                 fmatrix[0][0]                    
__________________________________________________________________________________________________
dense (Dense)                   (None, 10)           2570        tf.__operators__.add[0][0]       
__________________________________________________________________________________________________
activation (Activation)         (None, 10)           0           dense[0][0]                      
==================================================================================================
Total params: 1,146,826
Trainable params: 1,146,826
Non-trainable params: 0
__________________________________________________________________________________________________
weights loaded
Model: "counterfactual_model"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 28, 28, 1)]       0         
_________________________________________________________________
conv2d (Conv2D)              (None, 28, 28, 64)        640       
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 28, 28, 64)        36928     
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 14, 14, 64)        0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 14, 14, 128)       73856     
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 14, 14, 128)       147584    
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 7, 7, 128)         0         
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 7, 7, 256)         295168    
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 7, 7, 256)         590080    
_________________________________________________________________
maxpool2 (MaxPooling2D)      (None, 3, 3, 256)         0         
_________________________________________________________________
global_average_pooling2d_1 ( (None, 256)               0         
_________________________________________________________________
dense_1 (Dense)              (None, 256)               65792     
=================================================================
Total params: 1,210,048
Trainable params: 65,792
Non-trainable params: 1,144,256
_________________________________________________________________
threshold:  0.5
l1 weight:  2
training CF model for alter class:  3
Training CF model for PNs
training for fixed alter class:  3
Model: "model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 28, 28, 1)]  0                                            
__________________________________________________________________________________________________
counterfactual_model (Functiona (None, 256)          1210048     input_1[0][0]                    
__________________________________________________________________________________________________
base_model (Functional)         [(None, 10), (None,  1146826     input_1[0][0]                    
                                                                 counterfactual_model[0][0]       
==================================================================================================
Total params: 1,212,618
Trainable params: 65,792
Non-trainable params: 1,146,826
__________________________________________________________________________________________________
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 30: 100%|#| 1875/1875 [00:24<00:00, 77.81it/s, acc=0.991, loss=[0.100158446, 0.0, -0.06768709, 0.0, 7.33115, 3.94
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 31: 100%|#| 1875/1875 [00:21<00:00, 89.23it/s, acc=0.991, loss=[0.10010782, 0.0, -0.06751259, 0.0, 7.29525, 3.942
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 32: 100%|#| 1875/1875 [00:21<00:00, 88.63it/s, acc=0.991, loss=[0.10004636, 0.0, -0.06744678, 0.0, 7.28, 3.942246
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 33: 100%|#| 1875/1875 [00:21<00:00, 87.69it/s, acc=0.992, loss=[0.0999882, 0.0, -0.067435354, 0.0, 7.247783, 3.94
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 34: 100%|#| 1875/1875 [00:21<00:00, 87.81it/s, acc=0.992, loss=[0.09973039, 0.0, -0.067352675, 0.0, 7.22595, 3.94
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 35: 100%|#| 1875/1875 [00:21<00:00, 87.75it/s, acc=0.992, loss=[0.09985608, 0.0, -0.06706147, 0.0, 7.2050166, 3.9
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 36: 100%|#| 1875/1875 [00:21<00:00, 87.47it/s, acc=0.992, loss=[0.09964289, 0.0, -0.06716453, 0.0, 7.18215, 3.940
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 37: 100%|#| 1875/1875 [00:21<00:00, 87.55it/s, acc=0.992, loss=[0.09964933, 0.0, -0.06716887, 0.0, 7.163017, 3.93
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 38: 100%|#| 1875/1875 [00:21<00:00, 87.64it/s, acc=0.992, loss=[0.0994486, 0.0, -0.0669314, 0.0, 7.14635, 3.93906
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 39: 100%|#| 1875/1875 [00:21<00:00, 87.69it/s, acc=0.992, loss=[0.099366315, 0.0, -0.06681721, 0.0, 7.12465, 3.93
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 40: 100%|#| 1875/1875 [00:21<00:00, 87.52it/s, acc=0.992, loss=[0.09941751, 0.0, -0.0668186, 0.0, 7.10785, 3.9381
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 41: 100%|#| 1875/1875 [00:21<00:00, 87.36it/s, acc=0.992, loss=[0.09927514, 0.0, -0.066681914, 0.0, 7.09125, 3.93
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 42: 100%|#| 1875/1875 [00:21<00:00, 87.42it/s, acc=0.992, loss=[0.09945697, 0.0, -0.06658035, 0.0, 7.07975, 3.937
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 43: 100%|#| 1875/1875 [00:21<00:00, 87.51it/s, acc=0.992, loss=[0.099125735, 0.0, -0.06653127, 0.0, 7.05425, 3.93
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 44: 100%|#| 1875/1875 [00:21<00:00, 87.55it/s, acc=0.992, loss=[0.09898776, 0.0, -0.06639419, 0.0, 7.0509334, 3.9
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 45: 100%|#| 1875/1875 [00:21<00:00, 87.58it/s, acc=0.992, loss=[0.09904296, 0.0, -0.06641217, 0.0, 7.0345335, 3.9
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 46: 100%|#| 1875/1875 [00:21<00:00, 87.69it/s, acc=0.992, loss=[0.09899374, 0.0, -0.06630555, 0.0, 7.021867, 3.93
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 47: 100%|#| 1875/1875 [00:21<00:00, 87.66it/s, acc=0.992, loss=[0.09875707, 0.0, -0.06617312, 0.0, 7.014283, 3.93
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 48: 100%|#| 1875/1875 [00:21<00:00, 87.32it/s, acc=0.992, loss=[0.09888007, 0.0, -0.066039376, 0.0, 7.001683, 3.9
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 49: 100%|#| 1875/1875 [00:21<00:00, 86.39it/s, acc=0.993, loss=[0.09868768, 0.0, -0.066017695, 0.0, 6.9810834, 3.
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 50: 100%|#| 1875/1875 [00:21<00:00, 86.99it/s, acc=0.992, loss=[0.09869182, 0.0, -0.06577602, 0.0, 6.9745665, 3.9
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 51: 100%|#| 1875/1875 [00:21<00:00, 87.14it/s, acc=0.993, loss=[0.09862841, 0.0, -0.06577505, 0.0, 6.9681835, 3.9
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 52: 100%|#| 1875/1875 [00:21<00:00, 87.22it/s, acc=0.993, loss=[0.09856947, 0.0, -0.065639, 0.0, 6.9515667, 3.933
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 53: 100%|#| 1875/1875 [00:21<00:00, 87.41it/s, acc=0.993, loss=[0.098506615, 0.0, -0.06562164, 0.0, 6.9403334, 3.
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 54: 100%|#| 1875/1875 [00:21<00:00, 87.29it/s, acc=0.993, loss=[0.098396026, 0.0, -0.06556822, 0.0, 6.935583, 3.9
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 55: 100%|#| 1875/1875 [00:21<00:00, 87.08it/s, acc=0.993, loss=[0.098171964, 0.0, -0.06550389, 0.0, 6.91765, 3.93
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 56: 100%|#| 1875/1875 [00:21<00:00, 87.26it/s, acc=0.993, loss=[0.09833451, 0.0, -0.06540009, 0.0, 6.9076834, 3.9
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 57: 100%|#| 1875/1875 [00:21<00:00, 87.12it/s, acc=0.993, loss=[0.09841077, 0.0, -0.065290965, 0.0, 6.8901, 3.931
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 58: 100%|#| 1875/1875 [00:21<00:00, 87.27it/s, acc=0.993, loss=[0.0979739, 0.0, -0.06517903, 0.0, 6.877617, 3.931
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 59: 100%|#| 1875/1875 [00:21<00:00, 87.48it/s, acc=0.993, loss=[0.09833618, 0.0, -0.0650973, 0.0, 6.8753333, 3.93
