
 Namespace(filter_visualization=True, user_evaluation=False, train_counterfactual_net=True, train_all_classes=True, dropout=False, train_singular_counterfactual_net=False, choose_subclass=False, counterfactual_PP=False, resume_counterfactual_net=True, resume_from_epoch=30, test_counterfactual_net=False, load_counterfactual_net=True, resume=True, alter_class=1, analysis_class=6, find_global_filters=False, cfe_epochs=60, l1_weight=2, save_logFile=True, augmentation=True, dataset='fmnist', save_directory='./trained_weights/', train_using_builtin_fit_method=True, train=False, fine_tune=False, test=True, model='customCNN/', imagenet_weights=False) 

Model: "base_model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 28, 28, 1)]  0                                            
__________________________________________________________________________________________________
conv2d (Conv2D)                 (None, 28, 28, 64)   640         input_1[0][0]                    
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 28, 28, 64)   36928       conv2d[0][0]                     
__________________________________________________________________________________________________
max_pooling2d (MaxPooling2D)    (None, 14, 14, 64)   0           conv2d_1[0][0]                   
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 14, 14, 128)  73856       max_pooling2d[0][0]              
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (None, 14, 14, 128)  147584      conv2d_2[0][0]                   
__________________________________________________________________________________________________
max_pooling2d_1 (MaxPooling2D)  (None, 7, 7, 128)    0           conv2d_3[0][0]                   
__________________________________________________________________________________________________
conv2d_4 (Conv2D)               (None, 7, 7, 256)    295168      max_pooling2d_1[0][0]            
__________________________________________________________________________________________________
conv2d_5 (Conv2D)               (None, 7, 7, 256)    590080      conv2d_4[0][0]                   
__________________________________________________________________________________________________
maxpool2 (MaxPooling2D)         (None, 3, 3, 256)    0           conv2d_5[0][0]                   
__________________________________________________________________________________________________
global_average_pooling2d (Globa (None, 256)          0           maxpool2[0][0]                   
__________________________________________________________________________________________________
fmatrix (InputLayer)            [(None, 256)]        0                                            
__________________________________________________________________________________________________
tf.__operators__.add (TFOpLambd (None, 256)          0           global_average_pooling2d[0][0]   
                                                                 fmatrix[0][0]                    
__________________________________________________________________________________________________
dense (Dense)                   (None, 10)           2570        tf.__operators__.add[0][0]       
__________________________________________________________________________________________________
activation (Activation)         (None, 10)           0           dense[0][0]                      
==================================================================================================
Total params: 1,146,826
Trainable params: 1,146,826
Non-trainable params: 0
__________________________________________________________________________________________________
weights loaded
Model: "counterfactual_model"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 28, 28, 1)]       0         
_________________________________________________________________
conv2d (Conv2D)              (None, 28, 28, 64)        640       
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 28, 28, 64)        36928     
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 14, 14, 64)        0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 14, 14, 128)       73856     
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 14, 14, 128)       147584    
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 7, 7, 128)         0         
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 7, 7, 256)         295168    
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 7, 7, 256)         590080    
_________________________________________________________________
maxpool2 (MaxPooling2D)      (None, 3, 3, 256)         0         
_________________________________________________________________
global_average_pooling2d_1 ( (None, 256)               0         
_________________________________________________________________
dense_1 (Dense)              (None, 256)               65792     
=================================================================
Total params: 1,210,048
Trainable params: 65,792
Non-trainable params: 1,144,256
_________________________________________________________________
threshold:  0.5
l1 weight:  2
training CF model for alter class:  1
Training CF model for PNs
training for fixed alter class:  1
Model: "model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 28, 28, 1)]  0                                            
__________________________________________________________________________________________________
counterfactual_model (Functiona (None, 256)          1210048     input_1[0][0]                    
__________________________________________________________________________________________________
base_model (Functional)         [(None, 10), (None,  1146826     input_1[0][0]                    
                                                                 counterfactual_model[0][0]       
==================================================================================================
Total params: 1,212,618
Trainable params: 65,792
Non-trainable params: 1,146,826
__________________________________________________________________________________________________
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 30: 100%|#| 1875/1875 [00:24<00:00, 75.10it/s, acc=0.993, loss=[0.09134903, 0.0, -0.12436352, 0.0, 5.7577333, 3.9
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 31: 100%|#| 1875/1875 [00:22<00:00, 85.16it/s, acc=0.993, loss=[0.09128106, 0.0, -0.12428541, 0.0, 5.7388, 3.9292
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 32: 100%|#| 1875/1875 [00:21<00:00, 85.73it/s, acc=0.993, loss=[0.09117213, 0.0, -0.12426349, 0.0, 5.717117, 3.92
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 33: 100%|#| 1875/1875 [00:21<00:00, 86.50it/s, acc=0.993, loss=[0.09112436, 0.0, -0.12419719, 0.0, 5.701383, 3.92
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 34: 100%|#| 1875/1875 [00:21<00:00, 86.95it/s, acc=0.993, loss=[0.091056444, 0.0, -0.12411667, 0.0, 5.6852, 3.927
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 35: 100%|#| 1875/1875 [00:21<00:00, 86.81it/s, acc=0.993, loss=[0.090902366, 0.0, -0.1241082, 0.0, 5.662833, 3.92
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 36: 100%|#| 1875/1875 [00:21<00:00, 86.64it/s, acc=0.993, loss=[0.09105608, 0.0, -0.124069594, 0.0, 5.6468334, 3.
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 37: 100%|#| 1875/1875 [00:21<00:00, 87.14it/s, acc=0.993, loss=[0.09093844, 0.0, -0.12402599, 0.0, 5.627383, 3.92
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 38: 100%|#| 1875/1875 [00:21<00:00, 86.99it/s, acc=0.994, loss=[0.090929225, 0.0, -0.12399747, 0.0, 5.6178665, 3.
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 39: 100%|#| 1875/1875 [00:21<00:00, 86.72it/s, acc=0.994, loss=[0.090753905, 0.0, -0.12396858, 0.0, 5.5961165, 3.
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 40: 100%|#| 1875/1875 [00:21<00:00, 86.82it/s, acc=0.993, loss=[0.09084891, 0.0, -0.12396441, 0.0, 5.581967, 3.92
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 41: 100%|#| 1875/1875 [00:21<00:00, 86.71it/s, acc=0.994, loss=[0.090689756, 0.0, -0.12385347, 0.0, 5.5726, 3.925
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 42: 100%|#| 1875/1875 [00:21<00:00, 86.67it/s, acc=0.994, loss=[0.09082419, 0.0, -0.12384821, 0.0, 5.5585165, 3.9
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 43: 100%|#| 1875/1875 [00:21<00:00, 86.95it/s, acc=0.994, loss=[0.090747185, 0.0, -0.12379904, 0.0, 5.5515, 3.924
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 44: 100%|#| 1875/1875 [00:21<00:00, 87.03it/s, acc=0.994, loss=[0.09074318, 0.0, -0.12380027, 0.0, 5.5327835, 3.9
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 45: 100%|#| 1875/1875 [00:21<00:00, 87.21it/s, acc=0.994, loss=[0.09055836, 0.0, -0.12388806, 0.0, 5.522, 3.92375
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 46: 100%|#| 1875/1875 [00:21<00:00, 86.57it/s, acc=0.994, loss=[0.0906457, 0.0, -0.12378943, 0.0, 5.5052166, 3.92
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 47: 100%|#| 1875/1875 [00:21<00:00, 86.81it/s, acc=0.994, loss=[0.090487875, 0.0, -0.12366589, 0.0, 5.50845, 3.92
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 48: 100%|#| 1875/1875 [00:21<00:00, 87.09it/s, acc=0.994, loss=[0.09043452, 0.0, -0.123806305, 0.0, 5.4958835, 3.
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 49: 100%|#| 1875/1875 [00:21<00:00, 86.88it/s, acc=0.994, loss=[0.09052247, 0.0, -0.12371467, 0.0, 5.4849834, 3.9
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 50: 100%|#| 1875/1875 [00:21<00:00, 86.81it/s, acc=0.994, loss=[0.09050834, 0.0, -0.12357698, 0.0, 5.4808, 3.9222
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 51: 100%|#| 1875/1875 [00:21<00:00, 86.85it/s, acc=0.994, loss=[0.09037751, 0.0, -0.12369339, 0.0, 5.4721, 3.9220
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 52: 100%|#| 1875/1875 [00:21<00:00, 86.95it/s, acc=0.994, loss=[0.09048322, 0.0, -0.123614505, 0.0, 5.4656, 3.921
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 53: 100%|#| 1875/1875 [00:21<00:00, 86.89it/s, acc=0.994, loss=[0.09037416, 0.0, -0.12360821, 0.0, 5.44965, 3.921
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 54: 100%|#| 1875/1875 [00:21<00:00, 86.89it/s, acc=0.994, loss=[0.09037333, 0.0, -0.123586126, 0.0, 5.4438167, 3.
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 55: 100%|#| 1875/1875 [00:21<00:00, 86.66it/s, acc=0.994, loss=[0.090370126, 0.0, -0.12353424, 0.0, 5.43455, 3.92
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 56: 100%|#| 1875/1875 [00:21<00:00, 86.75it/s, acc=0.994, loss=[0.09028411, 0.0, -0.12352467, 0.0, 5.4292, 3.9207
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 57: 100%|#| 1875/1875 [00:21<00:00, 86.95it/s, acc=0.994, loss=[0.09028528, 0.0, -0.12357733, 0.0, 5.426833, 3.92
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 58: 100%|#| 1875/1875 [00:21<00:00, 86.93it/s, acc=0.994, loss=[0.09023479, 0.0, -0.123463735, 0.0, 5.41605, 3.92
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 59: 100%|#| 1875/1875 [00:21<00:00, 86.59it/s, acc=0.994, loss=[0.09036155, 0.0, -0.12343609, 0.0, 5.4128666, 3.9
