
 Namespace(filter_visualization=True, user_evaluation=False, train_counterfactual_net=True, train_all_classes=True, dropout=False, train_singular_counterfactual_net=False, choose_subclass=False, counterfactual_PP=False, resume_counterfactual_net=True, resume_from_epoch=30, test_counterfactual_net=False, load_counterfactual_net=True, resume=True, alter_class=5, analysis_class=6, find_global_filters=False, cfe_epochs=60, l1_weight=2, save_logFile=True, augmentation=True, dataset='fmnist', save_directory='./trained_weights/', train_using_builtin_fit_method=True, train=False, fine_tune=False, test=True, model='customCNN/', imagenet_weights=False) 

Model: "base_model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 28, 28, 1)]  0                                            
__________________________________________________________________________________________________
conv2d (Conv2D)                 (None, 28, 28, 64)   640         input_1[0][0]                    
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 28, 28, 64)   36928       conv2d[0][0]                     
__________________________________________________________________________________________________
max_pooling2d (MaxPooling2D)    (None, 14, 14, 64)   0           conv2d_1[0][0]                   
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 14, 14, 128)  73856       max_pooling2d[0][0]              
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (None, 14, 14, 128)  147584      conv2d_2[0][0]                   
__________________________________________________________________________________________________
max_pooling2d_1 (MaxPooling2D)  (None, 7, 7, 128)    0           conv2d_3[0][0]                   
__________________________________________________________________________________________________
conv2d_4 (Conv2D)               (None, 7, 7, 256)    295168      max_pooling2d_1[0][0]            
__________________________________________________________________________________________________
conv2d_5 (Conv2D)               (None, 7, 7, 256)    590080      conv2d_4[0][0]                   
__________________________________________________________________________________________________
maxpool2 (MaxPooling2D)         (None, 3, 3, 256)    0           conv2d_5[0][0]                   
__________________________________________________________________________________________________
global_average_pooling2d (Globa (None, 256)          0           maxpool2[0][0]                   
__________________________________________________________________________________________________
fmatrix (InputLayer)            [(None, 256)]        0                                            
__________________________________________________________________________________________________
tf.__operators__.add (TFOpLambd (None, 256)          0           global_average_pooling2d[0][0]   
                                                                 fmatrix[0][0]                    
__________________________________________________________________________________________________
dense (Dense)                   (None, 10)           2570        tf.__operators__.add[0][0]       
__________________________________________________________________________________________________
activation (Activation)         (None, 10)           0           dense[0][0]                      
==================================================================================================
Total params: 1,146,826
Trainable params: 1,146,826
Non-trainable params: 0
__________________________________________________________________________________________________
weights loaded
Model: "counterfactual_model"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 28, 28, 1)]       0         
_________________________________________________________________
conv2d (Conv2D)              (None, 28, 28, 64)        640       
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 28, 28, 64)        36928     
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 14, 14, 64)        0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 14, 14, 128)       73856     
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 14, 14, 128)       147584    
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 7, 7, 128)         0         
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 7, 7, 256)         295168    
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 7, 7, 256)         590080    
_________________________________________________________________
maxpool2 (MaxPooling2D)      (None, 3, 3, 256)         0         
_________________________________________________________________
global_average_pooling2d_1 ( (None, 256)               0         
_________________________________________________________________
dense_1 (Dense)              (None, 256)               65792     
=================================================================
Total params: 1,210,048
Trainable params: 65,792
Non-trainable params: 1,144,256
_________________________________________________________________
threshold:  0.5
l1 weight:  2
training CF model for alter class:  5
Training CF model for PNs
training for fixed alter class:  5
Model: "model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 28, 28, 1)]  0                                            
__________________________________________________________________________________________________
counterfactual_model (Functiona (None, 256)          1210048     input_1[0][0]                    
__________________________________________________________________________________________________
base_model (Functional)         [(None, 10), (None,  1146826     input_1[0][0]                    
                                                                 counterfactual_model[0][0]       
==================================================================================================
Total params: 1,212,618
Trainable params: 65,792
Non-trainable params: 1,146,826
__________________________________________________________________________________________________
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 30: 100%|#| 1875/1875 [00:24<00:00, 75.92it/s, acc=0.994, loss=[0.102793016, 0.0, -0.15615381, 0.0, 8.115933, 4.3
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 31: 100%|#| 1875/1875 [00:21<00:00, 86.82it/s, acc=0.995, loss=[0.10271263, 0.0, -0.1551264, 0.0, 8.0815, 4.34001
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 32: 100%|#| 1875/1875 [00:21<00:00, 86.49it/s, acc=0.995, loss=[0.102680296, 0.0, -0.15448855, 0.0, 8.04225, 4.33
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 33: 100%|#| 1875/1875 [00:21<00:00, 86.53it/s, acc=0.995, loss=[0.10247783, 0.0, -0.15384045, 0.0, 8.01085, 4.338
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 34: 100%|#| 1875/1875 [00:21<00:00, 86.72it/s, acc=0.995, loss=[0.10248549, 0.0, -0.1530671, 0.0, 7.9759336, 4.33
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 35: 100%|#| 1875/1875 [00:21<00:00, 86.53it/s, acc=0.995, loss=[0.102255724, 0.0, -0.15296346, 0.0, 7.947183, 4.3
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 36: 100%|#| 1875/1875 [00:21<00:00, 86.45it/s, acc=0.995, loss=[0.102319516, 0.0, -0.15216826, 0.0, 7.920367, 4.3
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 37: 100%|#| 1875/1875 [00:21<00:00, 86.33it/s, acc=0.995, loss=[0.10216042, 0.0, -0.15160865, 0.0, 7.8934665, 4.3
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 38: 100%|#| 1875/1875 [00:21<00:00, 86.46it/s, acc=0.995, loss=[0.10212301, 0.0, -0.15115169, 0.0, 7.8525167, 4.3
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 39: 100%|#| 1875/1875 [00:21<00:00, 86.20it/s, acc=0.995, loss=[0.102010466, 0.0, -0.15070058, 0.0, 7.8392, 4.335
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 40: 100%|#| 1875/1875 [00:21<00:00, 86.60it/s, acc=0.995, loss=[0.10202328, 0.0, -0.15048242, 0.0, 7.8117833, 4.3
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 41: 100%|#| 1875/1875 [00:21<00:00, 86.61it/s, acc=0.995, loss=[0.10178158, 0.0, -0.14990905, 0.0, 7.788483, 4.33
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 42: 100%|#| 1875/1875 [00:21<00:00, 85.97it/s, acc=0.995, loss=[0.101802, 0.0, -0.14969479, 0.0, 7.7548833, 4.333
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 43: 100%|#| 1875/1875 [00:21<00:00, 86.67it/s, acc=0.995, loss=[0.10176312, 0.0, -0.14961055, 0.0, 7.7286, 4.3334
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 44: 100%|#| 1875/1875 [00:21<00:00, 86.71it/s, acc=0.995, loss=[0.101661466, 0.0, -0.14942212, 0.0, 7.707383, 4.3
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 45: 100%|#| 1875/1875 [00:21<00:00, 86.22it/s, acc=0.995, loss=[0.101661965, 0.0, -0.14903551, 0.0, 7.6797, 4.332
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 46: 100%|#| 1875/1875 [00:21<00:00, 86.50it/s, acc=0.995, loss=[0.10147746, 0.0, -0.14906085, 0.0, 7.665633, 4.33
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 47: 100%|#| 1875/1875 [00:21<00:00, 86.69it/s, acc=0.996, loss=[0.10155527, 0.0, -0.14853512, 0.0, 7.6370835, 4.3
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 48: 100%|#| 1875/1875 [00:21<00:00, 86.60it/s, acc=0.995, loss=[0.10141474, 0.0, -0.14875785, 0.0, 7.616433, 4.33
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 49: 100%|#| 1875/1875 [00:21<00:00, 86.55it/s, acc=0.995, loss=[0.101319976, 0.0, -0.14845012, 0.0, 7.59245, 4.33
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 50: 100%|#| 1875/1875 [00:21<00:00, 85.98it/s, acc=0.995, loss=[0.101279475, 0.0, -0.14820108, 0.0, 7.5756, 4.330
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 51: 100%|#| 1875/1875 [00:21<00:00, 86.18it/s, acc=0.995, loss=[0.10127118, 0.0, -0.14817883, 0.0, 7.5689836, 4.3
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 52: 100%|#| 1875/1875 [00:21<00:00, 86.46it/s, acc=0.995, loss=[0.10115843, 0.0, -0.14803402, 0.0, 7.5488667, 4.3
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 53: 100%|#| 1875/1875 [00:21<00:00, 86.47it/s, acc=0.996, loss=[0.10115069, 0.0, -0.14795163, 0.0, 7.5228167, 4.3
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 54: 100%|#| 1875/1875 [00:21<00:00, 86.57it/s, acc=0.996, loss=[0.10106069, 0.0, -0.14785671, 0.0, 7.512367, 4.32
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 55: 100%|#| 1875/1875 [00:21<00:00, 86.55it/s, acc=0.996, loss=[0.10105904, 0.0, -0.14787841, 0.0, 7.49275, 4.328
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 56: 100%|#| 1875/1875 [00:21<00:00, 86.46it/s, acc=0.996, loss=[0.10103843, 0.0, -0.14772864, 0.0, 7.4617667, 4.3
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 57: 100%|#| 1875/1875 [00:21<00:00, 86.11it/s, acc=0.996, loss=[0.100865, 0.0, -0.14772312, 0.0, 7.4684834, 4.328
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 58: 100%|#| 1875/1875 [00:21<00:00, 86.12it/s, acc=0.995, loss=[0.100968644, 0.0, -0.14764228, 0.0, 7.4339, 4.327
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 59: 100%|#| 1875/1875 [00:21<00:00, 86.01it/s, acc=0.996, loss=[0.10081747, 0.0, -0.14749324, 0.0, 7.430967, 4.32
