
 Namespace(filter_visualization=True, user_evaluation=False, train_counterfactual_net=True, train_all_classes=True, dropout=False, train_singular_counterfactual_net=False, choose_subclass=False, counterfactual_PP=False, resume_counterfactual_net=True, resume_from_epoch=30, test_counterfactual_net=False, load_counterfactual_net=True, resume=True, alter_class=8, analysis_class=6, find_global_filters=False, cfe_epochs=60, l1_weight=2, save_logFile=True, augmentation=True, dataset='fmnist', save_directory='./trained_weights/', train_using_builtin_fit_method=True, train=False, fine_tune=False, test=True, model='customCNN/', imagenet_weights=False) 

Model: "base_model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 28, 28, 1)]  0                                            
__________________________________________________________________________________________________
conv2d (Conv2D)                 (None, 28, 28, 64)   640         input_1[0][0]                    
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 28, 28, 64)   36928       conv2d[0][0]                     
__________________________________________________________________________________________________
max_pooling2d (MaxPooling2D)    (None, 14, 14, 64)   0           conv2d_1[0][0]                   
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 14, 14, 128)  73856       max_pooling2d[0][0]              
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (None, 14, 14, 128)  147584      conv2d_2[0][0]                   
__________________________________________________________________________________________________
max_pooling2d_1 (MaxPooling2D)  (None, 7, 7, 128)    0           conv2d_3[0][0]                   
__________________________________________________________________________________________________
conv2d_4 (Conv2D)               (None, 7, 7, 256)    295168      max_pooling2d_1[0][0]            
__________________________________________________________________________________________________
conv2d_5 (Conv2D)               (None, 7, 7, 256)    590080      conv2d_4[0][0]                   
__________________________________________________________________________________________________
maxpool2 (MaxPooling2D)         (None, 3, 3, 256)    0           conv2d_5[0][0]                   
__________________________________________________________________________________________________
global_average_pooling2d (Globa (None, 256)          0           maxpool2[0][0]                   
__________________________________________________________________________________________________
fmatrix (InputLayer)            [(None, 256)]        0                                            
__________________________________________________________________________________________________
tf.__operators__.add (TFOpLambd (None, 256)          0           global_average_pooling2d[0][0]   
                                                                 fmatrix[0][0]                    
__________________________________________________________________________________________________
dense (Dense)                   (None, 10)           2570        tf.__operators__.add[0][0]       
__________________________________________________________________________________________________
activation (Activation)         (None, 10)           0           dense[0][0]                      
==================================================================================================
Total params: 1,146,826
Trainable params: 1,146,826
Non-trainable params: 0
__________________________________________________________________________________________________
weights loaded
Model: "counterfactual_model"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 28, 28, 1)]       0         
_________________________________________________________________
conv2d (Conv2D)              (None, 28, 28, 64)        640       
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 28, 28, 64)        36928     
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 14, 14, 64)        0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 14, 14, 128)       73856     
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 14, 14, 128)       147584    
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 7, 7, 128)         0         
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 7, 7, 256)         295168    
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 7, 7, 256)         590080    
_________________________________________________________________
maxpool2 (MaxPooling2D)      (None, 3, 3, 256)         0         
_________________________________________________________________
global_average_pooling2d_1 ( (None, 256)               0         
_________________________________________________________________
dense_1 (Dense)              (None, 256)               65792     
=================================================================
Total params: 1,210,048
Trainable params: 65,792
Non-trainable params: 1,144,256
_________________________________________________________________
threshold:  0.5
l1 weight:  2
training CF model for alter class:  8
Training CF model for PNs
training for fixed alter class:  8
Model: "model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 28, 28, 1)]  0                                            
__________________________________________________________________________________________________
counterfactual_model (Functiona (None, 256)          1210048     input_1[0][0]                    
__________________________________________________________________________________________________
base_model (Functional)         [(None, 10), (None,  1146826     input_1[0][0]                    
                                                                 counterfactual_model[0][0]       
==================================================================================================
Total params: 1,212,618
Trainable params: 65,792
Non-trainable params: 1,146,826
__________________________________________________________________________________________________
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 30: 100%|#| 1875/1875 [00:24<00:00, 75.62it/s, acc=0.994, loss=[0.09719997, 0.0, -0.2622609, 0.0, 7.358383, 3.914
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 31: 100%|#| 1875/1875 [00:21<00:00, 86.29it/s, acc=0.994, loss=[0.097105995, 0.0, -0.26209912, 0.0, 7.3180833, 3.
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 32: 100%|#| 1875/1875 [00:21<00:00, 86.39it/s, acc=0.994, loss=[0.09704761, 0.0, -0.26215804, 0.0, 7.2988834, 3.9
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 33: 100%|#| 1875/1875 [00:21<00:00, 86.17it/s, acc=0.994, loss=[0.09701981, 0.0, -0.26186025, 0.0, 7.282833, 3.91
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 34: 100%|#| 1875/1875 [00:21<00:00, 86.09it/s, acc=0.994, loss=[0.09686559, 0.0, -0.26180834, 0.0, 7.2639666, 3.9
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 35: 100%|#| 1875/1875 [00:21<00:00, 86.20it/s, acc=0.994, loss=[0.09667796, 0.0, -0.26166278, 0.0, 7.2362833, 3.9
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 36: 100%|#| 1875/1875 [00:21<00:00, 86.25it/s, acc=0.994, loss=[0.09681383, 0.0, -0.2615696, 0.0, 7.2172, 3.91180
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 37: 100%|#| 1875/1875 [00:22<00:00, 85.06it/s, acc=0.995, loss=[0.096669875, 0.0, -0.26155603, 0.0, 7.1989665, 3.
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 38: 100%|#| 1875/1875 [00:21<00:00, 86.09it/s, acc=0.995, loss=[0.096652165, 0.0, -0.26138914, 0.0, 7.1725, 3.910
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 39: 100%|#| 1875/1875 [00:21<00:00, 86.56it/s, acc=0.995, loss=[0.09649931, 0.0, -0.26131758, 0.0, 7.1628666, 3.9
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 40: 100%|#| 1875/1875 [00:21<00:00, 85.99it/s, acc=0.995, loss=[0.096503995, 0.0, -0.26124617, 0.0, 7.1467667, 3.
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 41: 100%|#| 1875/1875 [00:21<00:00, 85.76it/s, acc=0.995, loss=[0.0964218, 0.0, -0.26105192, 0.0, 7.1345835, 3.90
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 42: 100%|#| 1875/1875 [00:21<00:00, 86.19it/s, acc=0.995, loss=[0.096550666, 0.0, -0.2610168, 0.0, 7.106467, 3.90
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 43: 100%|#| 1875/1875 [00:21<00:00, 86.09it/s, acc=0.995, loss=[0.09632806, 0.0, -0.2610719, 0.0, 7.10815, 3.9091
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 44: 100%|#| 1875/1875 [00:21<00:00, 86.06it/s, acc=0.995, loss=[0.09635261, 0.0, -0.26089796, 0.0, 7.091017, 3.90
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 45: 100%|#| 1875/1875 [00:21<00:00, 86.04it/s, acc=0.995, loss=[0.09629638, 0.0, -0.26069975, 0.0, 7.0768, 3.9084
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 46: 100%|#| 1875/1875 [00:21<00:00, 86.04it/s, acc=0.995, loss=[0.09629961, 0.0, -0.26076823, 0.0, 7.0635333, 3.9
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 47: 100%|#| 1875/1875 [00:21<00:00, 86.21it/s, acc=0.995, loss=[0.09611116, 0.0, -0.2607702, 0.0, 7.0521, 3.90782
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 48: 100%|#| 1875/1875 [00:21<00:00, 87.38it/s, acc=0.995, loss=[0.09628118, 0.0, -0.26075375, 0.0, 7.0355167, 3.9
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 49: 100%|#| 1875/1875 [00:21<00:00, 87.12it/s, acc=0.995, loss=[0.096148945, 0.0, -0.2605927, 0.0, 7.0259833, 3.9
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 50: 100%|#| 1875/1875 [00:21<00:00, 87.92it/s, acc=0.995, loss=[0.0959681, 0.0, -0.26045197, 0.0, 7.010267, 3.906
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 51: 100%|#| 1875/1875 [00:21<00:00, 87.31it/s, acc=0.995, loss=[0.0960373, 0.0, -0.2604504, 0.0, 7.0088334, 3.906
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 52: 100%|#| 1875/1875 [00:21<00:00, 87.55it/s, acc=0.995, loss=[0.09601025, 0.0, -0.26026806, 0.0, 6.9977, 3.9063
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 53: 100%|#| 1875/1875 [00:21<00:00, 87.63it/s, acc=0.995, loss=[0.0959984, 0.0, -0.26020166, 0.0, 6.98755, 3.9060
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 54: 100%|#| 1875/1875 [00:21<00:00, 87.40it/s, acc=0.995, loss=[0.095838815, 0.0, -0.26035812, 0.0, 6.975983, 3.9
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 55: 100%|#| 1875/1875 [00:21<00:00, 87.87it/s, acc=0.995, loss=[0.09576537, 0.0, -0.2602413, 0.0, 6.9607835, 3.90
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 56: 100%|#| 1875/1875 [00:21<00:00, 87.42it/s, acc=0.995, loss=[0.09591504, 0.0, -0.2599827, 0.0, 6.9537, 3.90526
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 57: 100%|#| 1875/1875 [00:21<00:00, 87.18it/s, acc=0.995, loss=[0.09570233, 0.0, -0.2601123, 0.0, 6.9403834, 3.90
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 58: 100%|#| 1875/1875 [00:21<00:00, 87.30it/s, acc=0.995, loss=[0.095698886, 0.0, -0.26001528, 0.0, 6.9371, 3.904
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 59: 100%|#| 1875/1875 [00:21<00:00, 87.49it/s, acc=0.996, loss=[0.095798485, 0.0, -0.2599096, 0.0, 6.923983, 3.90
