
 Namespace(filter_visualization=True, user_evaluation=False, train_counterfactual_net=True, train_all_classes=True, dropout=False, train_singular_counterfactual_net=False, choose_subclass=False, counterfactual_PP=False, resume_counterfactual_net=False, resume_from_epoch=30, test_counterfactual_net=False, load_counterfactual_net=True, resume=True, alter_class=0, analysis_class=6, find_global_filters=False, cfe_epochs=10, l1_weight=0.005, save_logFile=True, augmentation=True, dataset='fmnist', save_directory='./trained_weights/', train_using_builtin_fit_method=True, train=False, fine_tune=False, test=True, model='customCNN/', imagenet_weights=False) 

Model: "base_model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 28, 28, 1)]  0                                            
__________________________________________________________________________________________________
conv2d (Conv2D)                 (None, 28, 28, 64)   640         input_1[0][0]                    
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 28, 28, 64)   36928       conv2d[0][0]                     
__________________________________________________________________________________________________
max_pooling2d (MaxPooling2D)    (None, 14, 14, 64)   0           conv2d_1[0][0]                   
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 14, 14, 128)  73856       max_pooling2d[0][0]              
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (None, 14, 14, 128)  147584      conv2d_2[0][0]                   
__________________________________________________________________________________________________
max_pooling2d_1 (MaxPooling2D)  (None, 7, 7, 128)    0           conv2d_3[0][0]                   
__________________________________________________________________________________________________
conv2d_4 (Conv2D)               (None, 7, 7, 256)    295168      max_pooling2d_1[0][0]            
__________________________________________________________________________________________________
conv2d_5 (Conv2D)               (None, 7, 7, 256)    590080      conv2d_4[0][0]                   
__________________________________________________________________________________________________
fmatrix (InputLayer)            [(None, 7, 7, 256)]  0                                            
__________________________________________________________________________________________________
tf.__operators__.add (TFOpLambd (None, 7, 7, 256)    0           conv2d_5[0][0]                   
                                                                 fmatrix[0][0]                    
__________________________________________________________________________________________________
maxpool2 (MaxPooling2D)         (None, 3, 3, 256)    0           tf.__operators__.add[0][0]       
__________________________________________________________________________________________________
global_average_pooling2d (Globa (None, 256)          0           maxpool2[0][0]                   
__________________________________________________________________________________________________
dense (Dense)                   (None, 10)           2570        global_average_pooling2d[0][0]   
__________________________________________________________________________________________________
activation (Activation)         (None, 10)           0           dense[0][0]                      
==================================================================================================
Total params: 1,146,826
Trainable params: 1,146,826
Non-trainable params: 0
__________________________________________________________________________________________________
weights loaded
Model: "counterfactual_model"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 28, 28, 1)]       0         
_________________________________________________________________
conv2d (Conv2D)              (None, 28, 28, 64)        640       
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 28, 28, 64)        36928     
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 14, 14, 64)        0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 14, 14, 128)       73856     
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 14, 14, 128)       147584    
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 7, 7, 128)         0         
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 7, 7, 256)         295168    
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 7, 7, 256)         590080    
_________________________________________________________________
PN_conv (Conv2D)             (None, 7, 7, 256)         590080    
=================================================================
Total params: 1,734,336
Trainable params: 590,080
Non-trainable params: 1,144,256
_________________________________________________________________
threshold:  0.5
l1 weight:  0.005
training CF model for alter class:  0
Training CF model for PNs
training for fixed alter class:  0
Model: "model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 28, 28, 1)]  0                                            
__________________________________________________________________________________________________
counterfactual_model (Functiona (None, 7, 7, 256)    1734336     input_1[0][0]                    
__________________________________________________________________________________________________
base_model (Functional)         [(None, 10), (None,  1146826     input_1[0][0]                    
                                                                 counterfactual_model[0][0]       
==================================================================================================
Total params: 1,736,906
Trainable params: 590,080
Non-trainable params: 1,146,826
__________________________________________________________________________________________________
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 0: 100%|#| 1875/1875 [00:39<00:00, 48.03it/s, acc=0.992, loss=[0.06541412, 0.0, -0.57064, 0.0, 0.84249383, 0.7199
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 1: 100%|#| 1875/1875 [00:34<00:00, 54.99it/s, acc=0.996, loss=[0.012669051, 0.0, -0.38661113, 0.0, 0.37053344, 0.
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 2: 100%|#| 1875/1875 [00:35<00:00, 52.49it/s, acc=0.997, loss=[0.0097980015, 0.0, -0.35886475, 0.0, 0.28509086, 0
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 3: 100%|#| 1875/1875 [00:33<00:00, 55.37it/s, acc=0.998, loss=[0.008360906, 0.0, -0.3447335, 0.0, 0.2421242, 0.42
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 4: 100%|#| 1875/1875 [00:34<00:00, 54.75it/s, acc=0.999, loss=[0.00761688, 0.0, -0.33309713, 0.0, 0.21581967, 0.3
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 5: 100%|#| 1875/1875 [00:35<00:00, 53.53it/s, acc=0.999, loss=[0.007121892, 0.0, -0.32522827, 0.0, 0.19727622, 0.
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 6: 100%|#| 1875/1875 [00:35<00:00, 53.30it/s, acc=1, loss=[0.0067856973, 0.0, -0.31884158, 0.0, 0.18368487, 0.359
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 7: 100%|#| 1875/1875 [00:35<00:00, 53.18it/s, acc=1, loss=[0.006480744, 0.0, -0.31366605, 0.0, 0.17273797, 0.3470
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 8: 100%|#| 1875/1875 [00:37<00:00, 49.85it/s, acc=1, loss=[0.0063448385, 0.0, -0.30918616, 0.0, 0.16395171, 0.336
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 9: 100%|#| 1875/1875 [00:34<00:00, 53.67it/s, acc=1, loss=[0.0061354926, 0.0, -0.30599564, 0.0, 0.15661773, 0.328
