
 Namespace(filter_visualization=True, user_evaluation=False, train_counterfactual_net=True, train_all_classes=True, dropout=False, train_singular_counterfactual_net=False, choose_subclass=False, counterfactual_PP=False, resume_counterfactual_net=False, resume_from_epoch=30, test_counterfactual_net=False, load_counterfactual_net=True, resume=True, alter_class=1, analysis_class=6, find_global_filters=False, cfe_epochs=10, l1_weight=0.005, save_logFile=True, augmentation=True, dataset='fmnist', save_directory='./trained_weights/', train_using_builtin_fit_method=True, train=False, fine_tune=False, test=True, model='customCNN/', imagenet_weights=False) 

Model: "base_model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 28, 28, 1)]  0                                            
__________________________________________________________________________________________________
conv2d (Conv2D)                 (None, 28, 28, 64)   640         input_1[0][0]                    
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 28, 28, 64)   36928       conv2d[0][0]                     
__________________________________________________________________________________________________
max_pooling2d (MaxPooling2D)    (None, 14, 14, 64)   0           conv2d_1[0][0]                   
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 14, 14, 128)  73856       max_pooling2d[0][0]              
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (None, 14, 14, 128)  147584      conv2d_2[0][0]                   
__________________________________________________________________________________________________
max_pooling2d_1 (MaxPooling2D)  (None, 7, 7, 128)    0           conv2d_3[0][0]                   
__________________________________________________________________________________________________
conv2d_4 (Conv2D)               (None, 7, 7, 256)    295168      max_pooling2d_1[0][0]            
__________________________________________________________________________________________________
conv2d_5 (Conv2D)               (None, 7, 7, 256)    590080      conv2d_4[0][0]                   
__________________________________________________________________________________________________
fmatrix (InputLayer)            [(None, 7, 7, 256)]  0                                            
__________________________________________________________________________________________________
tf.__operators__.add (TFOpLambd (None, 7, 7, 256)    0           conv2d_5[0][0]                   
                                                                 fmatrix[0][0]                    
__________________________________________________________________________________________________
maxpool2 (MaxPooling2D)         (None, 3, 3, 256)    0           tf.__operators__.add[0][0]       
__________________________________________________________________________________________________
global_average_pooling2d (Globa (None, 256)          0           maxpool2[0][0]                   
__________________________________________________________________________________________________
dense (Dense)                   (None, 10)           2570        global_average_pooling2d[0][0]   
__________________________________________________________________________________________________
activation (Activation)         (None, 10)           0           dense[0][0]                      
==================================================================================================
Total params: 1,146,826
Trainable params: 1,146,826
Non-trainable params: 0
__________________________________________________________________________________________________
weights loaded
Model: "counterfactual_model"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 28, 28, 1)]       0         
_________________________________________________________________
conv2d (Conv2D)              (None, 28, 28, 64)        640       
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 28, 28, 64)        36928     
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 14, 14, 64)        0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 14, 14, 128)       73856     
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 14, 14, 128)       147584    
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 7, 7, 128)         0         
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 7, 7, 256)         295168    
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 7, 7, 256)         590080    
_________________________________________________________________
PN_conv (Conv2D)             (None, 7, 7, 256)         590080    
=================================================================
Total params: 1,734,336
Trainable params: 590,080
Non-trainable params: 1,144,256
_________________________________________________________________
threshold:  0.5
l1 weight:  0.005
training CF model for alter class:  1
Training CF model for PNs
training for fixed alter class:  1
Model: "model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 28, 28, 1)]  0                                            
__________________________________________________________________________________________________
counterfactual_model (Functiona (None, 7, 7, 256)    1734336     input_1[0][0]                    
__________________________________________________________________________________________________
base_model (Functional)         [(None, 10), (None,  1146826     input_1[0][0]                    
                                                                 counterfactual_model[0][0]       
==================================================================================================
Total params: 1,736,906
Trainable params: 590,080
Non-trainable params: 1,146,826
__________________________________________________________________________________________________
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 0: 100%|#| 1875/1875 [00:51<00:00, 36.24it/s, acc=0.99, loss=[0.12700982, 0.0, -0.5954959, 0.0, 0.809633, 0.79911
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 1: 100%|#| 1875/1875 [00:49<00:00, 38.02it/s, acc=0.996, loss=[0.013693884, 0.0, -0.39866367, 0.0, 0.37188968, 0.
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 2: 100%|#| 1875/1875 [00:51<00:00, 36.68it/s, acc=0.997, loss=[0.01070714, 0.0, -0.37046954, 0.0, 0.28917724, 0.5
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 3: 100%|#| 1875/1875 [00:53<00:00, 35.18it/s, acc=0.998, loss=[0.008836156, 0.0, -0.35320276, 0.0, 0.24711488, 0.
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 4: 100%|#| 1875/1875 [00:51<00:00, 36.57it/s, acc=0.999, loss=[0.0080788145, 0.0, -0.3414328, 0.0, 0.21984789, 0.
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 5: 100%|#| 1875/1875 [00:46<00:00, 40.11it/s, acc=0.999, loss=[0.007493696, 0.0, -0.3332436, 0.0, 0.20151173, 0.4
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 6: 100%|#| 1875/1875 [00:50<00:00, 37.25it/s, acc=0.999, loss=[0.0071099224, 0.0, -0.32562715, 0.0, 0.18752314, 0
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 7: 100%|#| 1875/1875 [00:52<00:00, 35.63it/s, acc=0.999, loss=[0.006805984, 0.0, -0.31991136, 0.0, 0.17648676, 0.
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 8: 100%|#| 1875/1875 [00:50<00:00, 36.84it/s, acc=1, loss=[0.006630263, 0.0, -0.31452736, 0.0, 0.16742297, 0.3771
  0%|                                                                                         | 0/1875 [00:00<?, ?it/s]epoch 9: 100%|#| 1875/1875 [00:49<00:00, 37.75it/s, acc=1, loss=[0.0064302804, 0.0, -0.31063494, 0.0, 0.16003437, 0.367
