
 Namespace(filter_visualization=True, user_evaluation=False, train_counterfactual_net=True, train_all_classes=True, dropout=False, train_singular_counterfactual_net=False, choose_subclass=False, counterfactual_PP=False, resume_counterfactual_net=False, resume_from_epoch=30, test_counterfactual_net=False, load_counterfactual_net=True, resume=True, alter_class=125, analysis_class=6, find_global_filters=False, cfe_epochs=10, l1_weight=0.005, save_logFile=True, augmentation=True, dataset='CUB200', save_directory='./trained_weights/', train_using_builtin_fit_method=True, train=False, fine_tune=False, test=True, model='VGG16/', imagenet_weights=True) 

Model: "base_model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 224, 224, 3) 0                                            
__________________________________________________________________________________________________
block1_conv1 (Conv2D)           (None, 224, 224, 64) 1792        input_1[0][0]                    
__________________________________________________________________________________________________
block1_conv2 (Conv2D)           (None, 224, 224, 64) 36928       block1_conv1[0][0]               
__________________________________________________________________________________________________
block1_pool (MaxPooling2D)      (None, 112, 112, 64) 0           block1_conv2[0][0]               
__________________________________________________________________________________________________
block2_conv1 (Conv2D)           (None, 112, 112, 128 73856       block1_pool[0][0]                
__________________________________________________________________________________________________
block2_conv2 (Conv2D)           (None, 112, 112, 128 147584      block2_conv1[0][0]               
__________________________________________________________________________________________________
block2_pool (MaxPooling2D)      (None, 56, 56, 128)  0           block2_conv2[0][0]               
__________________________________________________________________________________________________
block3_conv1 (Conv2D)           (None, 56, 56, 256)  295168      block2_pool[0][0]                
__________________________________________________________________________________________________
block3_conv2 (Conv2D)           (None, 56, 56, 256)  590080      block3_conv1[0][0]               
__________________________________________________________________________________________________
block3_conv3 (Conv2D)           (None, 56, 56, 256)  590080      block3_conv2[0][0]               
__________________________________________________________________________________________________
block3_pool (MaxPooling2D)      (None, 28, 28, 256)  0           block3_conv3[0][0]               
__________________________________________________________________________________________________
block4_conv1 (Conv2D)           (None, 28, 28, 512)  1180160     block3_pool[0][0]                
__________________________________________________________________________________________________
block4_conv2 (Conv2D)           (None, 28, 28, 512)  2359808     block4_conv1[0][0]               
__________________________________________________________________________________________________
block4_conv3 (Conv2D)           (None, 28, 28, 512)  2359808     block4_conv2[0][0]               
__________________________________________________________________________________________________
block4_pool (MaxPooling2D)      (None, 14, 14, 512)  0           block4_conv3[0][0]               
__________________________________________________________________________________________________
block5_conv1 (Conv2D)           (None, 14, 14, 512)  2359808     block4_pool[0][0]                
__________________________________________________________________________________________________
block5_conv2 (Conv2D)           (None, 14, 14, 512)  2359808     block5_conv1[0][0]               
__________________________________________________________________________________________________
block5_conv3 (Conv2D)           (None, 14, 14, 512)  2359808     block5_conv2[0][0]               
__________________________________________________________________________________________________
fmatrix (InputLayer)            [(None, 14, 14, 512) 0                                            
__________________________________________________________________________________________________
tf.__operators__.add (TFOpLambd (None, 14, 14, 512)  0           block5_conv3[0][0]               
                                                                 fmatrix[0][0]                    
__________________________________________________________________________________________________
maxpool2 (MaxPooling2D)         (None, 7, 7, 512)    0           tf.__operators__.add[0][0]       
__________________________________________________________________________________________________
global_average_pooling2d (Globa (None, 512)          0           maxpool2[0][0]                   
__________________________________________________________________________________________________
dense (Dense)                   (None, 200)          102600      global_average_pooling2d[0][0]   
__________________________________________________________________________________________________
activation (Activation)         (None, 200)          0           dense[0][0]                      
==================================================================================================
Total params: 14,817,288
Trainable params: 102,600
Non-trainable params: 14,714,688
__________________________________________________________________________________________________
weights loaded
Model: "counterfactual_model"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 224, 224, 3)]     0         
_________________________________________________________________
block1_conv1 (Conv2D)        (None, 224, 224, 64)      1792      
_________________________________________________________________
block1_conv2 (Conv2D)        (None, 224, 224, 64)      36928     
_________________________________________________________________
block1_pool (MaxPooling2D)   (None, 112, 112, 64)      0         
_________________________________________________________________
block2_conv1 (Conv2D)        (None, 112, 112, 128)     73856     
_________________________________________________________________
block2_conv2 (Conv2D)        (None, 112, 112, 128)     147584    
_________________________________________________________________
block2_pool (MaxPooling2D)   (None, 56, 56, 128)       0         
_________________________________________________________________
block3_conv1 (Conv2D)        (None, 56, 56, 256)       295168    
_________________________________________________________________
block3_conv2 (Conv2D)        (None, 56, 56, 256)       590080    
_________________________________________________________________
block3_conv3 (Conv2D)        (None, 56, 56, 256)       590080    
_________________________________________________________________
block3_pool (MaxPooling2D)   (None, 28, 28, 256)       0         
_________________________________________________________________
block4_conv1 (Conv2D)        (None, 28, 28, 512)       1180160   
_________________________________________________________________
block4_conv2 (Conv2D)        (None, 28, 28, 512)       2359808   
_________________________________________________________________
block4_conv3 (Conv2D)        (None, 28, 28, 512)       2359808   
_________________________________________________________________
block4_pool (MaxPooling2D)   (None, 14, 14, 512)       0         
_________________________________________________________________
block5_conv1 (Conv2D)        (None, 14, 14, 512)       2359808   
_________________________________________________________________
block5_conv2 (Conv2D)        (None, 14, 14, 512)       2359808   
_________________________________________________________________
block5_conv3 (Conv2D)        (None, 14, 14, 512)       2359808   
_________________________________________________________________
PN_conv (Conv2D)             (None, 14, 14, 512)       2359808   
=================================================================
Total params: 17,074,496
Trainable params: 2,359,808
Non-trainable params: 14,714,688
_________________________________________________________________
threshold:  0.5
l1 weight:  0.005
training CF model for alter class:  126.Nelson_Sharp_tailed_Sparrow
Training CF model for PNs
training for fixed alter class:  126.Nelson_Sharp_tailed_Sparrow
Model: "model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 224, 224, 3) 0                                            
__________________________________________________________________________________________________
counterfactual_model (Functiona (None, 14, 14, 512)  17074496    input_1[0][0]                    
__________________________________________________________________________________________________
base_model (Functional)         [(None, 200), (None, 14817288    input_1[0][0]                    
                                                                 counterfactual_model[0][0]       
==================================================================================================
Total params: 17,177,096
Trainable params: 2,359,808
Non-trainable params: 14,817,288
__________________________________________________________________________________________________
  0%|                                                                                          | 0/338 [00:00<?, ?it/s]epoch 0: 100%|#| 338/338 [02:36<00:00,  2.17it/s, acc=0.923, loss=[0.49436128, 0.0, -0.8518512, 0.0, 2.5860093, 5.25915
  0%|                                                                                          | 0/338 [00:00<?, ?it/s]epoch 1: 100%|#| 338/338 [02:27<00:00,  2.29it/s, acc=0.938, loss=[0.1708837, 0.0, -0.7495911, 0.0, 1.3707654, 4.316981
  0%|                                                                                          | 0/338 [00:00<?, ?it/s]epoch 2: 100%|#| 338/338 [02:27<00:00,  2.30it/s, acc=0.949, loss=[0.14470981, 0.0, -0.73019224, 0.0, 1.1273918, 3.9210
  0%|                                                                                          | 0/338 [00:00<?, ?it/s]epoch 3: 100%|#| 338/338 [02:27<00:00,  2.30it/s, acc=0.949, loss=[0.13596618, 0.0, -0.7191416, 0.0, 0.9905946, 3.68688
  0%|                                                                                          | 0/338 [00:00<?, ?it/s]epoch 4: 100%|#| 338/338 [02:27<00:00,  2.29it/s, acc=0.955, loss=[0.1230235, 0.0, -0.7076675, 0.0, 0.8888797, 3.523280
  0%|                                                                                          | 0/338 [00:00<?, ?it/s]epoch 5: 100%|#| 338/338 [02:26<00:00,  2.30it/s, acc=0.953, loss=[0.12012526, 0.0, -0.70430833, 0.0, 0.8220843, 3.4040
  0%|                                                                                          | 0/338 [00:00<?, ?it/s]epoch 6: 100%|#| 338/338 [02:26<00:00,  2.30it/s, acc=0.957, loss=[0.11819179, 0.0, -0.69903725, 0.0, 0.76654, 3.310481
  0%|                                                                                          | 0/338 [00:00<?, ?it/s]epoch 7: 100%|#| 338/338 [02:26<00:00,  2.30it/s, acc=0.956, loss=[0.1106946, 0.0, -0.6948212, 0.0, 0.72419256, 3.23395
  0%|                                                                                          | 0/338 [00:00<?, ?it/s]epoch 8: 100%|#| 338/338 [02:28<00:00,  2.28it/s, acc=0.961, loss=[0.103737995, 0.0, -0.6925928, 0.0, 0.68404084, 3.170
  0%|                                                                                          | 0/338 [00:00<?, ?it/s]epoch 9: 100%|#| 338/338 [02:27<00:00,  2.29it/s, acc=0.959, loss=[0.101936474, 0.0, -0.6876059, 0.0, 0.6542757, 3.1149
